[
  {
    "Name": "Michael Lee",
    "Intro": "Hi all! I'm Michael, an energy nerd and CEO/co-founder of Evolve Energy.  I've been in the renewables industry for the past 10 years and have seen this really interesting progression in wholesale energy markets where times of the day when renewables are abundant are also the lowest cost times of the day.  So at Evolve, we sell electricity at this wholesale power rate in deregulated markets to residential customers so they can save money AND truly decarbonize their footprint because they are implicitly shifting their usage to times when renewables are abundant and shedding load when it's coal and gas on the margin.  We do some fun stuff with IOT and ML to automate usage timing, which also translates to an interesting product for regulated markets/utilities.  This recent VentureBeat article describes it a bit more and happy to chat with anyone looking to understand this industry! (we're hiring soon!) https://venturebeat.com/2019/11/05/evolve-energy-uses-machine-learning-and-analytics-to-save-renewable-energy-customers-money/",
    "Category": [
      "Energy Systems",
      "Entrepreneur"
    ]
  },
  {
    "Name": "Joel Larsson",
    "Intro": "Hi everyone,  I’m Joel Larsson, just joined the slack, happy for the invite!\nSuper quick about me, I have a tech background in the startup scene, built a few startups, started an accelerator and a micro fund investing in startups.\nMy climate journey used to be a lot of personal changes, 5+ years ago I stopped all flying, skipped having a car, became vegetarian etc.\nMy next 10+ years will be focused on building a the top European climate focused VC fund with @Heidi Lindvall and @Hampus Jakobsson ($80m, seed stage, European focus, based in Malmö, Sweden)\nSuper inspired by reading about all initiatives in here and look forward to interact with the community! (edited)",
    "Category": [
      "Investor"
    ],
    "Location": "Sweden"
  },
  {
    "Name": "Jessica Lovering",
    "Intro": "Hello! I’m finishing up a PhD at Carnegie Mellon University in the Engineering & Public Policy department. My research explores the role that very tiny nuclear reactors (<10MW) could play in decarbonization. I’m looking for jobs starting next fall, preferably in nuclear.\nMy website: jessicalovering.com",
    "Category": [
      "Decarbonization",
      "Nuclear",
      "Research"
    ]
  },
  {
    "Name": "Paige Henchen",
    "Intro": "Hi all! I’m Paige Henchen. My background is in management consulting (Bain NYC / SF; I started in 2007). For the past year, I’ve been doing some climate-focused investing with my parents. (If you’ve listened to all of Jason’s podcasts, you’ll be familiar with one of our first investments – the amazing Prime Coalition!) I’m hoping to find a full-time job in climate, ideally in Colorado (or remote-friendly). I’m still early on the climate journey and I don’t yet have subject matter expertise to speak of. I do have the standard management consultant skillset of managing teams, analyzing data, etc. Please reach out if you have any advice or ideas for me. Thank you!",
    "Category": [
      "New Journey"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/6f92bb1617ac47abb4bd3f3f4428d165/11f9d331/Paige_Henchen_-_Management_Consultant_-_Bain__Company"
  },
  {
    "Name": "Jon Shieber",
    "Intro": "Hi everyone!!! I’m Jon Shieber, currently making words for public consumption at TechCrunch. In a past life I helped launch Clean Technology Investor at Dow Jones and spent a lot of time writing about the first wave of climate mitigation and sustainable technology startups. Hoping to cover this new generation of startups and the entrepreneurs and investors behind them! ",
    "Category": [
      "Journalist"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/9a5f7f19768330031a6829958aa07cac/45649bea/Jonathan_Shieber_-_Greater_Los_Angeles_Area__Professional_Profile_..."
  },
  {
    "Name": "Ted Dillon",
    "Intro": "I'm the Director of Marketing for Clean Energy Ventures (https://cleanenergyventures.com). We're a Boston-based venture capital firm focused on early-stage advanced energy technologies. As Director of Marketing I spend the majority of my time advising our portfolio companies on their brand and marketing strategies - helping them engage potential customers, develop thought leadership and position them for growth. GHG reduction is part of our investment thesis, which means every company we invest in has the potential to substantially reduce greenhouse gas emissions. If you're interested in learning more our first email newsletter was published this morning, a good place to get a quick look: https://mailchi.mp/cleanenergyventures/newsletter-001 . Before my current role I was Managing Director at an agency with a deep focus on clean energy branding and marketing. While I'm in this Slack I'm hoping to talk with anyone and everyone about messaging climate action and clean energy; I'm looking to make new connections and find new resources; and I'm looking for a tight knit and diverse community that can help inform my perspective on solving the biggest challenge of our time.",
    "Category": [
      "Investor"
    ],
    "Location": "Boston",
    "ImageUrl": "https://dl.airtable.com/.attachments/ab09dff390735238f7cc77f117139132/9d2abbcd/Ted_Dillon_evdillon__Twitter"
  },
  {
    "Name": "Jeremy Hitchcock",
    "Intro": "Excited to be here - I'm Jeremy Hitchcock. Live in Manchester, NH who is a Founder of Minim - cybersecurity and wifi management.  Opened a retail book store (real books) a couple years ago.  Formerly founder/CEO of Dyn which sold to Oracle.  Interested in the climate and environmental issues that we face.  Especially how to make them economically scalable or price them in.  Had a solar development company that sold (we were developing superfund sites).  Interested in water.  Happy to chat through concepts - also a capital source\n\n\n20 days agoView thread",
    "Category": [
      "Entrepreneur",
      "Water",
      "Helper"
    ],
    "Location": "NH",
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/1639b55b6c3972e3eb27f2de9dcb2ed0/2b3df562/Jeremy_Hitchcock_jhitchco__Twitter"
  },
  {
    "Name": "Paul English",
    "Intro": "Hello. I’m cto/founder of Lola.com business travel in Boston (and previously Kayak.com) and I worry about how travelers can be better climate citizens.",
    "Location": "Boston"
  },
  {
    "Name": "Brian Sloss",
    "Intro": "Hi All. Exited to join the conversation and thanks @Jason for the invite.\nMy first job out of college was carbon accounting for companies to help them understand their environmental impact. We would then sell them RECs and VERs to help them offset. After that I was a PM at Opower for five years, where we helped utilities drive energy efficiency using behavioral psychology.\nI’m now the CPO and co-founder of Disclosures.io, which is not climate related :( That said, in my spare time I’ve been trying to figure out how to drive the adoption of kelp into mainstream American foods (kelp is a major carbon sink). If you are interested in learning how to make kelp pasta, hit me up!",
    "Category": [
      "Decarbonization",
      "Energy Systems"
    ]
  },
  {
    "Name": "Hannah Davis",
    "Intro": "Excited to be here! I live in sunny Boulder Colorado and am the Program Director for the Techstars Sustainability Accelerator in partnership with The Nature Conservancy based in Denver. We’ve invested in 20 companies so far through this program and open applications in a month for our 2020 class. We work with startups working to solve for a more sustainable future in the areas of climate, sustainable food and water, protecting land and water, and greening cities. Been a longtime MCJ fan and looking forward to connecting with y’all.",
    "Category": [
      "Accelerator / Incubator",
      "Investor"
    ],
    "Location": "Boulder"
  },
  {
    "Name": "Parker ",
    "Intro": "Hi everyone. It’s a pleasure to meet all of you.  After two decades as an entrepreneur/maker of things (three companies, two airplanes and anything else my kids want to make), I spent the last several years on a FUSE Fellowship operating in the public sector as the chief innovation officer for a county library system, which has been rewarding, educational and created a lot of optimism about the role of libraries in our cultural infrastructure.  I’m also the founder of Tashtego, a small bag & accessories business that is offsetting our emissions through our entire manufacturing and distribution chain (via Climate Neutral).  For the past year I’ve been a Climate Reality speaker, which I enjoy, but I’m searching for better answers to the inevitable “what can I do?” questions.  My fellowship ends mid-summer and I’m ready to head back to entrepreneurship or another role that has an impact on the crisis.  I look forward to meeting and brainstorming with all of you.",
    "Category": [
      "Entrepreneur",
      "Community Organizing"
    ]
  },
  {
    "Name": "Jonah Greenberger",
    "Intro": "Hi all! I’m Jonah - cofounder of a company called Bright that’s now the leading resi solar company in Mexico. I’ve also been trying to do more investing in sustainability and  have been putting together some events to match cofounders in the sustainability space. Excited to get to know everyone!\n",
    "Category": [
      "Investor",
      "Energy Systems"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/655408d6d6962c5e6a3733504f59b50c/6ea22b7f/Y_Combinator-Backed_Bright_Aims_To_Bring_Solar_Power_To_Mexico_..."
  },
  {
    "Name": "Jacob Brown",
    "Intro": "Hi Everyone,\nJacob Brown, here. I'm an energy storage guy. I started out my career with fossil fuel companies in Australia and had a big change of direction after doing my PhD (chemical engineering) in the UK.\nI am now a tinkerer making Li-ion battery cathodes for C4V (day job) and hydrogen/non-Li-ion energy storage systems (not-so-day job) in New York.\nPlease reach out if you're ever interested in chatting energy or cutting through battery myths and misinformation.",
    "Category": [
      "Energy Systems",
      "Research"
    ],
    "Location": "NYC"
  },
  {
    "Name": "Kohzy ",
    "Intro": "Hi everyone! @Jason thanks a lot for adding me. I’m Kohzy, I am in product working on displays across transit systems at a company called Intersection. I’m in NYC. Really early in my climate journey, but Jason’s podcast was exactly what I was looking for to fast track my learning and listen to a ton of experienced smart people talk about what they see. Trying to see how I can help with climate issues and maybe even make it my job within the year!",
    "Category": [
      "New Journey"
    ],
    "Location": "NYC"
  },
  {
    "Name": "Jason Holt",
    "Intro": "Hi all — I’ve been in the renewables/climate/sustainability space for the past 25 years. Have taken a circuitous path to where I am today that only now starts to make sense. Started with atmospheric chemistry research in methane monitoring as an undergrad, low-cost silicon PV in grad school, then low-energy desalination technology that formed the basis of my first startup NanOasis (sold 2012). I later started a company developing low-cost electrochromic windows for buildings (Heliotrope) that’s now entering commercial production. Got into the investment side of things about 8 years ago, working with a single family office focused on climate-positive companies.  ",
    "Category": [
      "Research",
      "Materials",
      "Entrepreneur",
      "Investor"
    ]
  },
  {
    "Name": "erik stadigh",
    "Intro": "Hey friends! I’m Erik :wave: I grew up in Finland :flag-fi: (^so many of us here!) and am based in London :uk:. I spend my days supporting early stage enterprise and deep tech companies across Europe (www.crane.vc). Here to learn from some of the best and most passionate minds in this space, excited about the good discussions to come. If you're ever around Soho in London, come say hi!\nBeyond that, I like skiing and karaoke – am decent at the former, terrible at the latter.",
    "Category": [
      "Investor"
    ],
    "Location": "London"
  },
  {
    "Name": "Chris Knape",
    "Intro": "Hey everyone! I've been a lurker for a few weeks here but excited to finally introduce myself and connect with you all. About me: I've been in the Bay Area for about ten years. I started my career in technology, working for YouTube and Google before switching to startups. I just left Thumbtack, a local services marketplace where I led product for growth on one side of the marketplace. In terms of what's next, I'm planning on taking some months to go deep on figuring out where I can help in the climate change arena, whether that be advising, investing, or joining or starting something. On a personal note, I spent my childhood growing up on a sailboat in the tropics. I feel deeply passionate about the impact our carbon economy is having on the oceans and would love to connect with folks working in that area.\n",
    "Category": [
      "New Journey"
    ]
  },
  {
    "Name": "Sameer Rashid",
    "Intro": "I'm glad to be part of this group. Thanks for including me, @Jason. I'm a big believer in multi-disciplinary communities that lead to productive collisions, especially for the climate crisis.  \nMy journey began in 2005. After a few years on wall st, I co-founded a startup focused on food waste-to-biogas and compost using a digestion technology from Germany. KPCB ended up investing in the German company and incubated a startup called Harvest that acquired us. I stayed on with them for a year.\nFor the last decade, I've worked across several climate tech initiatives, mostly within carbon removal/conversion and a portfolio of digital-oriented startups. There were also a handful of storytelling and product development projects along the way. \nOn the carbon front, my colleagues and I helped raise ~$40M mostly from fossil fuel companies for the Carbon XPRIZE, a competition focused on sparking the carbon removal and conversion sector. We started an industry community called the Circular Carbon Network (link in the replies), designed to accelerate capital flow by leveraging network effects and knowledge share. We published an index last fall of technology developers and are now in the midst of developing an index of relevant capital providers. We were part of a lonely and niche group of believers and evangelists for much of the 2010s, but that's dramatically changed for the better in recent years. \nI've also got a small startup portfolio, either through advisory board participation or a few small checks. I spend about half my time working closely with HEVO, a wireless EV charging startup I'm excited about. Wires create a lot of problems for a variety of stakeholders and wireless charging addresses those challenges.  \nI live in Brooklyn with my wife, 3-year-old son, and 3-month-old daughter. I only started listening to the pod in the last few weeks, but I enjoyed the conversation with Albert Wenger. He's got interesting viewpoints and I appreciated Jason diplomatically asking challenging questions. If anyone is interested in EVs, carbon, or just a general chat, hit me up. I'm also in the Bay Area 1-3x per year. Thanks to all for devoting your time and energy to this challenge and opportunity. I look forward to making a positive contribution to this community.",
    "Category": [
      "Entrepreneur",
      "Decarbonization",
      "Investor"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/105c03602259a9f7879485e1ba2ca95c/f1757791/Pure_Energy_Partners"
  },
  {
    "Name": "Taylor Francis",
    "Intro": "Hello! I'm a co-founder (along with @Christian Anderson and @Avi Itskovich) of Watershed, a new startup helping businesses measure, reduce, and report their carbon emissions. I previously worked at Stripe on the Stripe Atlas team. Very excited to be a part of this community and grateful to @Jason for pulling it together.",
    "Category": [
      "Decarbonization"
    ]
  },
  {
    "Name": "Erika Reinhardt",
    "Intro": ":wave: I’m currently taking time off from working to learn more about climate change and figure out where I can have the most impact — ideally starting a company if I can find the right idea. My professional experience is mostly in SF startup software engineering management (leading groups of ~50 for the last 4 years at Stripe, OpenAI and Planet Labs), but I also studied mechanical engineering and wouldn’t mind getting my hands onto hardware again. I’m also getting into climate philanthropy and angel investing, and would love to hear about any great orgs and companies looking for support!",
    "Category": [
      "Entrepreneur",
      "Investor",
      "Helper"
    ],
    "Location": "Bay Area",
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/a424d771fe07515392cd09404541b749/f68a17b4/Erika_Reinhardt_embrein__Twitter"
  },
  {
    "Name": "Alex Mitchell",
    "Intro": "Svp at Los Angeles Cleantech Incubator (LACI). We incubate in the space of clean transport, clean energy and circular economy.  I'm focused on getting all hands on deck to scale climate solutions, whether getting VCs in the game or getting would-be entrepreneurs to consider starting a co in cleantech.  \n",
    "Category": [
      "Accelerator / Incubator"
    ]
  },
  {
    "Name": "Nick Reavill",
    "Intro": "Hi, I'm Nick Reavill, based in San Francisco. I left Stitch Fix as a Director of Engineering about a year ago and since then I have been consulting and trying to work out how to do some actual good in the world. As of a couple of months ago I have been focusing on climate change, so I'm really happy to be here to find out what you all are up to and get (and maybe even share) some good ideas.",
    "Category": [
      "New Journey"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "John Beatty",
    "Intro": "Hi all, I'm John Beatty. My day job is CEO/Co-Founder of Clover, a point-of-sale and payments company (you've probably used one of our white payment devices on a countertop near you). But I'm here in this community largely for personal reasons, figuring out the best ways I can make a large, positive impact. Jason's approach to the climate problem appeals to my sensibilities and I'm eager to meet like-minded folks working on pragmatic solutions. I'm exited to discuss ideas, meet future collaborators, and help instigate or contribute to projects, companies, and other organizations. Credit to @Gene Berdichevsky, a friend and guest on the podcast (Episode 65), for introducing me to MCJ.",
    "Category": [
      "Entrepreneur",
      "Helper"
    ]
  },
  {
    "Name": "Matthew Kaplan",
    "Intro": "Hi everyone! I'm Matthew, founder of Mobile Cooks, a passion economy for Vegan Chefs. I started Mobile Cooks last year while working at Toast in Boston after becoming more concerned about climate change and going vegan.\nMy favorite episode on the podcast so far as been the one with Pat Brown, CEO of Impossible foods. The way he describes food as technology was insightful. “the cow is a technology for turning plants into meat”\nWith Mobile Cooks, we're focused on creating great tasting food with as small of a carbon footprint as possible. You can learn more about our business on our investment campaign that we just launched today: https://republic.co/mobile-cooks. If you're in Boston and want to help in any capacity please reach out! (edited)\nmobilecooks.commobilecooks.com\nMobile Cooks\nMobile Cooks is a Plant-Based Catering and Pop-Up Company. Our mission is to empower cooks, support local farmers and feed you tasty and sustainable vegan food.(565 kB)\nhttps://i0.wp.com/mobilecooks.com/wp-content/uploads/2019/07/F0AzADug.jpeg\nrepublic.corepublic.co\nInvest in Mobile Cooks\nCentralized pop-up hub for vegan chefs and foodies(213 kB)\nhttps://uploads.republic.co/p/offerings/cover_photos/social_share/000/000/407/407-1573231377-cd177f230d70d25794feea0a0dfa553fa2c95fc3.jpg",
    "Category": [
      "Entrepreneur"
    ]
  },
  {
    "Name": "Tim Victor",
    "Intro": " I currently do business development for Scale Microgrid Solutions in Denver. We deploy and operate clean energy forward microgrids for C&I customers across the country. I'm originally from St. Louis, Missouri but while in grad school at Missouri S&T I got frustrated with my inability to study clean energies so I dropped out and moved west. It took a few years of job hopping in HVAC in CO and CA before I was able to join SMS here in Denver. My goal in life is to create a program to educate students at my alma mater about the low carbon future so they don't have to leave the Midwest like I did. ",
    "Category": [
      "Decarbonization",
      "Energy Systems"
    ],
    "Location": "Denver",
    "ImageUrl": "https://dl.airtable.com/.attachments/a61d9e137f0dc1d8d218c73993e8a157/5e8f599d/Tim_Victor_Tim_Victor___Twitter"
  },
  {
    "Name": "Ravi Mikkelsen",
    "Intro": "Hi everybody, Ravi here! @RaviMikkelsen on twitter. Oakland/Bay Area based climate-warrior. I heard my calling in August 2000, at my college orientation and have been working on various aspects of it ever since (with a few deviations from the path here and there to add chaos to my life for goo measure). Looking forward to meeting you all!\nNow, I run the @ClimateLink network of ClimateTech entrepreneurs, investors, jobseekers and more and we have monthly meetups to showcase new tech. Next week we have the ED of Project Drawdown coming to speak at our end of the year party https://www.meetup.com/ClimateLink-SanFrancisco/events/266244621/\nAfter working on the engineering side for years, I've switched to the financing side, helping startups raise capital through the ClimateLink network, developing a new loan model to get residential solar financed, and am now starting a bank to finance this transition.\nThere are a few of us looking to co-locate and work together, hopefully it grows into a full Bay Area Cleantech Incubator (think Greentown Labs but in Oakland) so if you're interested and you want to come in with us, let me know. (edited)",
    "Category": [
      "Community Organizing"
    ],
    "Location": "Bay Area",
    "Link": "http://climatelink.co/"
  },
  {
    "Name": "Rishabh Varshney",
    "Intro": ":wave: Hey everyone, I’m the co-founder of Buy with Impact (https://buywithimpact.com/), we’re working on launching a credit card which automatically offsets the carbon impact of your everyday purchases while also showing you your carbon score in an accompanying app.\nPrior to this I worked on monetization for Facebook Messenger and before that launched a local bartering app -> community focused on showing value of old goods to save them from going towards landfills while also providing value for others — we scaled that to 500k+ members in roughly 250 cities worldwide.\nClimate change has been dear to my heart for a long time and I believe tackling it from the fintech lens while making it as passive as possible for the average consumer is a great way to move forward to build out ethical financial services.\nLooking forward to being part of this community! PS, feel free to follow me on twitter @itsrishabh (edited)",
    "Category": [
      "Conscious Consumerism",
      "Finance"
    ]
  },
  {
    "Name": "Austin Whitman",
    "Intro": "Hello -- great to be on here. Thanks @Jason for all of the amazing convening and connecting you continue to do in this space. I'm based in Boston and run a new non-profit called Climate Neutral, which has a mission to get all brands to measure, reduce, and offset their carbon footprints. You heard all about it if you listened to Ep. 28 ... since we recorded we've bumped our count of committed brands to 70 with more on the way.",
    "Category": [
      "Decarbonization"
    ],
    "Location": "Boston"
  },
  {
    "Name": "Nuno Pereira",
    "Intro": "Hi, I'm Nuno, co-founder of https://holygrail.ai (S19), we've built the Brain https://holygrail.ai/brain that accelerates research and optimization in material science, electrochemistry, biology , manufacturing and other areas",
    "Category": [
      "AI",
      "Entrepreneur"
    ]
  },
  {
    "Name": "Michael Rigney",
    "Intro": "Hi everyone. I'm Michael Rigney and I'm in Boston. I've worked in clean energy for 15 years at start-up and rapid/hyper growth companies in demand response, grid reliability/grid edge, and energy efficiency. Functionally, I'm a commercial leader and senior executive. Along the way, I've also mentored start-ups, judged for clean tech incubators/awards, and generally sought to help out and immerse myself in the space. My background is in mechanical engineering. After the acquisition of EnergySavvy (enterprise SaaS for utilities) last year, I'm currently figuring out what's next. I love talking about all aspects of energy and climate change - feel free to reach out. And, thanks @Jason for putting together this community!",
    "Category": [
      "Veteran",
      "Energy Systems"
    ],
    "Location": "Boston",
    "ImageUrl": "https://dl.airtable.com/.attachments/44fb12817987582fd159f9c65536ee31/291f7e4d/Michael_Rigney_-_SVP_Client_Solutions_Marketing_and_Regulatory_..."
  },
  {
    "Name": "Daniel DeTone",
    "Intro": "I’m a machine learning researcher at an AR company called Magic Leap, I’ve been there for almost 5 years. I focus on studying new methods at the intersection of Deep Learning and SLAM (the enabling technology at the core of self-driving cars, drones and AR), as well a variety of other computer vision projects within our AI group. I like to build things that actually work, rather than just perform well on a few benchmarks. I haven’t worked much on climate, but I’m now trying to understand the problem a bit more and see how my skills could help in the future.  I’m currently living in Berkeley, CA, but my partner just got a faculty position (in Earth Science) in LA, so we will be moving there in 2021.\nI’m especially keen on meeting others 1.) in AI/computer vision + climate realm and well as 2.) climate folks based out of LA as I contemplate my next career move. Feel free to reach out if you want to chat :)",
    "Category": [
      "Engineer",
      "AI/VR/XR",
      "AI",
      "New Journey"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/c7e5106cad35b58e4cfdd9aad989ca73/bb820396/Daniel_DeTone_ddetone__Twitter"
  },
  {
    "Name": "Marilyn Waite",
    "Intro": "Dear all, I’m Marilyn Waite, leading a portfolio on climate and clean energy finance at the Hewlett Foundation. I’m on episode 66 to try and explain what we do with our unaccountable cash. My background is in nukes and some renewables (AREVA-France; now known as Orano), early stage venture capital for energy/transportation startups (Village Capital), and other digressions. More about me on marilynwaite.com. When I’m in the States, I’m mostly in Oakland, CA these days and always interested in talking shop at a cafe nearby. My markets are China, the EU, and US. Nice to see so many friends in this group. Merci @Jason",
    "Category": [
      "Investor",
      "Finance",
      "Energy Systems"
    ],
    "Location": "Bay Area",
    "Link": "marilynwaite.com"
  },
  {
    "Name": "Anku ",
    "Intro": "Hi everyone! I'm excited to join the community, seems like an incredible group of people with a common vision and goal!\nMy name is Ankesh Madan (I go by Anku), and I'm currently in early-stage VC at Plug and Play Ventures on our New Materials & Packaging team.\nI have a materials science background from NC State, happily left my Ph.D. at Duke a few years ago, and co-founded a company called Undercover Colors in 2014.\nI'm a long-time listener of MCJ and have been cheering on the climate fight from the sidelines for years now, but recently decided that it's long past time to get off the bench and take on a more active role, so I'm excited to dive in and meet more of the community as I figure out how I'm best suited to help. I'm based in Palo Alto, would love to grab coffee or host anyone who is in the area!\nShoutout to @Jason for putting this all together.",
    "Category": [
      "Investor"
    ]
  },
  {
    "Name": "Libby Spalding",
    "Intro": "Hi all, I’m Libby and I work in product at Granular, an agtech company. I’m interested in water and ag, in particular, water rights, scaling regenerative practices and improving efficiencies in nitrogen use. I’m spending more time thinking about how I can have the biggest impact on climate and grateful for communities like MCJ! Based in SF and interested in meeting up with anyone exploring ag or water in the Bay Area.",
    "Category": [
      "Food & Ag",
      "Water"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Dan Hammer",
    "Intro": "I’m excited to join this channel! I cofounded an environmental nonprofit called Earthrise Alliance to better utilize Earth observation for climate action. We write policy and build product to increase the meaningful use of Earth observation, like satellite imagery, for basically anything aside from military applications or commodity trading. For example, we’re building an educational platform to enable students to support real-life investigations from satellite imagery as part of their core curriculum.\nEarthrise was co-founded with Lori Garver (former Deputy NASA Administrator) and Steve McCormick (former CEO at The Nature Conservancy). The advisory board consists of veteran scientists and technologists who care deeply about climate, including Megan Smith (U.S. CTO), Cady Coleman (Astronaut), and Ellen Stofan (NASA Chief Technologist).\nWe have a side hustle building applications and websites for other climate-related projects, like stopthemoneypipeline.com which just launched today with 350.org and web stuff for hudsoncarbon.com.\nPreviously, I worked as a Senior Policy Advisor in the Obama White House, a Presidential Innovation Fellow at NASA, and a Fellow at National Geographic. I also cofounded and built the first few versions of globalforestwatch.org and spaceknow.com. I graduated from UC Berkeley with a PhD in environmental economics, and still live in Berkeley with my family.\nwww.danham.me/r",
    "Category": [
      "Remote Sensing",
      "Policy",
      "Entrepreneur"
    ],
    "Location": "Bay Area",
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/1abcfce60d1e2a57216bbaa69f6cc20e/197ffce2/Dan_Hammer__Berkeley_Institute_for_Data_Science"
  },
  {
    "Name": "Shyam Srinivasan",
    "Intro": "Hi everyone!  I'm Shyam Srinivasan, founder & CEO at Zitara Technologies - we build a data and control SaaS platform called Battery Fleet Operations Intelligence for operators of lithium batteries in mobility and stationary storage - we're making batteries insurable and bankable!\nWe're presently deploying two products on our platform: Predictive Safety, which detects thermal anomalies in battery packs before they cause fires; and Predictive Performance, which helps predict and maximize storage asset ROI.  I love talking electrification, renewables, energy storage, and electrochemistry - please feel free to reach out!",
    "Category": [
      "Entrepreneur"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/88404bc7df2f493d37a547c351607466/82b7f1e2/Shyam_Srinivasan_-_Wikipedia"
  },
  {
    "Name": "Daniel Yawitz",
    "Intro": "Hi all - honored to be part of this talented and motivated group.  I am new to the climate issue and about two months into the process of getting educated as quickly as possible.  Currently devouring MCJ episodes.  I am hoping to find the right entry point to get involved in the climate issue as an investor, donor, co-founder, and/or volunteer.\nI have backgrounds in pension asset management, microfinance investing, and software development.  Most recently I've co-founded a game company and created a multiplayer VR game that we are releasing next year to the home and arcade markets.  St. Louis native, I now live in NYC with my wife and three young kids.  Happy to chat with anyone on any topic and looking fwd to learning from all of you.",
    "Category": [
      "Finance",
      "Computer Science",
      "AI/VR/XR"
    ],
    "Location": "NYC"
  },
  {
    "Name": "Chad Frischmann",
    "Intro": "My name is Chad Frischmann, and I am one of the originators of Project Drawdown with Paul Hawken and Amanda Ravenhill, as well as a Co-Author of the book Drawdown: the most comprehensive plan ever proposed to reverse global warming. Since we started in 2014, and still to this day, I am the head of research and technology development, as well as the lead of the Drawdown Global Research Collaborative and other partnerships.\nI designed our research methodology and models that can evaluate the potential of nearly any technology or practice contribute to achieving Drawdown (the point in time when we stop and begin to reverse global warming). Over the years, I led our team of over 80 research fellows from around the to collect data on the most viable climate solutions to input into our model sand determine if Drawdown is possible.\nGood news: it is!!  Please check out our website at www.drawdown.org or pick up the book at your local bookstore to learn more.\nBut also be prepared: I am just wrapping up the latest set of results for our Drawdown 2020 Review coming out very soon (until the printers let us know, I'll keep the date under wraps, but I can say that Saturday is my final model run :wink:. Most of the assessments and models were updated over the last year, and the results and rankings have changed. Not enough for you to not go buy the book though (seriously, the book is worth it).\nWhat I can offer: anything and everything related to Drawdown or Regeneration. If you want to hear a talk for your community (big or small), feel free to reach out. My current talk is Drawdown to Regeneration: creating the Future We Want today.\nWhat I need: We are in the process to developing an online knowledge platform for solutions built around the Drawdown Global Research Collaborative. Python software 70% complete (I need more coders!), Data Repository being developed (I need Commoners!), Dynamic User Portals being conceived (I need designers, facilitators and volunteer stakeholders!), Collaborative being launched (I need researchers and data collectors!), and funders are being sought (I need funding!!).\nReach out anytime on here or at chad@drawdown.org. ",
    "Category": [
      "Decarbonization",
      "Research"
    ],
    "Link": "drawdown.org",
    "ImageUrl": "https://dl.airtable.com/.attachments/37b0695a83e969bb34afdbf0e79deb8f/4b8bffcf/Global_warming_could_be_in_reverse_by_2050_if_we_take_action_now_..."
  },
  {
    "Name": "Heidi Lindvall",
    "Intro": "Hi everyone, I’m Heidi, from Finland :flag-fi: and based in Malmö. I’m in the process of setting up a climate VC fund with @Joel Larsson and @Hampus Jakobsson based in Sweden but investing in seed stage startups in Europe and US.\nI have a background in Human Rights and Media, have made documentaries around the world, built a few tech startups in London/Berlin and Silicon Valley and finally moved over to the accelerator/investment side a few years ago. Have always had an interest in climate change but am only now taking time to learn more and I’m very grateful to be in this group to learn from all of you!",
    "Category": [
      "Investor"
    ],
    "Location": "Sweden"
  },
  {
    "Name": "Lenny Rachitsky",
    "Intro": "Hi everyone! I’m excited to finally join this group that I’ve over and over heard such great things about :heart_eyes:\nI live in SF, grew up in LA and SD, and was born in Ukraine. I hard a startup back in the day, then worked at Airbnb for a long time, now exploring what’s next. So far this has consisted of writing, advising, and investing. One of my favorite investments was Wren, which is one of the ways I heard about this group. I’m excited to both learn from this wonderful collection of humans and also find ways to contribute.",
    "Category": [
      "Technologist",
      "Investor"
    ],
    "Location": "Bay Area",
    "ImageUrl": "https://dl.airtable.com/.attachments/fbae7fdffe2f0c743c74ab99dee5225c/24fa980c/Lenny_Rachitsky_-_Medium"
  },
  {
    "Name": "Jon Leland",
    "Intro": " I’m currently the head of environmental impact initiatives at Kickstarter, where I’m also VP of Insights. At Kickstarter, I’m mostly focused on how to reduce to carbon footprint of our ecosystem and embed sustainable values/practices into companies at their inception. I’m also the creator of This Place Will Be Water and am working with a climate scientist on a new project, This Place Will Burn, mapping future wildfire risk in ways that people can easily understand. In past lives I worked for the NRDC in environmental justice and in climate policy for the Palau mission to the U.N. Looking forward to learning more from this community and hopefully finding ways to support each other as we mobilize to tackle this existential challenge. ",
    "Category": [
      "Data (Science)",
      "Decarbonization",
      "Sustainability"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/0df254c0fac0b5bce468ba484e32a450/0a5eb95b/Jon_Leland_JonathanLeland__Twitter"
  },
  {
    "Name": "Eric Cooperstrom",
    "Intro": "Hello all, I’m excited to join the MCJ slack and to keep listening to Jason’s podcast. I’m currently working at NatureVest, the conservation impact investing arm of The Nature Conservancy. Our work touches down on renewable energy, sustainable agriculture, marine protection and water rights trading. I’ve also worked with rePlant Capital in the regenerative at space. I’m open for discussions on the full gamut of climate issues and for new opportunities. I’m looking forward to connecting with everyone!",
    "Category": [
      "Investor"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/b4ef883f6e673a60ff0d63ba709d4963/f7cc3e07/Eric_Cooperstrom"
  },
  {
    "Name": "Jana ",
    "Intro": "Helloo there :wave:,\nmy name is Jana,  Co-founder at COACT, an environmental tech incubator (www.coactlab.org) based in Barcelona. We enable innovators to develop solutions to the world’s most pressing ecological and climate related challenges. We aim to maximize impact over profit, currently hosting 2 open source projects in the area of reforestation & forest protection.\nVery happy to meet you all :deciduous_tree:",
    "Category": [
      "Accelerator / Incubator"
    ],
    "Location": "Barcelona"
  },
  {
    "Name": "Sarah Kearney",
    "Intro": "Hi @channel! I’m Sarah. I live and work in Boston - I was featured on Episode 5 (thanks @Jason!) The podcast has been useful to me and to my organization Prime in SO many unexpected ways (training new hires, connecting with new philanthropic partners, clarifying Prime’s goals to pipeline partners, etc). I’d love to hear from anyone that is interested in catalytic capital for climate innovation. Until I see a callout or direct message badge on the MCJ channel, I’ll be working away on other Slack channels, doin  my thang to support neglected but badass entrepreneurs that need support!",
    "Category": [
      "Investor"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/6609fbb3dbfdfb1beb78deff0416074e/5e42be89/Who_is_Prime_-_Prime_Coalition"
  },
  {
    "Name": "Jack Kelly",
    "Intro": "Hi!  A year ago, I left Google DeepMind to help build Open Climate Fix (along with Damien!)  I'm a machine learning guy who's terrified by climate change, and keen to do what I can to help reduce emissions ASAP.  We're focused on opening up energy & weather data to help people build better solar PV forecasting algorithms; and then we want to help put those tools into production.",
    "Category": [
      "Entrepreneur",
      "AI"
    ]
  },
  {
    "Name": "DanielErnst ",
    "Intro": "Hello MCJ travelers\nI am Daniel Ernst a technology, media & telecom investor / analyst on a simultaneous climate and career transition journey. ( as in Im looking for a job, preferably a career, and a forever home)\nI have enjoyed a front row seat to tremendous secular change. Early in my career I built spectrum auction models, and I continued to cover the industry’s evolution as mobile overtook landline, and as smartphones surpassed personal computers. Along the way, I covered e-commerce, streaming media, interactive entertainment, social networks, semiconductors and cloud software.\nApplying that structural lens to the broader economy, I see an accelerating shift toward sustainability. As monumental as technology-driven change has been, I believe the transition to a low carbon economy will be significantly more disruptive. ( disrupt or we die )\nI believe my experience identifying technology driven secular shifts is directly applicable to understanding the circular economy transition.\nBeyond core renewable technology, I believe innovations from ai to iot hold great promise to improve efficiency in agriculture, buildings, manufacturing and logistics.\nDespite the tremendous uptake of funds embracing ESG, signing commitments like the PRI and Climate Action 100, most of those portfolios are uninspiring and the earth is still warming. ( striking parallels to funds that largely ignored AAPL AMZN ATVI CRM NFLX until the disruption they wrought was better understood)\nIve been to several sustainable investing conferences, taken courses, read a ton, listened to (almost) every MCJ episode and completed the first level of SASB - Sustainable Accounting Standards Board certification.\nThanks for reading this far, looking forward to what’s next",
    "Category": [
      "Investor",
      "Sustainability"
    ]
  },
  {
    "Name": "Dan Wojno",
    "Intro": "Hi Everyone - excited to be joining the group. I'm a co-founder of Impossible Diamond.  We have developed a process to use CO2 captured from the atmosphere to grow diamonds. Right now we are in the throws of our first round of fundraising which will allow us to produce our first diamonds \"from thin air\"!",
    "Category": [
      "Entrepreneur"
    ]
  },
  {
    "Name": "Stina Brock",
    "Intro": "Hi all - Happy 2020! Great group on here. I’m Stina Brock. I head North America for Electron, an energy tech startup based in London, UK. I was previously at EnerNOC, Primus Power, and Sunverge. I’m currently trying to figure out how we can speed up the adoption and deployment of all the existing energy technologies we already have to help in the climate fight. At Electron, we’re working to do this with a platform that lets utilities take a market approach to working with distributed energy resources. I’m based in Jackson Hole, WY and I am looking forward to being connected with this fantastic group of people. Thanks for doing this, @Jason!",
    "Category": [
      "Energy Systems"
    ]
  },
  {
    "Name": "Aditya Priyadarshi ",
    "Intro": "I'm from India but have been traveling around the world for almost a year. Currently in Vietnam, SE Asia. I have kind of taken a detour from the corporate ladder (bigger brands -> more salaries -> promotions) to focus more on real impact and things that matter (climate change being one). and of late I have been working with startups in this space. Before this, I have worked as a product manager and entrepreneur for over 4 years mostly in the travel and e-commerce industry, having worked on pretty much the entire product management spectrum. I have a formal education in Mechanical Engineering, Operations Research and Business Administration (all over the place, yaay!). Outside of traveling, I love reading, motorbikes (track racing/touring), cooking and doing headstands\nThere are infinite possibilities out there. Here to interact and collaborate to make the most of such possibilities with like minded problem-solvers!",
    "Category": [
      "Travel",
      "Entrepreneur"
    ]
  },
  {
    "Name": "Caroline Clark",
    "Intro": "Hey everyone! I work at Sequoia Capital. We're an early stage focused venture firm and have invested in many companies, including Dropbox, Airbnb, Stripe, and Apple. Myself and Bryan Schreier (https://www.sequoiacap.com/people/bryan-schreier/) have been looking a lot into climate tech opportunities. Jason Jacobs has built an impressive podcast (my favorite episodes are the Carbon Engineering, Joro, and USV ones). We're always interested in learning about the space (whether it's interesting technologies, other investors, or general insights) - I will check this but also will be checking my email more frequently at caroline@sequoiacap.com. (edited)",
    "Category": [
      "Investor"
    ]
  },
  {
    "Name": "Rob Day",
    "Intro": "Hi, 15-year investor in this sector. At my firm, we provide project equity / \"blank-as-a-service\" capital to help companies with sub-utility scale solutions across energy, food, water and waste. Basically looking to unlock for the rest of the sustainability universe what 3rd party capital unlocked for rooftop and community solar. If that sounds like something one of your companies might need either now or down the road, please do reach out, always happy to chat. We're based in Boston and Montreal, come say hi!",
    "Category": [
      "Investor",
      "Energy Systems",
      "Veteran"
    ],
    "Location": "Boston"
  },
  {
    "Name": "Peter Olivier",
    "Intro": "Hi all! I'm Peter Olivier. Very excited to be in this group, and grateful to @Jason for making space for everyone here. I've done a bit of everything - first international development focused on microfinance, then international entrepreneurship with endeavor.org, and then a jump into software over the last 7 years, leading product teams at nonprofits dipping their toes into the software development world.\nAfter a lot of climate-related reading over the last couple years, (and like many it seems here, having my first kid :boy: ), I started following the MCJ podcast last summer was inspired to take action. So, two weeks ago, I finally made the jump and I left my job as a PM to focus full time on transitioning into the climate fight. Wish me luck! :pray:\nSince then, I've been:\nreading: mostly this, thank you @Ryan Orbuch https://docs.google.com/document/d/1DfZrTdy4cKb-VN7e_-E4oNe6WZpqVnvVGkzf8jMYTjs/edit\nwriting, on occasion: peterolivier.substack.com\nlistening: to MCJ of course, which as you all know, is itself a part time job :wink:  and taking Michael Mann's EdX class.\ntrying to contribute: to #climatelandscapemapproject (thanks for the opportunity @Brendan Loudermilk) and to my friend @Danny McGee's sustainability company when possible.\nI'm in Hudson, NY and look forward to meeting more of you, and working with you all.  :wave:",
    "Category": [
      "Entrepreneur",
      "Finance"
    ]
  },
  {
    "Name": "Paul Gambill",
    "Intro": "Hey yall, I’m Paul Gambill, CEO at Nori. I got interested in solving climate change in 2015, and started looking around wondering why there weren’t more large scale efforts to just remove all of the CO2 emissions we’d put up into the air. I started a networking group in Seattle about carbon removal, and through that created Nori, a marketplace for carbon removal, in 2017. We’ve been going for two years now, and we just launched our first carbon sequestration project in October. Nori is building the financial infrastructure that makes large-scale carbon removal possible. We also host a weekly podcast hosted by @Ross Kenyon (Nori) called Reversing Climate Change.\nI love talking about all things carbon removal, economics, geopolitics, and how Project Fix Climate Change should go. More on Nori at https://nori.com. (edited)",
    "Category": [
      "Entrepreneur",
      "Decarbonization"
    ]
  },
  {
    "Name": "Ryan Peterson",
    "Intro": "Hi everyone, I'm Ryan Peterson and I'm thrilled to join this group. My background is in technical recruiting, with particular expertise in building engineering and research teams. Like all of you, I am deeply concerned about the climate, and have decided to join the fight by lending my talent acquisition experience to the carbon removal space specifically. I want to help connect folks looking to make an impact on climate with the startups needing to grow, so I've recently begun work on a startup of my own called CarbonHuntr. We are a small team of Silicon Valley and Seattle technical recruiters (Google, Facebook, Amazon, various startups) dedicated to building the carbon removal ecosystem.\nWe're just getting started our journey as well but if you're interested in learning more about what we're working on, please feel free to reach out to me here directly and connect with us on Twitter @CarbonHuntr. Great to meet you all, looking forward to the conversations!",
    "Category": [
      "Entrepreneur",
      "Careers"
    ],
    "Link": "http://carbonhuntr.com/"
  },
  {
    "Name": "Matt Sly",
    "Intro": "Glad to be here and props to @Jason in building this community - hustle and humility go a long way.  I’m based in Boston (Jamaica Plain) - I build software and my current day job is at Amazon (Alexa), where I’m part of the Climate Justice group. Quick plug is that there are some high impact jobs open (mostly Seattle) related to the Amazon climate pledge (Paris 10 years early: https://press.aboutamazon.com/news-releases/news-release-details/amazon-co-founds-climate-pledge-setting-goal-meet-paris) - https://www.amazon.jobs/en/teams/sustainability?offset=10&result_limit=10&sort=relevant&distanceType=Mi&radius=24km&latitude=&longitude=&loc_group_id=&loc_query=&base_query=&city=&country=&region=&county=&query_options=& - happy to give more info to anyone interested.\nI first grew concerned about climate change back when I was a student of Nat Keohane (ep. #36) and classmate of @Austin Whitman (ep. #28) - working to model offshore wind and understand the offsets market. On the personal side, I’ve been bike commuting exclusively for a decade, and last year I installed solar panels (which in addition to being environmentally beneficial is proving a crazy positive NPV as well), my family of 4 went red-meat-free and we got rid of a car - all relatively painless. Even though from a quant perspective individual action is small potatoes, I am bullish on the cultural ripple effect of taking these types of actions…and talking about them :slightly_smiling_face: -  I’m interested to learn from all of you, explore ideas and investment opps, and help where I can.\n",
    "Category": [
      "Helper"
    ],
    "Location": "Boston"
  },
  {
    "Name": "Charles Van",
    "Intro": "Hey everyone, I’m Charles, and i’m currently the Machine Learning Specialist for a conscious consumerism platform called Trestle (www.mytrestle.com) that allows online shoppers to see and understand the sustainability practices about the brands they shop from and receive recommendations for brands that better align with their person values of sustainability.\nI’d like to further the fight for sustainability by applying my skills in ML and deep learning to carbon removal projects. In fact, I will have one underway soon and will be looking for people to join and help out.\n\nFeel free to message me about anything even if it’s just to say hi and chat!\n\nHappy to be here!",
    "Category": [
      "AI",
      "Decarbonization",
      "Conscious Consumerism"
    ]
  },
  {
    "Name": "Matt Brown",
    "Intro": "I lead Corporate Development for LO3 Energy out of Brooklyn. We're working with utilities to deploy local, community marketplaces for distributed renewables. Making climate local and giving consumers the opportunity to engage beyond just dollars and kilowatt hours. \"Community\" means something to everyone - our projects see everything from a neighborhood, parents/school district, to fans of the same football club. Marketplaces can provide an important foundation to deliver value both to the grid and utility customers - increasing hosting capacity for more distributed renewables in ways that align commercial incentives for critical actors in our collective climate journey.\nMarket solutions have always been a favorite - went deep on cap and trade as an Environmental Economics undergrad when it was cool (it was, at one point..I think?). In DC during Cleantech 1.0 and with Braemar Energy Ventures and CREO in the early stage investing realm. Truly looking forward to lending a voice - feels like there's something special here.",
    "Category": [
      "Energy Systems"
    ],
    "Location": "NYC",
    "ImageUrl": "https://dl.airtable.com/.attachments/436f95a4f4f920f73c7cf489f2dbdfc5/e1957290/Matt_Brown_-_LO3_Energy"
  },
  {
    "Name": "Remy Evard",
    "Intro": "Greetings!   I'm Remy Evard, in the Boston area.  I'm the Chief Information & Digital Officer at Flagship Pioneering - a firm in Cambridge that incubates and launches biotechs and sustainability companies, one of which is Indigo, the subject of MCJ #70.   Before Flagship, I was Global CIO for Research at Novartis for over a decade... nothing to do with climate, but a lot to do with helping patients and improving the process of innovation and discovery.    I'm actively looking for ways I can help with the climate disaster, in both large and small ways.  Oh, and I happened to drop in on MCJ HQ at an opportune moment, ending up being the guest interviewer of @Jason for MCJ #63.",
    "Category": [
      "Accelerator / Incubator",
      "Research"
    ],
    "Location": "Boston",
    "ImageUrl": "https://dl.airtable.com/.attachments/c697066859bf0726f7efe9c893205a31/e4bbd730/Remy_Evards_email__phone__Flagship_Pioneerings_Chief_..."
  },
  {
    "Name": "Ryan Shearman",
    "Intro": "Hi all! My name is Ryan Shearman and I’m from NYC. I am the founder of a company called Impossible Diamond. We capture carbon dioxide from the atmosphere and transform it into the world’s first truly guilt-free diamonds. Diamonds from thin air, essentially. We’ve been developing our process for the last year and a half and will be going into production as soon as we close our current financing round - followed by a public launch later this year. Outside of work, I’m a huge EV buff and tinkerer. I built a handful of electric motorcycles in the late-aughts and hope to purchase my first mass-produced electric motorcycle this coming spring. Great to meet everyone! (edited)",
    "Category": [
      "Entrepreneur"
    ],
    "Location": "NYC"
  },
  {
    "Name": "John Tough",
    "Intro": "I am the Managing Partner at Energize Ventures, an early-stage venture fund focused on software technologies that address the energy and industrial markets. We are based in Chicago but invest across North America and Europe. We invest in Series A-C companies. We tend to find that there is an 'alphabet soup' for rounds in this market, but usually it means there is early hints of commercial traction being rolled out.\nExamples of our investments range from data platforms monitoring climate adaptation (Jupiter Intelligence) -> renewable energy design (Aurora Solar) -> electrification of transport (Volta Charging).\n",
    "Category": [
      "Investor"
    ],
    "Location": "Chicago",
    "ImageUrl": "https://dl.airtable.com/.attachments/08aa6f6ed324721a13df241ffe937779/b758a7f4/About_John_-_Tough_Ventures"
  },
  {
    "Name": "Dominic Falcao",
    "Intro": "Hullo! I'm one of the founders of Deep Science Ventures (dsv.io). We work in applied science focused on Energy, Agriculture, Computation and Pharma. In climate, we're currently working up brand new company concepts to unify carbon markets, to convert flue gas in to high value chemicals, to breed alternative pollinators and a bunch of other fun projects. We're currently working up a thesis that involves ideas like \"energy efficiency is actually a bad thing on average\" and \"fuel should not be the end goal of CCU, but rather preserving carbon-carbon complexity\" and \"never wait for policy, sovereign nations have greater intrinsic interest in the maintenance of the status quo than anyone else\". I wholeheartedly welcome the debate! Also interested in bringing together a coalition to create a green chemistry supermajor to wipe out incumbent industrial petrochem by providing massive scale to really promising technologies whose commercial viability is a function of their integration into a global chemicals supply chain. Could not be more excited to see the sort of conversations going on here. (edited)",
    "Category": [
      "Investor",
      "Accelerator / Incubator"
    ],
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/f0283936d1853093fb02463ffcb4313a/4bb82252/Dominic_Falcao_-_Founding_Director__Deep_Science_Ventures_..."
  },
  {
    "Name": "Abe Yokell",
    "Intro": "Hello all! I co-founded Congruent Ventures with @Joshua Posamentier three years ago to bring early stage venture back to sustainability after the post-2008 doldrums flight of capital from the sector.  Congruent is focused on Pre-Seed, Seed, and early Series A investing in sustainability across a few macro themes (Energy/Urbanization/Food/Production & Consumption). I’ve dedicated my career to fighting this fight and am now 16 years deep (13 years at a $850M+ Cleantech venture fund with @Daniel previous to Congruent). \nI am struck by the energy and attention our climate challenges are attracting from a wide talent pool – amazing to see this level of engagement (yeah @Jason)! We (along with many others here I’m sure) would love to chat if you’re thinking about pre-Seed/Seed (we’re SF based). Our current average check size at entry is ~$1M (~$100M first fund). We typically lead or co-lead given the lack of early stage institutional activity in the sector, but we’re very happy to follow when there are other financial leads. Feel free to hit us here or me directly at abe@congruentvc.com!!  Oh, and let me know how I can be helpful :zany_face:\n:",
    "Category": [
      "Investor",
      "Helper"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Olli Tiainen",
    "Intro": "Hi everybody and greetings from Helsinki, Finland!\nHappy to be part of this group. Thanks for the invite Jason!\nMy name is Olli Tiainen, CEO & co-founder of Mattermore  - a data science community for the climate.\n\nOur mission is to get the best and the brightest to build data-driven solutions to climate change.\nWe want to help professionals find problems to solve and people to solve them with - and turn those relationships into collaborative work, projects, and full-time jobs.\nMattermore is beta and invite-only for now, but we'll soon open it up for the larger audience. If you're interested I'm more than happy to answer any questions.",
    "Category": [
      "Data (Science)",
      "Entrepreneur",
      "Community Organizing"
    ],
    "Location": "Finland",
    "Link": "https://mattermore.io"
  },
  {
    "Name": "Juan Pinilla",
    "Intro": "Hi all, my name is Juan, I'm currently living in Amsterdam but originally from Argentina. I've recently joined the investment team at BlueYard (http://blueyard.com/) having previously worked at Starlight Ventures and Kaszek. Happy to talk with anyone and always love learning more about this problem and potential solutions.",
    "Category": [
      "Investor"
    ],
    "Link": "http://blueyard.com/",
    "ImageUrl": "https://dl.airtable.com/.attachments/4b172112d8418eab68b0c1428aa08c3c/7120d5ac/BlueYard_Capital_Management__BlueYard_Capital_Employees"
  },
  {
    "Name": "Caitlin Drown",
    "Intro": "Hey there! I'm Caitlin - Brand + Communications Manager over at Climate Neutral (climateneutral.org). We're a new non-profit organization helping companies take responsibility for their carbon emissions by streamlining the path to carbon neutrality. We have 100+ brands (including Reformation, Allbirds, and Klean Kanteen) committed to measure, reduce, and offset their 2019 carbon emissions. Upon successful certification, they can use the Climate Neutral Certified label on products, packaging, and marketing materials. We just kicked off our 2019 certification period and launched our footprinting tool to measure brands' carbon emissions. I'm excited to join the channel!",
    "Category": [
      "Decarbonization",
      "Branding"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/bcef7e5e88f18ab445617b6c90c9acaa/d3764294/Caitlin_Drown_-_Brand__Communications_Manager_-_Climate_Neutral_..."
  },
  {
    "Name": "Daniel Lichtenberg",
    "Intro": "Hi! I'm Dan - I'm an former banker + engineer, based in Orange County, CA. Currently trying to figure out how to have a bigger positive impact on climate, particularly interested in food and water and helping to mobilize capital. Gratitude to Jason and MCJ for the work he's done including providing this platform!",
    "Category": [
      "New Journey"
    ]
  },
  {
    "Name": "Joel Moxley",
    "Intro": "So grateful for the invite @Jason! I am a Chemical Engineer working with Breakthrough Energy Ventures (https://www.b-t.energy/ventures/) alongside a pre-existing VC fund (https://moxleyholdings.com/) and data science service company (https://rho.ai/). I also co-teach with Dave Danielson the Stanford Energy Ventures class for three academic quarters each year.  In general, I am passionate about the generational economic transformations happening with both data science and climate. On a personal front, I have four daughters ages 9, 8, 6, and 3. Again, so grateful to get plugged in here.",
    "Category": [
      "Data (Science)"
    ],
    "Location": "Bay Area",
    "Link": "rho.ai",
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/315edb192ee478d88a3059cd8731389a/08c0d705/Mr_Joel_Forrest_Moxley__Energy"
  },
  {
    "Name": "Joel Armin-Hoiland",
    "Intro": "Hi everyone, glad to join the MCJ slack after enjoying the podcast. I currently split my time between Europe and Northern California and work in international climate-related sustainable development––and have for the last decade or so––including with Inyenyeri, All Power Labs, and others (hi @Noah Deich), and in California environmental policy/conservation before that.  Working in my \"spare time\" on developing innovative climate finance solutions with folks like @Tom Price and @Remi Bouteille, and consulting on some DOE SETO and regen ag projects in the US and with Enabel (Belgian aid agency) in East Africa. I'm open to new opportunities in climate finance and public policy. Thank you very much to @Jason for creating this community, and looking forward to harnessing the power of this network to create even greater climate impact! Please don't hesitate to reach out if I can serve as a resource for you.",
    "Category": [
      "Policy",
      "Sustainability"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/511ebd773e6466aeffc5de67942f586c/974e51fe/Joel_Armin-Hoiland_-_ALL_Power_Labs"
  },
  {
    "Name": "Caroline Spears",
    "Intro": "Houston native now based in SF. I run Climate Cabinet - we use a climate data platform to help political candidates run and win on climate change. We started advising political candidates on their climate platforms about 2 years ago, and now we're scaling for 2020! Excited to hear about what other folks are working on (if you're looking to combine tech & climate - or if you're in the policy/politics space - reach out!). Thanks to @Eliza Nemser & @Daisy for the group suggestion",
    "Category": [
      "Policy"
    ]
  },
  {
    "Name": "Josh Wills",
    "Intro": "Hi! My name is Josh Wills, I was most recently an engineer at Slack and worked at Cloudera and Google before that. I'm taking some time off right now but have been spending much of my downtime reading about climate change and renewables tech and am here for inspiration as I kick off my own climate journey!",
    "Category": [
      "Data (Science)",
      "Technologist",
      "New Journey"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/0203a755db58cd4c1635fecffe31cc1f/5ececb84/Josh_Wills_-_gRPC_Conf_2019"
  },
  {
    "Name": "Michelle You",
    "Intro": "Hi, I live in London, grew up in California. I’m one of the founders of Songkick and was CPO there for 9 years before leaving the company. Songkick was funded by YC, Index, and Sequoia before exiting to Warner Music and suing Ticketmaster and getting them to settle with us for $130m, so I’ve been through the whole start-up journey. I’m currently a venture partner at LocalGlobe leading on climate investments while I figure out how I can best apply my experience to the climate fight, whether that’s by starting another company or being on the VC side of things. LocalGlobe is a seed-stage fund based in London. I’m also a newbie angel investor looking at climate-focused companies. You can imagine what a relief it was when I discovered @Jason’s podcast! Nice to see some familiar faces here. If anyone else is in London, I’m organizing a meet-up on Jan 16, please DM me for details!",
    "Category": [
      "Investor",
      "Entrepreneur"
    ],
    "Location": "London"
  },
  {
    "Name": "JR Bascom",
    "Intro": "Hi all, JR Bascom here! As many of you said, thank you many times over @Jason for the podcast and bringing this group together! It’s been fun to read the eclectic backgrounds of the fellow listeners.\nA little about myself: I recently graduated Wesleyan University with degrees in Economics, Psychology and a master’s thesis advised by Gary Yohe (guest number 8 on the podcast). Jason also went to Wesleyan, but unfortunately our time there did not line up!\nCurrently, I am based in NYC/Minnesota and work for a waste-to-value startup and a nonprofit coalition of sustainable investors but will finish up this work at the end of December. I am now at the fun time of exploring new opportunities! My  interests lean towards the investment space for renewable energy, water, agriculture and waste but open to any/and all things related to solutions to climate change-if you have any thoughts please reach out!\nFun fact about me: I gave a speech on global warming when I was in 8th grade (yes, I probably should have referred to it as climate change!)\nLooking forward to connecting and hearing what people are working on/interested in!",
    "Category": [
      "New Journey"
    ]
  },
  {
    "Name": "Gregg Dixon",
    "Intro": "Hi, I'm Gregg. I have the privilege of leading this crew . . . https://www.voltus.co/join-us/",
    "Category": [
      "Energy Systems"
    ]
  },
  {
    "Name": "Kiran Bhatraju",
    "Intro": " I met Jason early on his journey and while I shouldn't be surprised, I am blown away by how many brilliant, diverse experiences are reflected in the history here.\nMy background: grew up in coal country in Eastern KY (in case you couldn't tell from my scots-irish name), worked on climate policy on capitol hill, 2x Founder, first of AmericanEfficient.com (aggregated EE into capacity markets) and now scaling Arcadia.com (building a new digital, clean energy platform; not-so-shameless plug ---> sign up and get $50 off your next power bill: arcadia.com/kiran). I'm also a founder/board member of AppHarvest.com building the largest indoor greenhouse in America, 95% less water, no pesticides, and 1-days drive to 70% of US.\nIf anyone wants to chat about the future of utilities or home services, I'm game. I also believe deeply that sustainability is too damn complicated and in order to decarbonize we need company that will make decisions easy and automated on the customers' behalf. Happy to connect with anyone here online or in-person in DC",
    "Category": [
      "Policy",
      "Food & Ag",
      "Decarbonization",
      "Conscious Consumerism"
    ],
    "Location": "DC",
    "ImageUrl": "https://dl.airtable.com/.attachments/ec99079a9a9c0ba6f17015251b00f162/3ac63edb/Kiran_Bhatraju_-_Kiran_Bhatraju__1776"
  },
  {
    "Name": "Sanborn Hilland",
    "Intro": "I'll echo what a lot of others seem to be saying. I'm looking forward to being part of this community and directing my climate anxiety into something productive. I'm a software developer in Toronto, previously at QuickPlay/AT&T and then for the last 2.5 years at a startup called Stage Ten. I did my B.A. and M.A. in philosophy. For a while I've been wondering if I'd be most useful as a developer or if my time would be better spent doing other things (I'm not sure what) and I think this community might hold some answers for me. :beers:\n",
    "Category": [
      "Engineer",
      "New Journey"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/74d51ea3b87b61f2b22162d11696d381/8113b558/Sanborn_Hilland_Sanbornh__Twitter"
  },
  {
    "Name": "Julia Travaglini",
    "Intro": "Hi all! My name is Julia and I'm part of the team at Greentown Labs (https://www.greentownlabs.com/) in the Boston area—we're the largest cleantech startup incubator in the U.S. that's home to more than 100 cleantech and climate-action startups. Our mission is to support entrepreneurs with the community, labs, and resources they need to thrive and get their solutions to market. We also have a network of amazing strategic partners who support our community. I serve as Greentown's VP of Marketing and Communications and look forward to connecting with you! (Our CEO, Emily Reichert, was featured in episode 44 - thanks, @Jason! https://www.myclimatejourney.co/episodes/emily-reichert) (edited)",
    "Category": [
      "Accelerator / Incubator",
      "Investor",
      "Marketing"
    ],
    "Location": "Boston"
  },
  {
    "Name": "Sarah Kunst",
    "Intro": "Hi I\"m Sarah. Joining via Darren Hau and I'm a VC at Cleo Capital. I'm interested in large scale impact + near term timelines. I'm particularly interested in how to change policy in companies and governments vs individual action. I'm also very focused on birth control as a tool to help curb climate change, drawdown.org rates it as the 7th best way to combat this issue.",
    "Category": [
      "Investor"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/4fba3bee37891b3bc0ffc23af648bcff/2a875354/Sarah_Kunst_Just_4_of_Female-led_Startups_Are_Run_by_Black_Women_..."
  },
  {
    "Name": "Priscilla Tyler",
    "Intro": "Hi everyone! I’m based in San Francisco (and Tahoe quite a bit) where I’m an early stage investor at True Ventures (https://trueventures.com). Focus is anything that makes this world a better place with most of my time spent around climate tech and sustainability. Looking to push myself, my firm, and my investments to make the most meaningful impact given the urgency of our climate crisis. Looking forward to learning from you all and helping out however I can! :earth_africa: thanks @Jason for inspiring and building this community! ",
    "Category": [
      "Investor"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/8cd157e574da8a61cb29bd7c50a342e9/6148c544/True_Ventures_-_Priscilla_Tyler"
  },
  {
    "Name": "Brian Ellin",
    "Intro": "Like some of you, my background is in consumer tech and platforms - most recently leading product+design at Cozy, and prior to that working on product at Medium and Twitter.\nI’m early in the process of transitioning my career to focus 100% of my time and attention on positive climate outcomes. My goals in joining this community are to learn with all of you, plan what’s next, and research how I can have the most impact in the climate fight.",
    "Category": [
      "New Journey"
    ]
  },
  {
    "Name": "James McGinniss",
    "Intro": "Hey climate warriors! @Jason thank you so much for the invite, I'm psyched to get involved. My name is James McGinniss and I'm CEO and Co-founder of David Energy (davidenergy.com). We're based in brooklyn and building what I think is the first Retail Electricity Provider to focus exclusively on customers with Distributed Energy Resources--like solar, battery storage, smart thermostats, etc. We use software to connect these assets to energy markets, so are sort of like a software driven version of a traditional energy company. I'm super passionate about \"flexible demand\" and all things DERs, as I see them as essential parts of the efforts to decarbonize the electricity grid. If you ever want to wonk out on DERs or all things energy, ping me!\nWe also just raised our first fundraise from some great VCs and angels (announcing soon!), so happy to chat to any fellow founders out there or anyone looking to raise money as a climate tech company. A secondary passion of mine is to help funnel as much $$$ and as many talented, passionate people into this space as possible. Can't wait to get to know you all!!",
    "Category": [
      "Entrepreneur",
      "Energy Systems"
    ],
    "Location": "NYC"
  },
  {
    "Name": "April Underwood",
    "Intro": "I’m an angel investor via the group I co-founded with 5 other former colleagues from Twitter, #ANGELS, an advisor to growing software companies, and most recently was the Chief Product Officer of this here product (Slack).\nI’m looking for ways to use my experience in service of reversing climate change - for now as an investor or an advisor but perhaps at some point as an operator or founder.\n",
    "Category": [
      "Investor"
    ]
  },
  {
    "Name": "Eli Etzioni",
    "Intro": "Hi fellow climate enthusiasts! My name is Eli Etzioni, and I'm the partnerships associate at Fast Forward (https://www.ffwd.org/), the world's only nonprofit accelerator for tech-based nonprofits.\nSo far, Fast Forward has mostly funded nonprofits doing social services or edtech. I'm here to discuss and learn, with a main goal being to come up with ideas for how Fast Forward can find and fund more tech-savvy nonprofits working on climate solutions. I'm very excited to swap ideas and learn from you all :call_me_hand:",
    "Category": [
      "Accelerator / Incubator"
    ]
  },
  {
    "Name": "Axel Brachet",
    "Intro": "I'm Axel and I work at Google on the Cloud Finance team. I'm originally from France and currently live in the Bay Area.\nI have always been sustainability aware, but I realized only 3-4y ago how critical climate change is: since then, I've tried to understand and to act.\nI am involved in green initiatives at Google, including some contributions to the Social Development Goals startup Accelerator: https://www.blog.google/around-the-globe/google-europe/supporting-social-impact-startups/.\nI aspire to become a “carbon CFO”, accounting/planning for both carbon and dollars (arguably every CFO should think of both!).\nI am currently focused on understanding the numbers (I am not a climate scientist by training - still lots to learn)\n- How much GHG/CO2 do we emit? (I built the simple model below to educate myself: feedback welcome). Can we automate tracking, for individuals and businesses?\n- What are the optimal paths to removing the 1K+ Gigatons of CO2 in excess from the atmosphere?\n- How much investment is needed to make this decarbonization happen? Are there innovative ways to unlock funding faster?\n. What is the \"right\" price/cost for carbon emissions?",
    "Category": [
      "Decarbonization",
      "Sustainability"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Teddy Blank",
    "Intro": "Hey everyone, I’ll keep this brief. Love this community so far. I’m a Principal at First Star Ventures, a pre-seed/seed fund in Cambridge, MA - we’ve been actively engaging with “Planet+“/climate tech co’s because: A) there’s a ton of money to be made; and B) it’s too important not to spend energy on. We work with people as early as possible, even pre-company formation, and we love the crazy, messy early days of the startup journey. I’m spending a lot of my time on climate-related activities and would love to talk to anyone building something new or anyone who just wants to shoot the shit about the space. There’s a lot to do and a lot to learn, let’s go!",
    "Category": [
      "Investor"
    ],
    "Location": "Boston",
    "ImageUrl": "https://dl.airtable.com/.attachments/2155a99499e4e86effc01ca9aad45d85/3657ff6e/First_Star"
  },
  {
    "Name": "Fiona Spruill",
    "Intro": "Hi everyone. I left Meetup earlier this year where I was COO and, before that, VP Product. I started my career in journalism at The New York Times. I've become convinced that my next job has to involve working on our climate crisis, but I'm still figuring out the best way to have an impact. My main interests are in food waste and reinventing agriculture, but I'm still learning about lots of areas. Thanks @Jason for getting such a great group together. I'm based in New York.",
    "Category": [
      "Food & Ag",
      "New Journey"
    ],
    "Location": "NYC",
    "ImageUrl": "https://dl.airtable.com/.attachments/bc0aa90d1c243debe80467abd55f62ee/734f576a/Fiona_Spruill_fionaspruill__Twitter"
  },
  {
    "Name": "Shannon Bauman",
    "Intro": "Hi folks.  I'm Shannon, currently VP of Products at a SaaS analytics company called Pendo.  But I'm looking to jump into my next gig helping out with the Climate battle.  I started my career as a PM at Google, and then started a few of my own companies.  I'm currently located in Durham, NC, but may be moving to Atlanta, GA this summer. If anyone in any of those two places wants to connect, I'd love to.  I'm also starting to look at where to land next - so if folks working on climate change projects/companies are open to remote work (or happen to be located in Atlanta), I'd definitely be interested in chatting. Thanks for the slack group and the podcasts Jason! (edited)",
    "Category": [
      "Entrepreneur",
      "New Journey"
    ]
  },
  {
    "Name": "Marty ",
    "Intro": "Hello! My name is Marty Walsh, currently working at Boston Dynamics as Robotics Testing Manager on the Spot team.\n\nPreviously, I founded and ran a custom bicycle company called Geekhouse Bikes for over 12 years until 2017.\n\nAlso early in my own climate journey and currently in the research phase of what part I can play. Currently looking at what I can do personally at home, at work, and in my city. Looking forward to chatting. Thanks @Jason!",
    "Category": [
      "New Journey"
    ],
    "Location": "Boston"
  },
  {
    "Name": "Matt Klein",
    "Intro": "Hi everyone. My name is Matt Klein. I've worked in \"high tech\" for about 20 years, mostly on low level distributed systems for large internet properties. I've spent the last ~5 years working on https://www.envoyproxy.io/, an OSS \"cloud native\" load balancer. I'm starting to think about what I'm going to do with \"the rest of my life\" and I am interested in contributing my technical skills to furthering the use of clean energy. Right now I'm just exploring at a very high level the space as I don't know very much about it. Optimally, I would like to use my experience with OSS, open standards, low level systems, etc. in the clean energy domain. I'm also based in Seattle so I started a #seattle room in case anyone wants to meet up locally. Thank you and look forward to chatting with you.",
    "Category": [
      "Computer Science",
      "Open"
    ]
  },
  {
    "Name": "Leo Polovets",
    "Intro": " I'm a software engineer turned venture capitalist. I spent a decade after college as a software engineer (very early employee at LinkedIn and a location data startup; not-so-early employee at Google). About 7 years ago, I started a seed stage fund called Susa Ventures with a few partners. We're a $90m fund that makes $1m-1.5m investments into small startups that are raising $2m-$5m, and we're seed investors in companies like Robinhood and Flexport. We're a generalist fund, but improving sustainability and fighting climate change is an area we're excited about. 1/3 of the team actually majored in environmental science or sustainability in college :slightly_smiling_face:.",
    "Category": [
      "Investor"
    ],
    "Location": "Bay Area",
    "ImageUrl": "https://dl.airtable.com/.attachments/c09e7dc5e0235997fa251f3b71c1a477/b7c60bb7/Leo_Polovets_on_Twitter_1_I_see_lots_of_financial_projection_..."
  },
  {
    "Name": "Devin Gannon",
    "Intro": "Hi all!\nI'm Devin, I'm an Operations Lead at FYBR Solutions based in Vancouver B.C. At FYBR, we use drone technology to provide better, more accurate data to forestry stakeholders to help them manage their forest assets more efficiently and sustainably. I'm interested in the convergence of our environment and technology and how cleantech plays a part in our journey to decarbonization and negative emissions.\nJust looking through some of the conversations, this is a world class group of individuals! @Jason deserves massive props for his work and putting this together!\nIf anyone is in the Vancouver area or visiting, I'd love to connect over a coffee or beer! Feel free to reach out anytime",
    "Category": [
      "Remote Sensing",
      "Sustainability",
      "Decarbonization"
    ],
    "Location": "Vancouver"
  },
  {
    "Name": "David Peterson",
    "Intro": "hi all! i'm david. i live in SF but moving to london in january. i work at airtable, where i work on product, marketing and go-to-market strategy. while i've worked in tech/startups my whole career, i'm feeling the urgent pull of climate change more and more these days, so i'm very interested in learning how i can bring my skills/experience/network to bear on the problem. excited to meet everyone here and look forward to discussing potential solutions!",
    "Category": [
      "Technologist"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/a94346e0bf70541402e8993c8b289e1a/1262708b/Welcome_David_Peterson_-_For_the_Record"
  },
  {
    "Name": "Mike Dorsey",
    "Intro": "Hi from Mike. I’m an entrepreneur (founder of DataFox, acquired by Oracle), sometimes clean tech investor (eg CarbonLighthouse & Nori), and I studied cleantech at Stanford (IPER). My priority going forward is to support entrepreneurs in solving climate change. Huge fan of the pod. Happy to be here.  (edited)",
    "Category": [
      "Entrepreneur",
      "Investor",
      "Helper"
    ]
  },
  {
    "Name": "Diego Saez-Gil",
    "Intro": "Hello everyone! I'm the founder of Pachama (http://pachama.com), a climate startup working to unlock the full potential of forests and nature based solutions by increasing the integrity and efficiency of their carbon markets using machine learning and remote sensing. I was on the podcast (episode 24!) and @Jason is also a small investor and early supporter of our project. Really looking forward to exchanging knowledge and inspiration in this awesome space. We can do this! :muscle::deciduous_tree::earth_americas:",
    "Category": [
      "Decarbonization",
      "Remote Sensing",
      "AI"
    ]
  },
  {
    "Name": "Brentan Alexander",
    "Intro": "Hi all, I’m Chief Science Officer and Chief Commercial Officer at New Energy Risk (http://www.newenergyrisk.com/).  We’re an insurer that enables new tech to get to market faster by insuring technology performance…essentially swapping tech risk for AXA (our parent) credit risk for our client’s customers and/or lenders.  We’ve put just over $1b in insurance capital to work over the last few years supporting over $2b in deployed capital for new energy projects.  My background is in thermochemistry and electrochemistry and I’m looking to learn from others about their interests/struggles/new ideas/frustrations.  I’m based in Oakland, CA. (edited)",
    "Category": [
      "Finance"
    ],
    "Location": "Bay Area",
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/e17227958b686b1f4ace27897d04d676/b0201d02/Brentan_Alexander_-_New_Energy_Risk"
  },
  {
    "Name": "Emily Shorin",
    "Intro": "Hi all, I’m a Senior Research Analyst at The Brattle Group in DC and a volunteer Education Coordinator for the Clean Energy Leadership Institute as well as an alum of the program. At Brattle, I started a sustainability program called BGreen where I formed a grassroots team to teach employees about sustainable practices and convinced the company to purchase carbon offsets to cover the remainder of our footprint. My pet passion is electric garbage trucks and I’d love to connect with folks in DC, especially in entrepreneurship. Find me on Twitter @emilyshorin and linkedin https://www.linkedin.com/in/emily-shorin-64407969/ talking about clean energy, sustainability, and transportation electrification! (edited)",
    "Category": [
      "Sustainability",
      "Research",
      "Energy Systems"
    ],
    "Location": "DC"
  },
  {
    "Name": "Adam Flynn",
    "Intro": "Thanks for the invite, Jason - this looks like a great community! I was the first engineering hire at Wish, left a couple of years ago to sail across the Pacific. I just moved to New Zealand and I’m working on figuring out how I can help in the climate fight. My guess is the right fit is starting a company, but I’m also interested in growing my angel portfolio with more climate-focused companies.",
    "Category": [
      "New Journey"
    ],
    "Location": "NZ"
  },
  {
    "Name": "James Tamplin",
    "Intro": "I’m James Tamplin. In a previous life I was the co-founder/CEO of Firebase. We build tools & infrastructure to make creating mobile/web apps easy. We were acquired by Google where I stayed for a few years.\nAfter leaving, I helped @Peter Reinhardt start Charm Industrial (https://www.charmindustrial.com/about). Charm is creating carbon-negative hydrogen from biomass, and making exciting progress.\nI’m excited to be here, participate in the community, and see how I can be helpful! ",
    "Category": [
      "Decarbonization",
      "Helper",
      "Entrepreneur"
    ],
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/88af3a3b2e9432b8c7ca9f815c8289ea/2487000d/James_Tamplin_JamesTamplin__Twitter"
  },
  {
    "Name": "Phuc Truong",
    "Intro": "Hi Everyone! Kudos again to Jason for getting folks together here. My background is in value creation and business acceleration: 20+ yrs in creating digital products and services across mobile media and mobile commerce & payments (with some exits along the way). My latest initiatives include angel investing (and as an LP); and currently working on a material science project advancing non-wetting fibers for outdoor gear and apparel industries.\nI’m eager to see how I can help, apply my skills and resources to the climate fight whether it be coaching start ups in story-telling and commercialization efforts or possibly investing in promising clean tech solutions as an angel or within a PRI. (edited)",
    "Category": [
      "Business",
      "Helper"
    ]
  },
  {
    "Name": "Graham Garner",
    "Intro": "Hi @channel, i’m Graham, the founder & CEO of Sphere (sphereinsight.com), a startup building automated data analysis systems which produce easy to understand insights around meaningful discoveries. Our goal is to help knowledge workers and their respective organizations increase the accuracy and rate of data-informed decisions. I’m eager to learn from you all about climate needs, required solutions and where we may be able to help.\nI’m based in Southern California :sunny: with my wife and three young children. I find myself in SF a lot. I occasionally get to spearfish and go on hikes. Run a lot. Always love meeting in-person and having a conversation. Thanks @Jason for being a such a catalyst.",
    "Category": [
      "Entrepreneur",
      "Data (Science)"
    ]
  },
  {
    "Name": "Laura Fitton",
    "Intro": "Laura Fitton - UPDATE: i've launched enough.co to promote and evangelize great work being done in the climate economy. see https://my-climate-journey.slack.com/archives/CSRJUGFB3/p1580135808027500 for more.\n@Pistachio on the twitters. Boston based and currently full time researching my next career move, which i'd like to be in climate finance of some sort.\nas a single mom I founded and sold @oneforty to @HubSpot and then spent the next 8 years there so i could focus on my daughter-startups (now 13 & 14). though i've been in marketing, tech & social most of my career i have a degree in environmental science & public policy and i studied science writing with Carl Sagan for whom i wrote a paper on climate in 1990. i was part of the SEAC (Student Environmental Action Coalition) in both high school and college, and studied a lot on rural sociology (sustainable development) and soil erosion.\nso, my career shift into some sector of climate finance is both completely brand new and a return to my roots.\ni also lead-wrote a @Dummies book (Twitter) and have been a professional speaker for 20 years. in my job hunt i am targeting something where i can both invest and evangelize work at the intersection of climate repair and market forces. there's a huge % of the economy and capital markets that are going to need to shift.\nbinge listened the entire podcast in about 3 weeks - favorite episodes included @Alicia, @SaulGriffith, all the ones on investing, and @GaryYeoh.",
    "Category": [
      "Marketing",
      "Community Organizing",
      "Entrepreneur",
      "Veteran"
    ],
    "Location": "Boston",
    "Link": "enough.co",
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/926212904df83b1c99f0ef8bcc8c151f/316ae115/HubSpot_Blogs__Marketing__Laura_Fitton"
  },
  {
    "Name": "James Richards",
    "Intro": "Hi all! James Richards here. I’m a part-time investor (garudaventures.com) and exploring ideas related to climate change. I’ve invested in 2 energy companies so far (Leap and Amperon), would love to find more! I previously started and sold an HR startup. Other areas of interest include natural carbon sequestration (e.g., forestry) and climate impact mitigation. Excited to be here! My linkedin profile is: http://linkedin.com/in/jpr2120",
    "Category": [
      "Investor"
    ]
  },
  {
    "Name": "Breanna Duffy",
    "Intro": "Hello everyone, I'm Bre! I'm currently a PhD student in Biomedical Engineering in the Boston area. I've always been passionate about the environment, but originally thought it would be a side project for me (maybe making science more sustainable from within). However, about halfway into my PhD degree, I realized that with the climate crisis we're currently facing I couldn't keep the environment as a side project. So, after a lot of thought, I've decided to finish my PhD in BME (graduating this May!) and then transition into something in climate change mitigation. I'm currently deep into the process of figuring out what I'd like to do next and how to use my current skill set in this field. I really like research and analysis, and I'd love to be doing it to help guide the world towards the best decarbonization strategies. I'm especially interested in how agriculture is key to reaching our climate goals (a perfect combination for me, with climate change, biology, and public health!). It has been a challenging personal journey so far, and I am excited to have this community of like-minded people to help with the process!!\n\n\nRyan (Impossible Diamond):speech_balloon:  12:03 PM\nThis Slack is attracting some really awesome people.",
    "Category": [
      "Research",
      "New Journey"
    ]
  },
  {
    "Name": "Khanh Nguyen",
    "Intro": "I have been in the Bay Area for my entire career, with the last 14 years at Google where I am a VP in Engineering. I have engaged more seriously in sustainability efforts within the company in the past year as I learnt more about the impact of climate change. Look forward to joining the conversations and learning even more from discussions in this group.",
    "Category": [
      "Sustainability"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Joseph Majkut",
    "Intro": "Hello all--My name is Joseph. I was Jason's guest on episode 39 of the pod. We discussed my work as climate director at the Niskanen Center, a DC-based think tank (moderate, center-right) that works with public policy makers (mostly on the right) to raise awareness of the nature of climate risks and build support for carbon pricing at the federal level. I spend my days trying to understand the latest science on climate change, the engineering and economics behind reducing greenhouse gas emissions, and developing public policy options that will scale climate solutions rapidly. I look forward to getting to know you all here. https://www.niskanencenter.org/policy/climate/\nNiskanen CenterNiskanen Center\nClimate Archives - Niskanen Center\nWe educate policy actors about climate science and directly confront climate skeptics; encourage Republicans to use regulatory authority to address greenhouse gas emissions efficiently (at least, until better policy responses are adopted); initiate legal action to compel responses to climate risks; defend property rights from fossil-fuel infrastructure and eminent-domain claims; and, above all, promote carbon taxation as the best federal response to climate risk, in that it maximizes individuals’ and companies’ ability to use trial and error to efficiently reduce carbon emissions. Our team of energy and environmental policy experts includes academics, thought leaders, lawyers, and seasoned p… Show more(138 kB)\nhttps://www.niskanencenter.org/wp-content/uploads/2020/01/photo-of-a-kangaroo-on-road-2615031-1200x630.jpg",
    "Category": [
      "Policy"
    ],
    "Location": "DC"
  },
  {
    "Name": "Bill Weil",
    "Intro": "Hello everyone, glad to join such an impressive group of folks working on climate from so many different angles.\nI work for the Simons family office here in San Francisco, funders of our friends @Abe Yokell and @Joshua Posamentier and Prelude Ventures (www.preludeventures.com), principals to the largest climate-focused foundation (www.seachange.org) - backing initiatives like Climate Action 100+ (http://www.climateaction100.org/) and actively developing innovative finance strategies to address market gaps to fix the climate, including our most recent effort - to create a fund to invest in low carbon project development in Southeast Asia: www.seacef.org. Previously, I was CIO and partner of two climate and clean energy focused VC/PE funds in London, and prior to that led the strategy team for Shell Renewables from the headquarters office in Den Haag, Netherlands.\nLooking forward to exploring ways to work together and thanks @Jason for pulling this together!\nBill",
    "Category": [
      "Investor"
    ],
    "Location": "Bay Area",
    "Link": "https://www.linkedin.com/in/williambweil/",
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/850319fb230f0e0a04c3745f0adb189d/33f1bebb/Bill_Weil_williambweil__Twitter"
  },
  {
    "Name": "Vik Tantry",
    "Intro": "I'm Sathvik Tantry, CEO of FormSwift, a SaaS that helps SMBs go paperless with their document workflows. I've been spending a portion of my time investing and advising companies and funds that tackle the climate crisis and am interested in doing more over the next few years. Looking forward to connecting with smart folks and learning about potential solutions!",
    "Category": [
      "Entrepreneur",
      "Investor"
    ]
  },
  {
    "Name": "Sam Zimmerman",
    "Intro": "Hi, my name is Sam Zimmerman. In my full time job, I’m the CTO of Freebird (https://www.getfreebird.com/) and Insurtech company for air travel. I also advise a few Climate based Fintech companies in the Boston area. I’m still getting up the speed in the climate change space, but am interested in financial products that can help address climate change and always love a good cup of coffee, :slightly_smiling_face:. (edited)",
    "Category": [
      "Entrepreneur",
      "Finance"
    ],
    "Location": "Boston",
    "Link": "https://www.getfreebird.com/",
    "ImageUrl": "https://dl.airtable.com/.attachments/3528bc06fa288cf2033123f84d673821/5c16ade0/Sam_Zimmerman_-_CTO__Cofounder__Freebird__Crunchbase"
  },
  {
    "Name": "Minji Kim",
    "Intro": "Ex-SoftBank Ventures and 2x Entrepreneur (E-scooter sharing & healthy meal delivery) looking for a full-time position at climate-related VC fund in Europe or in the USA.\nThree words that describe me are entrepreneur, impact, and the environment.\nI was at SoftBank Ventures, I wanted to make several Biology and AgTech related investments, such as Apeel sciences and Indigo Ag. As much as I loved talking to entrepreneurs and studying new technologies, I decided to start a new business and founded an e-scooter startup to provide a sustainable mobility solution in Korea. Between Wharton/MIT/Berkeley MBA and SoftBank Ventures, I chose the latter to learn more from entrepreneurs about their goals and missions.",
    "Category": [
      "Entrepreneur"
    ]
  },
  {
    "Name": "Andrew Colella",
    "Intro": "Hi Everyone! Great to join in the energy behind this group. So glad you created it, @Jason, and thanks for the invite @Hampus Jakobsson! I've just begun a project to help build a climate conscious workforce, called the Climate List (https://climatelist.io).\nStarted my career in music (playing strings with Janelle Monae!), worked my way into software engineering and venture capital, and a bit like @Jason, began questioning my impact on the world. Figured it would be easy to find the perfect climate + software job.\nAfter months of searching, I found a few great opportunities but more importantly discovered a network of really talented people looking to change their careers for the climate. With the help of some friends, the Climate List was created!\nAt the moment, it's a simple job board for people + companies looking for climate engaged talent but looking to grow into corporate sustainability as we scale. Would love to connect with anyone hiring or in the midst of a search!",
    "Category": [
      "Entrepreneur",
      "Careers"
    ],
    "Link": "climatelist.io",
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/9f42ff43a954849562051fff34f10715/2e6e1d0a/Andrew_Colella__Georgia_Institute_of_Technology_Georgia__GT_..."
  },
  {
    "Name": "Anshuman Bapna",
    "Intro": "Hi everyone! This looks like an amazing group of people - thanks @Jason! I've been a serial entrepreneur in both the technology and social sector, worked at Google, graduated from Stanford and just quit as Chief Product Officer at Makemytrip, a NASDAQ-listed online travel company.\nI'm on a similar journey as @Jason - speaking to tons of people, especially in the developing world to understand climate change solutions that are working, and the woeful lack of investment in sustainability & resilience. My own interest is to figure out how a new kind of internet platform (online university? kickstarter? kaggle? something else?) can help massively scale up solutions that are already known to work.\nI live in India but moving back to Stanford campus in a few months to join my wife who's completing her PhD there. Hoping to get to know a lot more of you over the next few months.",
    "Category": [
      "Entrepreneur",
      "Sustainability",
      "Resilience",
      "Community Organizing"
    ]
  },
  {
    "Name": "Ryan Dings",
    "Intro": "Hey folks - I'm Ryan Dings, EVP & General Counsel at Greentown Labs and previously COO at Sunwealth (now just a proud investor and advisory board member). Based in the Boston area.  Excited to be working with the great team at Greentown Labs and looking forward to connecting with folks about how we can drive more investment into the technologies and people focused on addressing climate change.  You'll see Greentown really focus its efforts in 2020 and beyond on climate action.",
    "Category": [
      "Investor",
      "Accelerator / Incubator"
    ],
    "Location": "Boston",
    "Link": "https://www.greentownlabs.com/"
  },
  {
    "Name": "xdamman ",
    "Intro": "Hi there! I’m an engineer in computer science and an entrepreneur. I created Storify in 2010 in San Francisco where I lived for 7 years. Then created Open Collective and moved to NYC in 2015. I’m now based in Brussels. I’m very active with Extinction Rebellion since the beginning and more recently with #FridaysForFuture. I’m helping them with their finance since Open Collective has been built to help (open source) communities collect and disburse money transparently (e.g. https://opencollective.com/xr-belgium https://opencollective.com/fridaysforfuture). My goal is to turn Open Collective into the Wordpress of local communities, i.e. an open source platform to accelerate the explosion not of blogs but of local groups of XR, FFF or Transition Network. I believe that this can greatly contribute to rebuilding our communities bottom up and make our society more resilient. If you are part of a local group of one of those movements and/or if you are interested to contribute to this project, ping me! :slightly_smiling_face:\nopencollective.comopencollective.com\nXR Belgium - Open Collective\nExtinction Rebellion Belgium (unincorporated collective)(71 kB)\nhttps://opencollective-production.s3.us-west-1.amazonaws.com/fa952f50-a73f-11e9-b826-03810f67511b.png\nopencollective.comopencollective.com\nFridays for Future - Open Collective\nInternational #FridaysForFuture account. Grassroots movement :earth_africa:(85 kB)\nhttps://opencollective-production.s3.us-west-1.amazonaws.com/768d2ff0-fa9b-11e9-af46-85cdc89f2934.png",
    "Category": [
      "Computer Science",
      "Entrepreneur",
      "Finance",
      "Open",
      "Community Organizing",
      "Helper"
    ]
  },
  {
    "Name": "Shanna McEachern",
    "Intro": "Hi crew! My name is Shanna. I grew up between the suburbs of Toronto and a remote island in the Muskoka region of Canada, the lasting impression of which has nurtured a love of the environment. I now live in NYC running operations for Social Impact Capital, a young VC focused on early stage impact-focused companies across any category. I'm always looking to connect with other VC's or founders making moves in this space. Prior to this, I co-founded a supply chain tech company (www.lvrg.ai) and am thus pretty in-the-know in the D2C/product startup scene. I host monthly startup focused events at Soho House New York, so if you want to learn more (or recommend a guest speaker, focused on any topic relevant to early-stage startups) feel free to ping me! All the best!",
    "Category": [
      "Investor",
      "Entrepreneur",
      "Community Organizing"
    ],
    "Location": "NYC"
  },
  {
    "Name": "I-Kang Ding",
    "Intro": "Hi! I am a long-time listener, first time caller (poster), so to speak. I am a data scientist / machine learning engineer who recently started at a climate tech startup, KoBold Metals, where we are working on mineral exploration of battery materials (such as Cobalt) using big data and superior science of ore deposits.\nI was most recently a lead data scientist at Capital One (where I worked for close to 5 years). My team’s work focused on developing machine learning models to detect and prevent various types of credit card fraud for the company’s entire credit card portfolio, and deploying models to customer-facing production systems on AWS.\nClimate change is a problem domain that I have cared deeply about since college, and worked on for close to a decade (Stanford ’06-’11, solar cell startup ’11-’12, and LED manufacturer ’12-’15) and is now rejoining after a 5-year detour at financial services. I am excited to join the MCJ community and connect with like-minded people!\nP.S. Here are two articles that I wrote in recent weeks that might be of interest to some:\nWhy I left my job at Capital One after 5 years, and joined a climate tech startup working on mineral exploration: https://ikding.github.io/data-mining-mining-data.html\nReminiscing about first decade of my career in materials science and deep-tech energy companies, and what I learned about the sector. (Also: what software companies and fruit flies have in common, and why working on deep tech energy technologies can feel like opening cans of worms all day.) https://ikding.github.io/deep-tech-in-energy.html",
    "Category": [
      "Data (Science)",
      "Technologist",
      "Materials",
      "Research"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/51ea071e96550ad2e9df5eb74834c4db/97d144d0/ikding_I-Kang_Ding__GitHub"
  },
  {
    "Name": "Louis Potok",
    "Intro": "I've spent my career trying to use my skills for positive social impact - over the years that's led me to work with nonprofits and startups on all kinds of topics from human services program design, microfinance, financial rehabilitation, and medical decision making. Mostly my job titles have been related to behavioral econ, data science, software engineering, or product management, but at heart I'm a generalist who cares more about problems than about specific techniques for solving them. For a few years I co-led the SF chapter of Datakind, which is a global community of volunteers working with non-profits to apply data/ML to their work. I also was/am a member of The Data Guild with @Beau Cronin.\nAbout a year ago I came to the conclusion that climate change was the biggest and most important problem I could work on, and started out by reading Drawdown to get a sense of the landscape. (I see there are some Drawdown people here, what an amazing resource!) I got to page 1, refrigerant management, and said \"huh, I don't know anything about this. I wonder what I can do to help.\" As I kept learning about it, I started to realize just how important and neglected it is. I spent about 8 months learning about it and talking to knowledgeable people, confirming that there was a major  gap, and that it wasn't a completely impossible problem.\nIn November I quit my job, packed up my San Francisco apartment and moved to Cambodia, where I'm trying to get something off the ground. Ultimately I think that the solution to refrigerant management (especially end-of-life recovery, but also leakage) will involve positive financial incentives relying on digital technology to verify additionality. I don't think anyone knows what that verification will entail, but my hypothesis is that\na) it's possible\nb) the best way to figure it out is to build it as an internal system for a company that's actually operating on the ground.\nSo that's the plan! This is my first time starting something completely from scratch, though I've been an early employee a few times. So I could definitely use advice from people who have done this before, especially when it comes to developing and communicating a vision, and thinking about fundraising,\nI'm still reading through the intros to see who's working on something related, but I'd love to chat with any of you. This is such an inspiring community and I'm glad to be a part of it.",
    "Category": [
      "Entrepreneur",
      "Data (Science)"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/eb06ca52a82d8275a876b96f586094bf/7c03767f/Louis-Potok_-_ideas42"
  },
  {
    "Name": "Dennis Crowley",
    "Intro": "Hey all --- my first day on MCJ!   My name is Dennis Crowley.  I work at a tech company called Foursquare + have a bunch of projects on the side.  I split my time between NYC + the Hudson Valley with my wife + 2 kids.  I joined this group because I’d like to learn more about what I can do to help… help fix climate problems, help the people who are building solutions, help the non-believers to get on board.  Nice to meet y’all!",
    "Category": [
      "Entrepreneur"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/71af08abe3ab7d83125d6c5fe59e3569/8588490c/Dennis_Crowley"
  },
  {
    "Name": "Eric Chaves",
    "Intro": " I’m the founder of a startup called Terrament focused on grid-scale energy storage. We’re building underground pumped hydro storage (UPHS). I’m working with two civil engineers, but I’m still working to build my team. We’re pre-funding and I’m currently applying for grant funding and incubator programs. \n\nI’m also generally interested in supporting the climate effort, and I really appreciate communities like these. For any #nyc locals, I organize a climate meetup in New York City. ",
    "Category": [
      "Entrepreneur",
      "Community Organizing"
    ],
    "Location": "NYC",
    "Link": "https://www.terramenthq.com/",
    "ImageUrl": "https://dl.airtable.com/.attachments/e67208d8f96d7d1de6fb3eeb234848bc/5b5b8ae5/erchaves_Eric_Chaves__GitHub"
  },
  {
    "Name": "Dave Klinges",
    "Intro": "Hi all,  Dave Klinges here. I’m a PhD student in Interdisciplinary Ecology (whatever that means) at the University of Florida, and I study how climate change will disrupt how species are distributed. As in, what new and potentially invasive insects will be found in soy fields of the American midwest 20-50 years from now, or how will an endangered a mountaintop bird survive if the cold environment it needs disappears? A lot of simulation and agent-based modeling, as well as some fun times romping around tropical rainforests (including flying drones to monitor forest cover, @Devin Gannon). I also build web data access interfaces for environmental research products (e.g. https://ccrcn.shinyapps.io/CoastalCarbonAtlas/) and develop sensors that can track how temperate and humidity changes at high resolution. Also have dabbled in some environmental journalism (https://news.mongabay.com/by/david-klinges/) and filmmaking (https://natureinparadise.github.io/multimedia/intern_video/).\nGlad to be on board and join the conversation! (edited)",
    "Category": [
      "Research",
      "Simulation"
    ]
  },
  {
    "Name": "Joshua Kagan",
    "Intro": " I'm Joshua Kagan, I live in Oakland and have a 17 month old daughter.  I have worked in renewable energy finance for 12 years, first with Atlas Capital, then at the Carbon War Room where I ran the energy efficiency buildings division, and then was employee #6 at CleanFund, the largest commercial PACE financier. I am currently focused on doing my own sustainable real estate projects and figuring out innovative technologies and financing to transform the buildings sector. I look forward to connecting with the great group of folks assembled here!",
    "Category": [
      "Finance",
      "Energy Systems",
      "Buildings"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Jeffrey Schub",
    "Intro": "Hi All! Thrilled to join this wonderful group. My name is Jeff Schub, and I'm the Executive Director of the Coalition for Green Capital, an organization that works to accelerate investment into clean energy deployment by creating and supporting Green Banks. Globally we are more than 10 trillion dollars of investment behind target to meet Paris climate goals. Creative and purpose-built finance entities are necessary to drive abundant private capital into attractive emissions reduction projects. Green Banks are mission-driven finance entities that blend public, private and philanthropic capital to fill financing gaps and enable multiples of private investment into underserved clean energy markets. We help create state entities in the US (like the New York and Connecticut Green Banks), work in developing countries like South Africa and Rwanda, and also work on federal legislation. These days we're heavily focused on the National Climate Bank proposal in Congress, and positioning the bill for passage in 2021. (https://greenbankus.com/) Support for the legislation is growing quickly (https://thehill.com/policy/energy-environment/477435-dems-outline-sweeping-legislation-to-make-us-carbon-neutral-by-2050). Reach out to learn more! And excited to be here.\nCoalition for Green CapitalCoalition for Green Capital\nCoalition for Green Capital - U.S. National Green Bank\nOur goal is ensure all American households and businesses, no matter their income or geography, can access clean energy at an affordable rate.\nTheHillTheHill\nDemocrats outline sweeping legislation to make U.S. carbon neutral by 2050\nHouse Democrats outlined their vision for sweeping climate legislation Wednesday, offering a first look at a bill that would push the U.S. to reach net-zero carbon emissions by 2050.\nJan 8th\n(38 kB)\nhttps://thehill.com/sites/default/files/pallonefrank_072017gn_lead_0.jpg",
    "Category": [
      "Investor",
      "Finance",
      "Energy Systems"
    ]
  },
  {
    "Name": "Tony Bova",
    "Intro": "Hi Everyone! I'm the Co-founder and CEO of mobius pbc. We're a b corp startup that's developing technologies to convert industrial organic waste to valuable specialty chemicals and materials (think waste cooking oil from restaurants or lignin from paper mills into bioplastics or hand soaps and such). I'm also finishing my PhD in Energy Science and Engineering at The University of Tennessee and Oak Ridge National Lab.\nHere's a short pitch to talk about our mission to create a world where There's Wonder in Waste! https://youtu.be/wVMIrNMQzhI\nI'm looking to meet other startups and also people looking to get into this space. We've got a lot of growing to do and there's such an exceptional network that @Jason has brought together from this podcast.",
    "Category": [
      "Circular Economy",
      "Entrepreneur",
      "Research"
    ]
  },
  {
    "Name": "Omid Ashtari",
    "Intro": "Looking to learn more, see what others are doing, help where ever possible, and hopefully aid in curbing this continuously worsening trend of climate change. I currently work in Operations at a software company in Portland, was previously at Twitter, and before that at CAA (an entertainment agency). I spent most of my life in CA, but have been in OR for nearly 5 years now. Not yet directly involved in any particular organizations working on these problems, but taking a lot of personal action, and hoping to be engaging and learning from this community, thanks for having me.",
    "Category": [
      "New Journey"
    ],
    "Location": "Portland",
    "ImageUrl": "https://dl.airtable.com/.attachments/20907aada32066b381f425c6966c9cde/03078267/The_Newest_Member_of_Team_Cozy_Omid_Ashtari_-_Cozy_Blog"
  },
  {
    "Name": "Tim Trefren",
    "Intro": "Hi, I'm Tim Trefren, based in Oakland CA. I founded an analytics company called Mixpanel in 2009 and left just a couple months ago. After spending 10 years building enterprise software I want to spend the next decade focused on something I care about that has a greater social impact, and climate is top of my list.\nI read the Drawdown book earlier this year and found it really inspiring and then somehow found this podcast and I'm hooked - it's so fascinating to learn directly from the people in the field, and a lot of the interviewees are people I can understand and identify with since they come from startup land.\nI'm excited to be part of this community and join the learning journey! (edited)",
    "Category": [
      "Entrepreneur",
      "New Journey"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Matt Candler",
    "Intro": "Matt Candler here.\nSo far: mostly education\nEarly-stage trials of new learning spaces & tools - 4pt0.org\nSide hustle: electric bikes/motos\nCramming used EV batteries into old motorcycles - nightshiftbikes.com\nLatest: 2nd-life EV storage\nCramming used EV batteries into buildings & containers plugged into grid - b2uco.com\n\nCurious: kids having this conversation in schools, electrification - bit.ly/mcandler"
  },
  {
    "Name": "Beau Cronin",
    "Intro": "My name is Beau Cronin, and I live in Berkeley, CA with my wife and two daughters.\nMy academic training is in computer science, neuroscience, and applied statistics, although much of that is quite foggy at this point. I co-founded a couple startups out of grad school; we sold the second one, which did machine learning as a service before the big cloud platforms came in and dominated that space, to Salesforce in 2012. I was at Salesforce for three years, which was...interesting.\nIn early 2017, I became a partner at The Data Guild, a mission-driven product studio that works in domains around human and environmental health. My climate journey really began with my first Guild project: a partnership with a large Australian power company where we designed and built a pilot peer-to-peer energy trading platform that empowered residential customers with solar and/or storage to trade excess production.\nMy sense from the past few years of thinking and prototyping is that - notwithstanding the huge amount of data we currently collect about the natural and built worlds - one of the key obstacles to broader, deeper, faster collective action is our lack of direct perception of the threats. I’ve been hacking on data services that provide multivariate, granular information about the world - including economic activities, natural resources, the built environment, and so on. My goal for 2020 is to take these efforts pro, and I’d be interested in conversations with folks here on that front.\nThese days, my technical skills are sharpest in data engineering, cloud architecture (#aws4lyfe), and general backend hacking. I am a systems thinker, and I have the sometimes-annoying habit of expanding problems to include dimensions that are supposed to be out of scope. But once I have an approach sorted, I love to put my head down and build.\nWhat I can offer:\nconversation and advice\ncontracting if there’s a good fit\nconnections to the larger Guild network of mission-driven data and design folks\nWhat I’m looking for:\nhelp in matching up the data / knowledge services I’m developing with specific and impactful uses\nadvice on how to fund this work, which is intended to be self-sustaining (for-profit) but not necessarily venture shape (I want to maximize horizontal usage, rather than value capture in one or more verticals)\nI’ve already spoken to some of you in channels and DMs, and I’m looking forward to getting to know more of you.",
    "Category": [
      "Entrepreneur",
      "Data (Science)",
      "Technologist"
    ],
    "Location": "Bay Area",
    "ImageUrl": "https://dl.airtable.com/.attachments/a16aaeaa3fb398b1f5c333aa72871e37/fabf94b5/Beau_ITMFA_Cronin_beaucronin__Twitter"
  },
  {
    "Name": "Hannah Totte",
    "Intro": "Hi all, happy to be here! :wave: I met a few of you last Thursday at the Bay Area MCJ Meetup and am excited to keep the conversation going. Currently working at Activate as a Fellowship Manager for Cyclotron Road. Jason interviewed our CEO Ilan Gur for MCJ episode 60. Can't overemphasize the critical need for communities like this around climate change resilience and decarbonization strategies – can't wait to learn from everyone in this group. I live in Berkeley, graduated from Cal's Environmental Sciences program, researched the impacts of shared transportation systems, and am deciding on Environmental Health graduate school programs. Love doing pretty much anything outdoors, especially running and surfing. Feel free to reach out!",
    "Category": [
      "Research",
      "Transportation"
    ],
    "Location": "Bay Area",
    "ImageUrl": "https://dl.airtable.com/.attachments/71c962d4a46c052afdc1d8e707a59767/8c434467/Berkeley_Team_--_Activate"
  },
  {
    "Name": "Evan Hynes",
    "Intro": "Hello! My name is Evan and I'm building https://climate.careers\nWe help mission-driven job seekers find high-impact opportunities at organizations working to address climate change — and, we help those organizations attract top talent. Our mission:  Mobilize the world's talent to solve the climate crisis.\nOur impact framework is inspired by Project Drawdown's climate solutions framework. We're thrilled to have @Chad Frischmann on board as an advisor — and I'm honored to have him as a friend :relaxed:\nBackground — and what's next:\nSince quietly launching ClimateCareers in June, tens of thousands of people have organically found their way to Climate.Careers to find their next climate-impactful opportunity.\nSoon, we'll be expanding beyond just climate \"jobs\" and launching new aspects of our website that further our goal to help people answer the question: \"What can I do about climate change?\"\nWe are now preparing to launch ClimateBase, an open-source database of all climate-impactful organizations. We currently have over 1000 orgs identified in our internal airable database, but we know that's just the tip of the iceberg. We're partnering with a handful of key players in the climate space to rapidly grow the database, and empower any person or organization to contribute and access the data freely.",
    "Category": [
      "Careers",
      "Helper"
    ],
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/ed3b2ed4438266a4fe2686249a903286/33fa35c1/Evan_Hynes__AngelList"
  },
  {
    "Name": "Darren Hau",
    "Intro": "Hi @channel, this is Darren from Schmidt Futures, a philanthropy started by former Google CEO Eric Schmidt, where I focus on our climate-related investments.  Previously worked at Tesla and SunPower, and started a (very) small solar power electronics company, so my prior expertise revolves around solar and EV charging.  Currently focused on the food/ag ecosystem, particularly around increasing efficiency/reducing waste, building demand for regenerative products, and quantifying the benefits of regenerative practices for insurance products.  @Sarah Kearney I listened to your podcast episode!  We may have some reasons to chat.",
    "Category": [
      "Investor",
      "Energy Systems",
      "Food & Ag"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/00db51b83270dae98a11978206c9994d/81dd381e/Darren_Hau_-_Schmidt_Futures"
  },
  {
    "Name": "Koen van Seijens",
    "Intro": "Since 2014 I work as a senior manager at www.toniic.com (which was mentioned in the episode with Timothy Fruendlich, CEO of ImpactAssets), Toniic is a global non profit community of active impact investors. Toniic isn’t a fund or an advisor but we work with our members to help them to do more impact investments, in some cases they end up moving their full portfolio to 100% impact investing across asset classes. I’m responsible for some of our European memberships and help organise (with colleagues) our European events. \nNext to Toniic, I’m a partner at a family office and advisor in Milan focussed on investing in regenerative food and agriculture companies in Italy, together with Slow Food (https://www.slowfood.com/)\nI have been fascinated by regenerative agriculture since 2011 when I read a chapter of a book called The Optimist Tour (A little bit of a\nbloody big amount), which followed Tony Lovell and the late Bruce Ward around in Australia doing consultancy for farmers on holistically management in grazing. The numbers they shared on the potential of #soilcarbon (which was the first time I hear about it) shocked me and I started to dive deeper! I followed Allan Savory and many others for years. In 2016 started recording podcasts on the subject, how to put money to work to regenerate soils, people and ecosystems while growing food and storing carbon, which has been quite a ride!!",
    "Category": [
      "Investor",
      "Food & Ag"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/98506d3791728d420fcdedcdca93e065/aa36e22f/Regen_Ag_Renegades_Koen_Van_Seijens_podcast_is_whos_who_of_..."
  },
  {
    "Name": "Eliot Horowitz",
    "Intro": "Hi. I’m Eliot Horowitz, CTO and co-founder of MongoDB. While I’m interested in climate change as a whole, I’m particularly interested in looking into how software can be used to help. Either augmenting other projects or on its own. Great to be here. Please reach out if you have ideas",
    "Category": [
      "Entrepreneur",
      "Computer Science"
    ],
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/f349b30012839f82f446f9adb754a77f/9d120693/Eliot_Horowitz_-_Faces_of_Open_Source"
  },
  {
    "Name": "Dave Coen",
    "Intro": "Hi folks, I’m an ex-management consultant and investor and more recently ex-startup employee. I moved to SF ~a decade ago intending to invest in, and then work, in cleantech, but wound up in software (Stripe 2012-2017, Snapdocs 2017-2019). I left Snapdocs in October to explore startup ideas, and have been spending the bulk of my time examining what’s changed in climate and sustainability since 2010. I’d love to meet other folks starting startups here",
    "Category": [
      "Investor",
      "Entrepreneur"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Todd Allen",
    "Intro": "Good morning.  I’m Todd.  I am the Department Chair of the Department of Nuclear Engineering & Radiological Sciences at the University of Michigan and Director of our Fastest Path to Zero Initiative.  Jason was nice enough to interview me on MCJ.",
    "Category": [
      "Research"
    ],
    "Location": "Ann Arbor"
  },
  {
    "Name": "Jason Bylsma",
    "Intro": "Hi all! I am co-founder & Chief Engineer at a company in Cambridge, MA (www.multisensorscientific.com) building the next generation of gas leak imaging systems. You may have caught this week's NYT story on methane emissions in West Texas, but what wasn't mentioned was they were using >$130k worth of equipment, not including the airplane overflights. We're working on much more cost-effective systems installed on site for continuous emissions monitoring.\nI'm excited to get involved in the conversation with this diverse group of policy, finance, SW & HW developers to tackle the biggest challenge of our time. Shout out to @Matt Gordon also in the methane emissions space! (edited)",
    "Category": [
      "Remote Sensing",
      "Entrepreneur"
    ],
    "Location": "Boston"
  },
  {
    "Name": "Evan Arnold",
    "Intro": "Hi All. I’m super excited to be in this slack group.  My name is Evan, and I’m coming off a five-year-long stint as the CTO of a startup in the mortgage space. I was the first employee there, and when I left we’d grown to nearly 100 people. Right now, I’m looking to apply lessons learned in founding, building, recruiting, iterating to something climate-y. My key skills are mostly clustered around B2B SaaS. I also recently moved from SF to Chicago, so I’m very interested in anything happening in the midwest.",
    "Category": [
      "New Journey"
    ],
    "Location": "Chicago"
  },
  {
    "Name": "Tim De Chant",
    "Intro": "Hi all! I'm Tim De Chant. I've been on the climate/evironment thing for a while, but my sense of urgency has grown in the last few years. I'm based in the Boston area, and I recently launched Future Proof (https://www.futureproofreviews.com), a review site to help people find the best low-footprint stuff. It grew out of work I did as a Knight Science Journalism Fellow at MIT last year. I also teach science writing at MIT. Previously, I was senior digital editor at NOVA, where I covered lots of climate and energy stories, and I have my PhD in environmental science from UC Berkeley. Working on environmental stories/research can be overwhelming at times, so it's great to have this community. ",
    "Category": [
      "Journalist",
      "Conscious Consumerism"
    ],
    "Location": "Boston",
    "ImageUrl": "https://dl.airtable.com/.attachments/44307e3ce54bd7f5f370c0703382849a/b2d7ce80/Meet_This_Years_Knight_Science_Journalism_Fellows_Tim_De_Chant"
  },
  {
    "Name": "Joshua Posamentier",
    "Intro": "Hi Everybody!  You may know me from such venture funds as Congruent Ventures.  I invest in early stage companies across the sustainability universe.   Saving the planet and generating alpha.  :facepunch:",
    "Category": [
      "Investor"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/7399afbcab3e19c166472219f0fcf26c/560b9e51/Joshua_Posamentier_posamentier__Twitter"
  },
  {
    "Name": "Jesse Walden",
    "Intro": "Hi Everyone— My name is Jesse, I work in VC, currently at a16z, focused on cryptocurrency. Previously I was a founder of a project in the space -> led blockchain R&D at Spotify. Before all of that, I worked in music as an artist manger to some people I consider generational talents. More on me here: jessewalden.com/about\nI've just started scratching the surface on solutions to the climate fight via the Podcast, Drawdown, etc.\nI joined the Slack to see if anyone might be able to point me to resources with things to do, personally or businesses to start.  Many of the pod guests share these insights, and I thought there might be an opportunity to distill and aggregate these into an evergreen (non-audio) format. Maybe something like this already exists, but YC's Request for Startups is the most fleshed out resource I'm aware of. Any pointers?",
    "Category": [
      "Investor",
      "Crypto"
    ]
  },
  {
    "Name": "Yair Reem",
    "Intro": "Hi everyone! @Jason thanks a lot for the invite. I’m Yair, I have a tech background and been investing in startups in the past decade (mainly software but with growing focus on energy since 2015). I am based in Berlin and focus on companies in Europe that develop tech to reduce GHG emissions. Would be happy to get in touch with all of you and especially those nearby in Europe.\nHappy New Year to all.",
    "Category": [
      "Investor"
    ],
    "Location": "Berlin"
  },
  {
    "Name": "Andy Moon",
    "Intro": "Hi everybody! My name is Andy Moon, and I’ve been working in climate + renewable energy 2006. I met @Jason on Twitter, and glad to see this community come together.\nI am currently a Venture Partner at Vas Ventures and an EIR at Carbon180. I’m spending 95% of my time thinking about what climate-focused company I can launch in 2020, and looking for collaborators with backgrounds in software and data science. I’m purposefully being a little vague here, as I’m still in research mode :slightly_smiling_face: I’m also happy to answer any questions about solar, project finance, energy efficiency, and forestry / ag.\nPreviously I was Co-founder / CEO of SunFarmer, a YC-backed social enterprise that runs a profitable solar business in Kathmandu, Nepal. FYI we are looking for new board members (ideally based in South Asia, or with experience there!)\nI started my solar journey at SunEdison, where I helped raise >$1B to build solar projects in the US and Europe (back when it was hard to find $ for solar!). I also spent time at McKinsey, focused on climate and energy efficiency. I think political advocacy is enormously important in the climate conversation, and always up for collaborating on advocacy projects - I started two (failed) political apps, and learned a ton in the process.\nI’ll be sharing some of my climate research on LinkedIn / Twitter (@andymoonsun) and here! Looking forward to meeting some of you in NYC.",
    "Category": [
      "Entrepreneur",
      "Veteran",
      "Investor"
    ],
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/6158810852c1d59a473a1396917fcadd/3cd863ac/Andy_Moon__SunFarmer"
  },
  {
    "Name": "Jessica Eastling",
    "Intro": "Hi everyone, I'm Jessica Eastling, currently working at Better Ventures (better.vc), an early-stage venture firm backing mission-driven entrepreneurs. I spend most of my time searching for great companies for us to invest in, particularly in the sustainability realm. Previously I worked at Zola Electric, a startup bringing solar home systems to rural Sub-Saharan Africa. I love talking about everything sustainability-related and have recently been interested in solutions to our ever-growing waste problem. Looking forward to being a part of this community!",
    "Category": [
      "Investor",
      "Sustainability"
    ]
  },
  {
    "Name": "Ross:evergreen_tree: ",
    "Intro": "Hi Team! I’m originally from Kalamazoo, Michigan, started my career as a fifth-grade teacher in Newark, New Jersey, worked in education, ed tech, and investing for a dozen years, and am now helping develop and launch a new climate-related philanthropic initiative within the Emerson Collective family (https://www.emersoncollective.com/). The podcast has been immensely helpful with my own climate journey over the past year. Outside of work – but very related to climate – I’m an amateur tree grower and enthusiast, with a special soft spot for coast redwoods :evergreen_tree: (edited)",
    "Category": [
      "Education",
      "Investor"
    ]
  },
  {
    "Name": "Antonio Piccolboni",
    "Intro": "Hi everyone! I am a data scientist/engineer based in Oakland, near SF. I've done research in bioinformatics, wrote a big data library for R downloaded more than 1M times and worked on electric load prediction for an energy storage company, now looking for the next energy related gig. On the side I run a couple of microblogs on the crisis in the sciences (https://scienceincrisis.info) and conciseness in software (https://asceticprogrammer.info). Looking forward to the discussions on this slack.\nscienceincrisis.infoscienceincrisis.info\nScience in Crisis\nI am not talking about global warming deniers or creationists. This is a critique from the inside....\nasceticprogrammer.infoasceticprogrammer.info",
    "Category": [
      "Data (Science)",
      "Energy Systems"
    ]
  },
  {
    "Name": "Dave Zahrobsky",
    "Intro": "I'm Dave Zahrobsky, a former IT consultant turned professional photographer (IG @davezphotography). I’m based in San Francisco but my work has taken me across 7 continents where I’ve seen and documented humanity’s impact on the environment. I’m currently seeking new ways to use my talents and energies to work on solutions to the climate crisis. Thanks @Jason for welcoming me to this community - I’m excited to find many insights, inspirations, and opportunities here.",
    "Location": "Bay Area"
  },
  {
    "Name": "Gaël Gobaille-Shaw",
    "Intro": "My background is in the chemistry of carbon dioxide, specifically exploring the ways in which we can use it to produce valuable chemicals. I'm currently working on two projects at Deep Science Ventures that will be of interest to people here. The first is developing technology to convert CO2 from the flue gasses of major CO2 emitters such as power plants to produce chemicals such as methane and methanol. The other is to design ultra low energy CO2 capture, amenable to atmospheric CO2 capture or from industrial processes. I am on the look out for passionate and talented people to help me build these projects into globally impactful companies! I'm always up for a chat about anything climate or CO2 related, so feel free to reach out!",
    "Category": [
      "Research",
      "Decarbonization",
      "Carbon Removal"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/231643f78a86abfaf45768c453353e10/8ca1fb24/Gael_Gobaille-Shaw__Masters_of_Chemistry_Masters_of_Research"
  },
  {
    "Name": "Ryan Orbuch",
    "Intro": "Hi everyone! Great seeing so many interesting people here.\nI’m based in SF and work at Stripe. I help lead our negative emissions funding (https://stripe.com/blog/negative-emissions-commitment).\nFor those learning about negative emissions, I put together a quick reading list: https://docs.google.com/document/d/1DfZrTdy4cKb-VN7e_-E4oNe6WZpqVnvVGkzf8jMYTjs/edit\nOtherwise, I’m thinking a bunch about how we can inspire optimism around the grand project of negative emissions (twitter.com/orbuch)\nExcited to meet you all! Thanks @Jason for pulling this together (edited)",
    "Category": [
      "Decarbonization"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Eliza Nemser",
    "Intro": "Hello! I’m Eliza Nemser (on Twitter I’m @HealthImpacted). I’m a Geoscience PhD who shifted gears ~2 yrs ago from earthquake science to climate action: strategy/advocacy/organizing. (Climate change is much scarier than earthquakes.) Now I’m with NRDC Action Fund acting as connective tissue between science/scientists <> policy/policy folks <> electeds & federal candidates. I work to cultivate, elevate, and elect climate champions in federal government, and I talk a lot about climate prioritization and messaging strategies w/ candidates.  I’m based in SF and organize many climate-focused events, often using the GiveGreen platform, usually featuring pro-environment House and Senate candidates.\nI’m also deeply interested in air pollution and the human health impacts framing of the climate crisis...and in all efforts to liberate the issue from the fangs of partisanship. Related, I’m a passionate environmental health advocate and on the board of the Center for Environmental Health.\nExcited to be part of this community and enthusiastic about all forms of productive collaboration to kick the ball forward on climate progress as fast, creatively, and strategically as possible. Thanks @Jason!\n\n\n21 days agoView thread",
    "Category": [
      "Research",
      "Community Organizing"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Mike Champion",
    "Intro": ":wave: Hey all, I’m Mike - a software developer in Boston. I’ve been at HubSpot for a while and a couple early stage startups before that. Over the last year have been learning more about sustainability and especially curious about the intersection of software on bottom up change. I’ve known @Jason for a while and appreciate the MCJ podcast. Looking forward to learning from everyone!",
    "Category": [
      "New Journey"
    ],
    "Location": "Boston",
    "ImageUrl": "https://dl.airtable.com/.attachments/4aca79367d80b92e8d51e377c2bfbe68/eab9bd91/Mike_Champion_graysky__Twitter"
  },
  {
    "Name": "Christoph Stoll",
    "Intro": "Hey everyone, I'm Chris. It's great to be part of this community :slightly_smiling_face:. As for my background, I've studied business and computer science and have co-founded 2 tech-startups.  Right now I'm part of an international team of volunteers working on Climate Connect, a global climate action platform (http://climateconnect.earth). I hope, that we'll be able to accelerate climate action globally with Climate Connect.\n\nWe want to allow climate protectors to list their climate action projects on Climate Connect. When listing their project on the platform, the creators will be asked for a few numbers on their project, depending on the project category. From this input, an algorithm will automatically estimate the climate impact of the project.\nThis way, we want to provide an overview of everything, that is done against climate change worldwide and estimate which projects/actions are most effective. This way we want to enable people to find out what is the most impactful thing they can work on and which high impact projects from other locations they could replicate at their location.\nHere is an interactive prototype: https://xd.adobe.com/view/395518bf-7e51-4eb2-6ff2-3f1b57fdaa17-4f64/ (edited)",
    "Category": [
      "Computer Science",
      "Entrepreneur"
    ],
    "Link": "http://climateconnect.earth",
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/d2590c27fb15407d169ae1ba06ec3937/80dba973/Christoph_Stoll_stoll_christoph__Twitter"
  },
  {
    "Name": "Aaron Bird",
    "Intro": "Hello world!  I'm excited to join the community.  I'm currently on sabbatical traveling the world with my family after selling 2 companies back to back in 2018 (Bizible->Marketo, then Marketo->Adobe). I'll come back from sabbatical this year and will likely start a company or a fund relating to climate.  Looking forward to learning and contributing to the group.",
    "Category": [
      "Investor",
      "Entrepreneur"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/abfdc2f8d2be07796b606bb7ea126ba2/bca826ff/Aaron_Bird_aaronbird__Twitter"
  },
  {
    "Name": "Yoav Lurie",
    "Intro": "Hi there! :wave: -- I'm Yoav Lurie of Boulder, CO. I was the Founder and CEO of Simple Energy, the leading provider of utility marketplaces and residential customer engagement, and I led the merger that created Uplight (in which we brought in Tendril, EnergySavvy, FirstFuel, and Ecotagious). Uplight is the leading customer engagement SaaS company for utilities with nearly 100 utilities, covering over 100 million households. I was President of Uplight from when we launched it in mid-2019 through the end of that year. Now -- nine years after starting Simple Energy -- I'm taking most of this year off to travel the world with my family (my wife and I have a 5-year-old daughter and a 3-year-old son) and to reflect, recharge, and reconnect. Here's the slightly longer story from my LinkedIn post announcing the move: https://www.linkedin.com/feed/update/urn:li:activity:6612467638616543232/\nI got introduced to @Jason mid last year when I was in the throws of putting together the merger; so, have just resurfacing to join his journey and this awesome community -- psyched to be here.",
    "Category": [
      "Entrepreneur",
      "Energy Systems"
    ],
    "Location": "Boulder",
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/96071b0bbe221806283bd70841e1574e/6da47161/Yoav_Lurie_yoavlurie__Twitter"
  },
  {
    "Name": "Remi Bouteille",
    "Intro": "After a week down the MCJ rabbit hole...I feel I found my community's campfire! \nRemi here - 20 years at JPMorgan co leading a thriving $13 BN Hedge Fund business...and helping with CC from the sidelines [Climate Solution angel investing/mentorship and NGO support, corralling funding for the Macron campaign...]. Cognitive dissonance ended 2 years ago...I switched to climate full time...\nI speed CS adoption by helping investors find enterprises that fit their focus and lens, and help entrepreneurs find the right kind of capital for their growth path. \nI split my time between US Coasts and Europe. \nWhatever your challenge is, I want to see how to help!\n\nSome current favorites :\n-Carbon removal\n-Episodes #33 Jim Mc Dermott and #5/9 Sarah/Matt from Prime\n-Enhanced Weathering / Mineralisation\n-Marine Permaculture\n-Project Drawdown / Drawdown Europe.\n-EU/UK climate policy for solution funding.",
    "Category": [
      "Investor",
      "Helper"
    ]
  },
  {
    "Name": "Maria Saltz",
    "Intro": "Hi all!  My name is Maria Saltz. I am currently at Adobe, working on business and marketing strategy analytics and also co-leading sustainability action team at our San Jose campus.  Previously I worked at Sun Micro (now Oracle), Yahoo!, and Seagate, so a bit of a journey through Silicon Valley high tech world.  Been on my own climate journey for about 5 years now, but really diving in in the last couple of years, now actively looking to further align my career with my passion for climate solutions.\nOn the side, I am currently a pro-bono Metro Director and Marketing Chair for CleanTech Open - the largest non-profit cleantech startup accelerator focusing on very early stage startups and helping them bring their tech to market.  My mission there is to foster cleantech and sustainability ecosystem in SF Bay Area and support our entrepreneurs going through the accelerator. I am one of the organizers of the monthly meetup group for people working or interested in Cleantech and Sustainability: https://www.meetup.com/Cleantech-Open-Meetup/\nIn addition to the CTO work, my climate journey includes:\nAl Gore's Climate Reality Leadership Corps training in 2018 in LA, currently involved with the CPR Bay Area Chapter: https://www.climaterealityproject.org/our-mission\nVarious online classes, including Michael Mann's excellent EdX class\nStanford's Strategies for Sustainability Program\nCurrently persuing Stanford's \"Energy Innovation and Emerging Technologies\" certification\nLooking forward to learning from all of you! (edited)",
    "Category": [
      "Marketing",
      "Analytics",
      "Sustainability"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "David Kjelkerud",
    "Intro": "Hello everyone! Glad to be invited to this community, thanks @Jason!:v: I'm a software designer/engineer in San Francisco. Most recently I was the head of design at labelbox.com, a startup in the machine learning space. Almost started a heatpump company a couple of years back and most recently been looking into sustainability accounting and earth systems monitoring. Currently researching my next move with the goal of starting something in the environmental space. Right now consulting on software design/product, so if you are doing something in the space and need design/product help, ping me!",
    "Category": [
      "Designer",
      "Entrepreneur"
    ],
    "Location": "Bay Area",
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/8bbb738aad5e378c9812303a68eff033/eeb8bac6/David_Kjelkerud_davidkjelkerud__Twitter"
  },
  {
    "Name": "Noah Deich",
    "Intro": "Hi all, Noah Deich here, co-founder Carbon180 (www.carbon180.org) and Episode 23 guest https://www.myclimatejourney.co/episodes/noah-deich. Carbon180 is a non-profit with offices in Oakland and DC on a mission to build an economy that removes more carbon from the air than it emits. We work to advance smart policy and breakthrough innovations across a range of carbon removal strategies: from planting trees and farming in ways that return carbon to soils, to innovative technologies for capturing CO2 directly from the atmosphere. Excited to get engaged with this great group -- let me know if I can help on anything carbon removal related!",
    "Category": [
      "Entrepreneur",
      "Decarbonization"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/fd6a7de336bda5d1dd69d4abca69ac34/6d08a867/Noah_Deich__The_Breakthrough_Institute"
  },
  {
    "Name": "Ricky Ashenfelter",
    "Intro": "Hi everyone - Happy (belated) New Year! I'm Ricky - co-founder and CEO of Spoiler Alert (www.spoileralert.com). We're a Boston-based software startup (and Techstars alum, where I met @Jason), helping large food brands minimize food waste in their supply chains. I started my personal climate journey 10-12 years ago - as an early employee of ClearCarbon (acquired by Deloitte in 2010) and with stints at EPA (in their climate division) and NextEra (in energy storage and as part of @Andrew Beebe's team). While at MIT, I was MD of the MIT Clean Energy Prize and TA for Energy Ventures (both under the leadership of @Tod Hynes). Super excited to be a part of this community and expand my climate exposure beyond my current bubble (which is mostly food and ag).",
    "Category": [
      "Entrepreneur",
      "Food & Ag",
      "Veteran"
    ],
    "Location": "Boston"
  },
  {
    "Name": "Shayle Kann",
    "Intro": "What a crowd! Kudos, @Jason. Hi all, I'm Shayle - Managing Director at Energy Impact Partners (EIP), a ~$1bn venture capital and growth equity fund backed by a coalition of 20 global utilities. I've been on my own climate journey my whole career, including working on wind project finance in Australia, REC/offset trading in Boston, and at the California Public Utilities Commission. But the bulk of my career prior to EIP was spent running GTM Research, the market intelligence arm of Greentech Media, up until (and shortly after) our acquisition by Wood Mackenzie. I'm a proud, deep energy wonk and excited to see so many friends already in this community (oh hey @Joel @Yoav Lurie @Jeff McAUlay etc.). I'm based in SF now and always happy to talk about energy tech/markets, startups, venture, or hot sauce. Hit me up: kann@energyimpactpartners.com",
    "Category": [
      "Investor",
      "Veteran"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Eleanor Sharpe",
    "Intro": "Hi there! I’m Eleanor :wave: I spent last year transitioning out of health tech (formerly a Product Manager at Wellframe in Boston) and into sustainability / climate. I’ve been working at a company called Joro with @sanchali - featured on one of the early pod episodes! We’re building an app to help people track and reduce their carbon footprint through community & collective action. I’m also about to start the Dual Degree MBA/MPA in Sustainable Solutions at the Presidio Graduate School in SF. Excited to be here! :earth_americas:",
    "Category": [
      "Decarbonization"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Chandrika Srivastava",
    "Intro": "I was most recently at Tesla where I led the digital products team for solar panels, Powerwall, and Solarglass roof. I took a break in the fall to travel and everywhere I went, I saw communities struggling with the impacts of climate change. I'm now excited to find/create my next role at a great company doing bold work in the energy/climate world. I'd love your help - let me know who I absolutely must chat with!"
  },
  {
    "Name": "Andrew Salzberg",
    "Intro": " I used to be Director of Transportation Policy at Uber, where I helped start teams focused on transit, sustainability & data sharing. Before that, I worked at the World Bank financing transport infrastructure projects in China, Vietnam, and the Philippines. I was trained as an urban planner focused on public transportation, and worked at Transport for London as a grad student. In all those roles, it was clear we weren't moving nearly fast enough to decarbonize transportation - so in July I left my job at Uber to take up a one year fellowship at Harvard to figure out how we move the needle way more rapidly on that problem. Would love to hear from anyone else interested in the overlap of mobility / urban development and decarbonization. I taught a little class on that topic at MIT in January.",
    "Category": [
      "Transportation",
      "Sustainability",
      "Decarbonization"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/8f0c32699017aad81a64456b35c73457/9e78be54/The_LOEB_Fellowship__Andrew_Salzberg"
  },
  {
    "Name": "Nicolo Giorgi",
    "Intro": "Hi all! I'm a founder & CTO in the fantasy sports space. I'm looking to change industries, and I'm very intrigued by the problem we are all facing with climate change. I'm trying to learn more about how to apply my software experience to these challenges. I'm currently NYC based.",
    "Category": [
      "Entrepreneur",
      "New Journey"
    ],
    "Location": "NYC"
  },
  {
    "Name": "Carol Liao",
    "Intro": "Hello! Excited to join a group with such inspiring passion for the environment. I’m Carol Liao — a designer currently at Method, a product strategy consultancy in Nyc. I’ve always been passionate about sustainability, but as of late have been itching to do and learn more. While my knowledge on climate change is still growing, I’m hoping to learn more and find ways to contribute my expertise in human-centered research and design to help further the cause. Looking forward to learning from you all ",
    "Category": [
      "Designer",
      "Sustainability"
    ],
    "Location": "NYC"
  },
  {
    "Name": "David Bennett",
    "Intro": "Hello All. My name is David. I'm excited to be joining the conversation - I'm here to learn and to contribute thoughts/ideas where it might be helpful. I've worked on climate issues with Google, EDF, Aspen Institute and more. Currently, I'm a contractor at Adobe Inc. where I'm responsible for managing a global sustainability program for the company's real estate portfolio. (edited)",
    "Category": [
      "Helper",
      "Sustainability"
    ]
  },
  {
    "Name": "Tod Hynes",
    "Intro": "Hey everyone. I’m Tod. I started my first clean energy company in 2002 and founded XL Fleet www.xlfleet.com in 2009 to focus on cost-effective and scalable fleet vehicle electrification. I’ve taught MIT Energy Ventures since 2008 and Co-founded the MIT Clean Energy Prize. Concern about climate change is what drove me into clean energy, and while we’ve made a lot of progress, global emissions are still going up, and we have to do a lot more. I’m fortunate to be on the board of the Woods Hole Research Center https://whrc.org (ranked as the #1 climate science think tank), and while it’s daunting to see the positive feedback loops discussed years ago come into existence, it’s exhilarating to see masses of people marching to bring attention to the climate crisis and demand change. The MCJ pod is a great resource for anyone to learn more about climate change and various solutions and efforts. I joined this Slack room to try and help others in this community make a bigger impact in this daunting problem and connect and learn from others in the process.",
    "Category": [
      "Entrepreneur",
      "Decarbonization",
      "Veteran"
    ],
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/d3f9c101d98764694b3d5898b473f2ef/52daaed2/Tod_Hynes_02_-_MIT_Technology_Review"
  },
  {
    "Name": "Scott Knowles",
    "Intro": "What an incredible group. Thanks @Jason for pulling this together and what you're doing with the Pod.  I've been building/growing digital marketplaces of various stages for most of my career in various ops, strategy and marketing roles. We've been taking steps as a family to go more green (electric car, composting, etc) over the last couple years, but last year I really took a step back and realized I can do more to make a bigger impact at scale given my background, and this should be priority #1. I don't know what that looks like quite yet, so have been trying to educate myself on all the various levers we have as a society, to see where that marries with my background.  Looking forward to learning a ton from this community.",
    "Category": [
      "New Journey"
    ]
  },
  {
    "Name": "Tyler Simmons",
    "Intro": "I am absolutely thrilled be added to a community of people who are currently involved or are looking to get involved in the climate space. I have been working for over 10 years in the advertising, marketing, and data space and started listening to MCJ because I want to shift my efforts to a company in the climate/sustainability area. Hoping to learn, make connections, and identify opportunities to put my efforts towards something more grounded in the future of our planet. I'm hoping to bring my experience in business strategy and sales to help companies in the climate space bring their products to broader audiences.",
    "Category": [
      "Marketing",
      "New Journey"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/f7647a1da88c0a9e5cf72385a18820c7/e9517dda/Foursquare_Customer_Story_Tyler_Simmons_Senior_Director_Sales_..."
  },
  {
    "Name": "Tom Price",
    "Intro": "Hey everyone, wow what a group! I’m Tom, and my climate journey has been winding along for 20+ years. Environmental activist/lobbyist in Washington DC in the 90's. Then freelance journalist-1st to report from Tuvalu on their loosing fight with climate change. Detour to start disaster relief NGO after Hurricane Katrina, then Environmental Manager for Burning Man of all things, then founded another NGO to build/give away solar projects ( 124 built, 6MW). Former utility solar developer, ran the team that wrote/passed California’s Community Solar law. Then biomass gasification with All Power Labs https://www.huffpost.com/entry/trash-powered-power-electricity_b_8813142, and most recently trying to stop the 2.5GW of emissions annually from cooking fires in the developing world with Inyenyeri. https://www.nytimes.com/2018/12/06/business/rwanda-charcoal-pellet-stoves-.html.  We had the highest adoption/retention rates of any energy access project, but couldn’t raise enough to scale and is now it workout, so looking for next opportunity to make a big impact on climate. Right now exploring/mapping the investor and startup space, seeing if there’s inefficiencies to be solved to speed deployment, adoption, and growth. My expertise is communications, policy, market development. Let me know how I can help what you’re up to!\n",
    "Category": [
      "Energy Systems",
      "Community Organizing",
      "Entrepreneur",
      "Helper",
      "Journalist"
    ],
    "Location": "Bay Area",
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/33024f0da05928d283be9fa75163ffae/f206a1b1/Tom_Price__Burning_Man_Journal"
  },
  {
    "Name": "Jake Kheel",
    "Intro": "I am VP of Sustainability for Grupo Puntacana, a tourism company in Punta Cana, Dominican Republic. I work on all types of sustainability issues (conservation of endangered species, coral reef conservation/restoration, solid waste management, to name a few). Our company is part of tourism resort complex that owns and operates an international airport, residential communities, electric company, water distribution company in the context of a developing island. The DR is a relatively small contributor to climate change, our challenge is to confront and adapt to the changes caused by climate change in real time. In the fifteen years I have been in the Caribbean, we have seen increased frequency and severity of storms, notable changes in sea temperature and related impacts on local coral reefs, and even the invasion of massive quantities of sargassum seaweed, all directly or indirectly related to climate change. Good to connect with other problem-solvers!",
    "Category": [
      "Tourism"
    ]
  },
  {
    "Name": "Gonzague Henri",
    "Intro": "Hello everybody! I am a research scientist at Total and a visiting scholar at Stanford. I work at the intersection of data and power systems (especially distributed resources such as storage, EVs etc..). I have worked a lot on building models but also technico economic models to assess grid parity of PV and storage and on building control algorithm for distributed ressources (especially storage). Today working a lot on data mining for energy data. My background is in power systems (EE) and computer science. I am based in the Bay Area  (been there a couple years after spending some time in North Carolina).\nI am curious about any solution to decarbonize and looking forward to learn more about policy.\nThanks to #EnergyTwitter for the intro to the podcast and the community (edited)",
    "Category": [
      "Research",
      "Energy Systems",
      "Buildings",
      "Data (Science)"
    ]
  },
  {
    "Name": "Jeanine Longley",
    "Intro": "Hello! My name is Jeanine. Really grateful to @Devin Gannon for introducing me to the podcast, and to this amazing community!\nI work with a company called OPEN Tech who focuses on making tech solutions for city shapers who want to make more pro-climate choices with confidence. What are city shapers you ask? (everyone does) - great question! The folks who shape our cities include local government representatives, architects, construction workers, etc. We focus on the folks who literally change the landscape of our city. https://opentech.eco/\nThe project I’m working on right now is called Building Benchmark BC. We’re working with some local governments and other interested organizations to create a regional energy benchmarking program for large buildings. We want large building operators to be able to understand their energy consumption, and we want them to know how they perform compared against their peers. It’s really hard to manage what you don’t measure - so let’s measure, and give you a “scorecard” that details how you’re doing! https://buildingbenchmarkbc.ca/\nBenchmarking can (but doesn’t always) lead to public disclosure. We are also the technology partner for the Disclosure Challenge here in Canada which is a great way to understand how technology can help tell a story. https://disclosurechallenge.cagbc.org/\nLAST! but not least. :slightly_smiling_face: I’m part of a community trying to build an ecovillage on one of the islands in the pacific north west here. We’ve been learning a lot over the last decade while trying to build and garden in sustainable ways. We’ve transitioned much of our land towards a permaculture model, so if anyone is geeky in that particular way, let me know!",
    "Category": [
      "Civic Tech",
      "Buildings"
    ]
  },
  {
    "Name": "David Lang",
    "Intro": "Hey all!\nMy name is David Lang. I'm a co-founder of Sofar Ocean. We're building tools to better understand and monitor the marine environment. I'm also tangentially involved in a number of conservation technology projects and initiatives. I'm here to learn from this group as well as to see how to build bridges to the burgeoning conservation tech scene.\nhttps://www.sofarocean.com/\nsofarocean.com\nOcean Sensors & Underwater Drones — Sofar\nSofar builds accessible ocean sensing and exploration tools for ocean enthusiasts, industry, and conservation. Spotter weather buoy & Trident underwater drone.",
    "Category": [
      "Oceans",
      "Entrepreneur"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Ross Kenyon",
    "Intro": "Hey everyone. I'm a cofounder of the Nori carbon removal marketplace (https://nori.com), and one of the hosts of the Reversing Climate Change and Carbon Removal Newsroom podcasts. I dig MCJ so thought I'd join and hang with y'all.\n",
    "Category": [
      "Entrepreneur",
      "Decarbonization"
    ]
  },
  {
    "Name": "Cyrus Wadia",
    "Intro": "Cyrus jumping in here. Super excited to join and engage with you all. I am former Nike and White House and presently lead sustainable product at Amazon.",
    "Category": [
      "Sustainability"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/89d157c36629d4e1198b1d891ede80e3/b9ae98aa/Cyrus_Wadia_cnwadia__Twitter"
  },
  {
    "Name": "Jeff McAUlay",
    "Intro": "Hello Journeyers - I’m writing from (the trailhead?) a few feet away from @Jason in GSV labs- privileged to be included here. Upfront - I’m an energy nerd to the core. Currently I help run https://www.energeticinsurance.com/ building new insurance products to accelerate the deployment of renewable energy (backed by @Joshua Posamentier). I also helped start https://adlventures.com/, working with large energy/water/materials companies to adopt new technologies. Before that at EnerNOC (Now Enel-X) I worked on early deployments of on-site solar, storage and software solutions for commercial customers & grid services. I’m an engineer by training with applied R&D experience across multiple sectors, starting with fuel cells. My New Year’s resolution is to be more active on Slack, so DM me for more. Happy to chat anytime!\nEnergetic InsuranceEnergetic Insurance\nSolar Financing | Credit Enhancement | Insurance | United States\nLet us cover the payment default risk on your next Solar Project. Energetic Insurance makes efficient financing possible for financiers, investors and energy service providers with the EneRate Credit Cover solar insurance policy.\nADL Ventures\nHome - ADL Ventures\nTurning legacy companies into growth companies.",
    "Category": [
      "Finance",
      "Energy Systems",
      "Research",
      "Veteran"
    ],
    "Location": "Boston"
  },
  {
    "Name": "Ada Yeo",
    "Intro": "Hey everybody, Ada here. Based in SF, ex-Coinbase PM and now starting a startup of my own. Ashamed to say I’m a total climate change n00b but I’ve just started dipping my toe into the waters via Jason’s podcast. Seems like a great community here. Looking forward to learning from you all!",
    "Category": [
      "Entrepreneur",
      "New Journey"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Shreya Dave",
    "Intro": "Wow, what a group of rockstars! I'm Shreya, a recycling enthusiast, a true Boston Masshole, a wannabe runner, and perhaps the reason to be included here, a founder of Via Separations, a materials startup focusing on improving the energy efficiency of industrial separation processes.  Separations are sexy - and account for 12% of all US energy consumption because we do it so inefficiently.  Driving change in large companies has become my life goal, and I love talking about the manufacturing process of just about anything.  Right now, my focus is on the pulp & paper industry, and I know a lot more about cheesemaking than I thought my mechanical engineering degree would ever get me.  Pleased to be here and excited to see how each of you is changing the world!",
    "Category": [
      "Circular Economy",
      "Entrepreneur"
    ],
    "Location": "Boston"
  },
  {
    "Name": "Katia Paramonova",
    "Intro": "Hi folks! Great to join the community. My name is Katia (https://www.linkedin.com/in/eparamonova). I’m a US-Russian 3rd generation nuclear engineer turned to broader energy systems solutions and community formation. I’m based out of San Diego, moved here 6 months ago from Boston (and miss the seasons haha). Founder and CEO of an early stage startup, Centrly (www.centrly.com) aimed at accelerating the rate of tech development by more efficiently matching stakeholders across industries, countries, and groups (a different take on climate change). Background in nuclear eng (BS from MIT ’13) and energy management (MS from EPFL (Switzerland) ’17), as well as work in higher education management (Skoltech (Moscow)), autonomous warehouse robotics (Vecna Robotics), and community formation (founded YES-Europe - a European community connecting young professionals in energy https://www.yes-energy-europe.com/). Excited to connect with folks who are interested in seeing the bigger picture and learn from different perspectives, not remaining siloed in their viewpoints, which @Jason does awesomely in his podcasts. I’m also biased towards action, so excited to catalyze some projects / progress with other enthusiastic people here :slightly_smiling_face: (edited)",
    "Category": [
      "Energy Systems",
      "Community Organizing",
      "Entrepreneur"
    ],
    "Location": "San Diego"
  },
  {
    "Name": "Alexis Normand",
    "Intro": "Hi everyone, glad to join this slack. I have just launched Greenly in France, an app that tracks the footprint of your every expense",
    "Category": [
      "Entrepreneur"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/a1d3f1735d5d19719edeb53fc5c61395/faaf5f9d/Alexis_Normand_slarxe__Twitter"
  },
  {
    "Name": "Eric J. Smith",
    "Intro": "Hello All - Incredibly excited to be apart of this community. Thank you @Jason. I’m an investment officer for the Grantham Foundation for the Protection of the Environment. I manage our internal investment vehicle, Neglected Climate Opportunities, which seeks to expand and mature the global climate solution toolkit. We specifically focus on early stage grant and investment capital into opportunities that are key pieces of unlocking gigaton strategies. The four sectors in which we invest are soil carbon and land use, oceans and seaweed, reducing GHG from O&G production, and carbon removal/storage/utilization. We have 20 companies in the portfolio and another 6 using grant capital to heads towards commercialization.\nWould love to connect with other folks working on applying capital across the spectrum, those working in the themes above, or with other investors looking for partners to syndicate early-stage deals with (Pre-seed to Series B). We'll participate in later stage deals when we can find ways to bring additionality.",
    "Category": [
      "Investor"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/6aec1600d70df7ac948399b1cdf0e7ea/ca136a82/Eric_J._Smith_BSc_MFRM_MBA__National_Carbon_Farming_Conference_..."
  },
  {
    "Name": "Josh Browne",
    "Intro": "Hi all, I'm Josh Browne, a founder at Rho AI.  In my former life, I was a NASCAR crew chief.  About 10 years ago, I hung up my firesuit and stopwatch and went back to school.  I ended up at Columbia with a PhD under Klaus Lackner.  Now my focus is applying data science to climate.  I'm looking forward to engaging and learning from this great group of folks.",
    "Category": [
      "Data (Science)",
      "AI",
      "Energy Systems"
    ],
    "Link": "rho.ai",
    "ImageUrl": "https://dl.airtable.com/.attachments/3fe4360a7858bd467c87f7162e298cc0/f91d30f7/Josh_Browne_-_Moxley_Holdings"
  },
  {
    "Name": "Oli Hall",
    "Intro": "I've worked in startups in London for a number of years on the software and data side, but just over a year ago I quit my job to work full time on tackling climate change. I started Forge the Future (https://www.forgethefuture.com/), a collection of resources and companies I've come across whilst researching the space, and have also been running a weekly newsletter (https://forgethefuture.substack.com/) covering climate news. I've just started working with Deep Science Ventures (https://deepscienceventures.com/) and my friend @Mo Niknafs, looking at ways to price negative externalities and funnel finance towards decarbonisation. I'm looking forward to chatting with the many interesting folks here",
    "Category": [
      "Engineer",
      "Research"
    ]
  },
  {
    "Name": "Mike Jackson",
    "Intro": "Hi everyone, excited to be a part of this group. I've worked in the climate sector my whole career and am happy to be a resource to folks on this thread interested in navigating their way through it all. I spent nine years at the Westly Group, which is a cleantech venture fund, focused on seed through Series C investments. About 18 months ago I transitioned to being a consultant to investors and companies in the sector - I have three little kids and wanted to spend a bit more time prioritizing being Dad. I now work with Elemental Excelerator, Generate Capital, Village Global, and directly with a number of startups in the sector. If folks are interested in the investing world or the startup ecosystem, happy to be a resource. (edited)",
    "Category": [
      "Investor",
      "Veteran",
      "Helper"
    ]
  },
  {
    "Name": "James Crowley",
    "Intro": ":wave: everyone. I'm a founder & CTO, previously 7 years in fintech, mostly London based. I'm now focused on climate change and humanitarian aid (I see these becoming proactive and reactive sides of the same coin). I'm still learning where I can have most impact with my software / product / business skills - mostly working with non profits in a mentoring or advisory capacity so far. It would be great to find further avenues to explore here (do drop me a note!). I look forward to getting to know you all :earth_africa: :slightly_smiling_face: (edited)",
    "Category": [
      "Humanitarian Aid",
      "Entrepreneur"
    ]
  },
  {
    "Name": "Dawn Lippert",
    "Intro": "I'm Dawn Lippert and am stoked to join this amazing MCJ community of learners & doers! I founded Elemental Excelerator, a non-profit investor and startup program, about a decade ago to fund startups who are solving our most urgent environmental challenges. Each year we select 15-20 startups at seed to Series C stages (like @Brenden Millstein, @Jason Michaels & @Thomas Folker) and fund each up to $1M to deploy projects that uplift people and planet in Hawaii, California, and Asia. Our focus areas are energy, mobility, water, food & agriculture, and circular economy. We work with entrepreneurs who are ready to scale because our focus is deploying tech in the real world + working with policymakers to knock down barriers. Where the ideal of technology & policy meets the messy real world (like UX testing for hardtech...) - that's where you'll likely find us. If you know an amazing startup looking to grow, please refer them here - https://elementalexcelerator.com/program/ I'm a Seattle native & always happy to connect online, Honolulu, or Bay Area. Cheers!",
    "Category": [
      "Investor",
      "Accelerator / Incubator"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/871fecb17fe3f34c456afb95ba48c3ab/bcb1e6b3/Dawn_Lippert__Elemental_Excelerator"
  },
  {
    "Name": "Phil Giudice",
    "Intro": "Hi; I'm Phil. Guest on #52."
  },
  {
    "Name": "Landon Brand",
    "Intro": "Hey gang, excited to be a part of this group! I’m landon, cofounder of Wren (https://projectwren.com/) a monthly subscription to offset your carbon footprint.\nBased in the bay area, right now I’m really stoked about agroforestry, chestnut trees, and regenerative agriculture.",
    "Category": [
      "Decarbonization",
      "Food & Ag"
    ]
  },
  {
    "Name": "Lisbeth Kaufman",
    "Intro": "I'm a founder with a background in climate/energy/agriculture policy. I worked in the US Senate where I ran an energy efficiency retrofit program and wrote a bill financing cleantech on farms (it actually got passed!) Then I started and ran KitSplit.com for 6 years (sharing economy startup, called the Airbnb of cameras) just stepped away from day to day. Now exploring business/tech solutions to climate change to figure out how I can make a difference. Looking to either join a company that is making a huge impact or start something new.  Excited to learn from you all!",
    "Category": [
      "Policy",
      "Entrepreneur"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/fd73e3079fee63961178ca46aa20069c/1889b3f0/Lisbeth_Kaufman_-_Co-Founder_CEO__KitSplit__Crunchbase"
  },
  {
    "Name": "Brad Nelson",
    "Intro": "I’ve worked in tech at big brands and organizations; Starbucks, Nike, Gates Foundation, primarily on digital marketing across both consumer products and social impact. I’ve been passionate about climate for quite some time, and have a good deal of climate anxiety around it. I’m a dad of two young children and want to make sure I’m doing all I can. This has included getting involved in making our 80 year old house in Seattle as climate friendly as possible, and educating myself so I can advocate to others, both professionally and elsewhere. The MCJ podcast has been great to learn from and I look forward to learning more from this slack community! ",
    "Category": [
      "New Journey",
      "Marketing"
    ]
  },
  {
    "Name": "Alain Rodriguez",
    "Intro": "Hi everyone, I am Alain Rodriguez, co-founder of SINAI Technologies (https://sinaitechnologies.com). Our online platform empowers companies to manage their carbon strategy end to end, from inventories to setting targets and assembling the project portfolio to achieve their target. Rather than going straight to offsets, we help companies find the most financially efficient projects to reduce their footprint internally. Prior to SINAI I was an early Uber engineer and was a tech lead within Uber’s data infra team and in the past couple of years decided to put my expertise to work towards mitigating climate change. I am really excited and inspired to be a part of this community! (edited)",
    "Category": [
      "Decarbonization",
      "Entrepreneur",
      "Technologist"
    ]
  },
  {
    "Name": "Jeremy Freeman",
    "Intro": "Hey everyone! Super excited to be in here, this an awesome community you all have built :) My name is Jeremy Freeman and i’m the founder / director of a new tech non-profit called carbonplan.org based in SF. We analyze carbon removal opportunities using the best available science and data, and help companies, governments, and non-profits make better decisions towards their carbon removal goals. We’re committed to transparency and openness so our analytics and evaluations will be open source and available to the public, and we’ll be generating novel data products, tools, models, and more along the way. We’re early! So we’re eager to engage with folks in here on several fronts — carbon removal projects or researchers interested in evaluation and metrics, organizations making decisions about carbon removal funding, and any folks who might want to contribute to the effort.",
    "Category": [
      "Research",
      "Entrepreneur"
    ],
    "Location": "Bay Area",
    "ImageUrl": "https://dl.airtable.com/.attachments/6b1b252455a4913b8195a438dd0d701a/baa9f5fd/jeremy_freeman_thefreemanlab__Twitter"
  },
  {
    "Name": "Apoorv Bhargava",
    "Intro": "Hi everyone – this seems to be an incredible group, and I’m thrilled to join! Thanks to @Jason for inviting me. Inspired to see so many new and familiar faces! Apologies if this is a long intro, but I’m so excited to share my background, and see how I can help! Please reach out if anything in my background is interesting and you'd like to learn more.\nMy name is Apoorv Bhargava, and I’m the co-founder and CEO of Weave Grid. Weave Grid is working on intelligently connecting electric vehicles to the grid (jargon alert: EV– grid integration) in order to use them as a mobile grid resource, that can save utilities and customers billions of dollars, better integrate renewable energy, and of course enable transportation electrification to take off without the grid becoming an impediment. We’re venture backed and our team includes incredible people from Tesla, Opower, OhmConnect, NRG, Stem, and DNV-GL – please reach out if interested – we’re hiring!\nPrior to Weave Grid, I got my MS (Energy) and MBA at Stanford, where I spent time working in clean tech venture at The Capricorn Investment Group, and spent some time at an e-VTOL portfolio company too (Joby Aviation). I also spent some time at NRG, working on behind-the-meter energy storage. I spent the early parts of my career working on energy efficiency and demand response at Opower, and before that was a management consultant at BCG, working with utilities and oil & gas companies.\nI’ve been passionate about climate change and the impact of resource scarcity since I was 13 growing up on a tiny Mediterranean, and my whole academic and career background has been focused on climate solutions. I’m a huge fan of systems thinking and systems solutions, which means I look for approaches that have technology, policy, and biz model strengths. I’m a chemical engineer (spent some time on CCS) and energy economist by training, and was fortunate enough to be named to the Greenbiz and Forbes 30 Under 30 Energy lists in 2019. I was a Clean Energy Leadership Institute Fellow back in DC in 2014. (edited)",
    "Category": [
      "Helper",
      "Entrepreneur",
      "Energy Systems",
      "Systems"
    ],
    "Location": "Bay Area",
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/82769aae2efcf87720d37b61cce5f582/fe8f4430/Apoorv_Bhargava_apoorv_bh89__Twitter"
  },
  {
    "Name": "Dragos Stefanescu",
    "Intro": "Hey everyone, I’m an online entrepreneur focused on Social Media Marketing, Content Marketing & Branding. I’ve been involved in the blockchain space for the past 2.5 years working with a lot of startups (including a lot of SF-based ones). I’ve been pretty disillusioned with the crypto space lately and climate change has been on my mind for a few years now, but only recently started really digging into it.\nCan also share a Twitter list of Climate Scientists, Entrepreneurs & Activists (https://twitter.com/DrgStefanescu/lists/climate-scientists). Currently want to connect with as many like-minded people as I can and figure out how I can best contribute either by working with companies or educating the masses. As I told Jason, I found his podcast while I was researching starting my own, so super happy to see a community that shares dialogue along these lines. I’ve also started a weekly twitter thread curating climate news, will link one from a month ago here - https://twitter.com/DrgStefanescu/status/1186004053010071560",
    "Category": [
      "Crypto",
      "Branding",
      "Marketing"
    ],
    "Location": "Bay Area",
    "ImageUrl": "https://dl.airtable.com/.attachments/3330b45933237646f35c53008bdbb156/cb6aec99/Dragos_Stefanescu__Founder_at_TeacHack.com_15_Udemy_Courses_..."
  },
  {
    "Name": "Paul Yacoubian",
    "Intro": "I'm a Partner at the ESO Venture Funds and also an angel investor.\nI started my climate journey after smelling the smoke of the Paradise fires while on a trip to SF. I found out that wildfire seasons were getting increasingly hot and dry and that California had already seen the 3 degree jump in temperatures!\nI called Google's carbon team to see if I could throw down some money to buy carbon credits with them and they said no. I tried buying some landfill gas credits through Element Markets in Houston but they tried selling me credits that I later found out were for projects that shut down 10 years ago. I looked into the owner and found out that he was one of the masterminds of the fraud at Enron. I looked into Terrapass and learned that the owner lives in a 40k square foot house. I decided that we needed a high trust carbon offset subscription as a service aka Netflix for Saving the Planet.\nI pitched 100 of my friends and family members and got 30+ signups. Then Project Wren launched on TechCrunch this past summer and it was exactly what I wanted to build. I shut down my project and invested in their company instead. That's how I met Jason.\nThe 2nd biggest problem other than finding good projects was figuring out how to help people live lower carbon lifestyles. As it turns out, quarantine living is the lowest carbon lifestyle you can possibly have. No driving, no flying, just remote work and hanging out with your family in the backyard. I'm now working with a few designers and hardware specialists on building out the infrastructure needed to take existing homes off the grid, totally eliminating a major portion of your carbon footprint in the process.\nI think our best chance to alter consumer behavior is to capitalize on the pandemic quarantines of the next 12-24 months and see how much will stick.\nI have started a slack channel today for people who are interested in joining a pandemic action response team. Part of this team will be focused on coordinating the manufacture of these low carbon systems. DM for an invite or if you'd like to chat!",
    "Category": [
      "Investor",
      "Conscious Consumerism",
      "Decarbonization"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/e265e4fa6ad8bb32e860e086e924283f/1a0cc1df/Paul_Yacoubian_PaulYacoubian__Twitter"
  },
  {
    "Name": "Peter Reinhardt",
    "Intro": "Hey all! My name is Peter. I’m here to meet others in the climate tech ecosystem as we race towards zero net CO2 emissions. I’m a co-founder at Charm Industrial (https://www.charmindustrial.com, 7 people, SF) where we’re working to produce green hydrogen from biomass gasification. We’re testing the second version of our gasifier at the moment and aiming for a commercial demonstration in the next 24 months. I’m also CEO/co-founder at a software company called Segment (https://segment.com, 500 people, SF) and my better half is @Erika Reinhardt :slightly_smiling_face: If you know about DAF funding, project finance, or are currently working to sell into oil & gas companies, I’d love to chat. Thanks for having me! (edited)",
    "Category": [
      "Entrepreneur",
      "Research"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Daniel ",
    "Intro": "Hi everyone, Daniel here. Formerly with GE Ventures, National Grid and RockPort Capital. And, of course, Jason’s very first podcast guest on My Climate Journey!",
    "Category": [
      "Investor"
    ]
  },
  {
    "Name": "Hampus Jakobsson",
    "Intro": "Hi, my name is Hampus and I’m a climate investor. :smile: Love to chat to other smart people fighting this problem! I’m based in Thunberg-land (aka Sweden). (edited) \n",
    "Category": [
      "Investor"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/43b41ebf896eb4b84af603ffb889d367/b22a73c9/Hampus_Jakobsson__AngelList"
  },
  {
    "Name": "Zoe Himwich",
    "Intro": "My name is Zoe -- I am a first year math PhD student at Columbia, and just starting to get interested in this space. My biggest area of focus is the US energy grid, so I would love to talk more with anyone who shares an interest in potential steps forward for grid modernization!",
    "Category": [
      "Energy Systems"
    ],
    "Location": "NYC"
  },
  {
    "Name": "John Garry",
    "Intro": "Hi, I’m John Garry. Currently based in Indianapolis, IN, I’m a member of the investment team at High Alpha. We’re a venture studio that invests in companies from the idea phase through Series A. Prior to that, I worked at an endowment fund, helping them invest in energy funds amongst other asset classes.\nI’ve seen a lot of utility-scale power gen and fossil fuel production, but am just beginning to understand the energy/climate-focused startup community. Looking to continue to learn more about the major roadblocks to adoption of climate-conscious political and corporate policy and meet more people that are building companies to address those problems. Thanks!\n\n\n4 days agoView thread",
    "Category": [
      "Investor",
      "New Journey"
    ]
  },
  {
    "Name": "Alex Teichman",
    "Intro": "Hi folks.  :wave::skin-tone-2:  AI entrepreneur here, pretty interested in whether there’s a good way to use what I know to align capitalist & environmentalist interests. I don’t have an answer yet, and maybe being here will help with that.  :wink:\nMeanwhile, if you have a question about AI, deep learning, machine learning, etc., please don’t hesitate to ping me.  I did a PhD on this at Stanford, founded & sold a deep learning startup, and would love to talk.\nThanks for the invite Jason. (edited)",
    "Category": [
      "AI",
      "Entrepreneur",
      "Helper"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "raylene ",
    "Intro": "I just discovered MCJ & am really loving it so was especially excited to learn about this group! Thank you to those who've been working on it.\nI live in SF and have been spending the last few months learning about climate change & figuring out what I should do next. I also created a slack community for fellow in-between-job-explorers so ping me for an invite if that interests you. Prior to this, I spent ~10 years at Stripe & Facebook in engineering and product leadership roles. Excited to meet more of you & reach out anytime!",
    "Category": [
      "New Journey"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Kyusik Chang",
    "Intro": "Like some here, I’m looking to make a switch from a tech career to climate change, and I’m at the very start of my journey of learning.  I’m trying to answer that fundamental question of whether/how I can meaningfully contribute to this problem space given my background.  Most recently I was at Strava (sorry Jason!) where I ran product for Summit/Premium and was responsible for the P&L.  Before that, I had started a company and built a personalized book recommendation engine using ML, sold it to Goodreads, then helped sell Goodreads to Amazon.  I was also an early part of the team at Zillow, among other places.\nI’m really enjoying the podcast and looking for ways to connect with others in this space to help accelerate my understanding - hopefully some of that in-person in SF.",
    "Category": [
      "New Journey"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "James Chiang",
    "Intro": "I worked at Indeed.com for ~8 years, starting in their International department eventually moving to Director of SEO. I left in 2018 to travel and reassess after a hefty concussion. Looking at my passions and running through my reading list, I decided to rededicate myself to working towards environmental good. Currently looking for work in Austin, TX, and excited to see what options there are in the space! Seeing all the ways to make a difference is very inspiring, good way to continue the inspiration and fight against the pull of obscenely high salary positions financed by making people consume more things. Please get in touch if you think there's a way I can help what you're doing!",
    "Category": [
      "New Journey",
      "Marketing"
    ],
    "Location": "Austin"
  },
  {
    "Name": "Chris Campbell",
    "Intro": "Hi everyone, I’m Chris, co-founder/CEO at Plausible Labs (https://twitter.com/plausiblelabs), a worker-owned software cooperative based in San Francisco, which is also where I live with my wife and two kids.  Plausible has been around for more than a decade; we’ve worked with a range of clients (mostly startups) while also building things of our own (mobile/desktop apps + low-level tooling/libraries).  Prior to Plausible, I spent 10 years at Sun Microsystems modernizing Java’s graphics+UI stacks.\nThese past few years, I’ve grown dissatisfied with the nature of our work, too often getting involved with projects that, while not entirely without merit, don’t seem to do much good in the Big Picture.  I’ve been a casual observer of the climate space for a long time, but it wasn’t until early 2019 that it finally clicked that I could orient my career to helping somehow in the fight against climate change.  (Talks with my young kids, and frequent scoldings from Greta, played no small part in that mental shift.)\nI’ve spent the last few months learning as much as I can about the climate landscape.  And at Plausible, I’ve been working to shed extraneous projects so that we can focus on more useful work.  We’re now committed to taking on new consulting work only with companies whose primary mission is in fighting climate change.  I’m hoping Plausible can gain trust/reputation within this community with our solid engineering work, while also serving as a landing/launching pad for similarly-minded software folks who want to shift their careers in this direction.",
    "Category": [
      "Technologist"
    ],
    "Location": "Bay Area",
    "ImageUrl": "https://dl.airtable.com/.attachments/17cc3540478ad3b86bd4c671062e52b0/b6afeff7/chrispcampbell_Chris_Campbell__GitHub"
  },
  {
    "Name": "Evan Mula",
    "Intro": "Hi everyone, Evan Mula here. I’ve spent the last six years working at early stage startups in Boston. Some of you guests may recognize me as I was @Jason’s right hand man who helped get My Climate Journey off the ground. A huge thank you to all the past and future MCJ guests and to all the listeners and supporters.",
    "Category": [
      "Technologist"
    ]
  },
  {
    "Name": "Sam Cryer",
    "Intro": "Hi everyone, I’m Sam Cryer – A UK (London) based scientist and founder.\nI have three hats here: :tophat::mortar_board::helmet_with_white_cross:\n.\nScientist :mortar_board:\nI did my PhD in organic chemistry – specifically solar material synthesis (organic electronics) and am interested in applying my knowledge in any way I can. Feel free to ask me any science questions and if I don’t know, I probably know someone that does.\nI also spent 6 months undertaking my own climate journey with Deep Science Ventures (venture fund who starts impactful science companies) – speaking to academics and looking at where you could start climate positive companies that can be backed by standard VC !\n.\nFounder :tophat:\nThis led me to come up with the idea for Thermulon – sustainably produced, affordable and fire-safe building insulation materials (in the wake of Grenfell tower block fire disaster in the UK).\nBuilding insulation isn’t super sexy, but humanity spends vast sums of (O&G) energy on heating our homes and offices (~35% of energy in the EU) – so high performance materials are an important bullet in the climate fight. We’re a process chemistry company at heart (which is tough finding investors who love CapEx), currently developing our tech and fundraising.\n.\nActivist :helmet_with_white_cross:\nI have been on a number of Extinction Rebellion marches / events in London (yet to be arrested), but believe it’s been a massive driver in changing the attitudes towards climate in the UK. An issue which even a year or so ago wasn’t particularly prevalent in the eyes of the public – is now being talked by most people in some capacity. I think what they’re doing is pretty powerful (although methods vary).\nPlease talk to me about any / all of the above! And if you want to start a climate positive company – check out Deep Science Ventures",
    "Category": [
      "Research",
      "Helper",
      "Entrepreneur"
    ],
    "Location": "London"
  },
  {
    "Name": "Mike Coren",
    "Intro": "Hey everyone,\nThis is Mike Coren. I’m the climate change reporter at Quartz. I cover the intersection of climate, tech, and economics, and write the “Race to Zero” emissions newsletter rounding up the global fight against climate change: https://qz.com/emails/the-race-to-zero-emissions/\nI’m starting an outlet called Hothouse dedicated to climate solutions with Jemima Kiss (formerly Guardian) . There’s a lot of people looking for ways to take action. We’d like to be there for them. We were inspired in part by how Wired and the Whole Earth Catalog catalyzed a community. Happy to chat more, and excited to be working alongside such a great group of people. :sun_with_face: :earth_africa: :ocean: :raised_hands: (edited)",
    "Category": [
      "Journalist"
    ]
  },
  {
    "Name": "Mike Kruzeniski",
    "Intro": "Hey everyone! I'm Mike. Very excited to meet others that are interested in this space. I was recently the head of Design & Research at Twitter. I live just north of SF, in Mill Valley. I do some angel investing, and Design consulting/advising, and am looking to focus more of my time and energy on climate projects. A few months ago I started building a list of startups and companies working on climate solutions, and have found ~675 so far. I'm working on turning that in to a site for others to reference.",
    "Category": [
      "Designer"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Olya Irzak",
    "Intro": "My name is Olya, I'm the CEO of Frost Methane Labs - we mitigate concentrated continuous methane emissions from the permafrost, coal mines and other geological sources. Previously I worked at Off Grid Electric on minigrids in Sub Saharan Africa and  Google X on Dandelion (geothermal heating and cooling) & Malta (grid scale storage in heat), & Google Energy on a variety of electric grid related projects. I also sport a mild kitesurfing addition.\nFor those in the bay area, we have a little in person climate meetup community / speaker series we run through facebook: https://www.facebook.com/groups/701103413374218/\nDon't hesitate to contact me if I can be helpful to anyone in my sub areas of climate expertise. (edited)",
    "Category": [
      "Helper",
      "Energy Systems",
      "Methane"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Ann Bordetsky",
    "Intro": "All! :wave: I'm kind of a boomerang on climate / energy. Started my career in DC working on federal climate, energy + transportation policy at NRDC, then (post MBA) rode the cleantech startup rollercoaster (bust?) in 2008-2012 (EV charging, grid storage, mobility). Built one of the first sharing economy startups in SF (Wheelz, sold to Turo). Have been \"recovering\" in Tech for last 8 years (currently COO at Rival, ex-Uber, Twitter). I also do some angel investing and side hustle is building fund to support female founders (Jane VC). Feels good to re-engage and discover this awesome community! TY @April Underwood for getting me plugged in. Planning on hosting a few climate dinners in SF this year to connect tech folks with policy, academic, NGO experts.",
    "Category": [
      "Energy Systems",
      "Technologist"
    ]
  },
  {
    "Name": "Sierra Peterson",
    "Intro": "Sierra Peterson here. I lead climate protection investing for Lionheart Ventures, an early-stage VC based in San Francisco. I’ve been working on market-driven approaches to climate change for the past 15 years, from stints in the Obama-era White House Office of Energy and Climate Change and the International Energy Agency to more recently building investment platforms responsible for more than $3B in sustainability financing. I also serve on the board at Climate Neutral, the consumer standard that drives companies to eliminate their GHG footprints.\n \nLook me up if you want to chat pre-seed / seed investing, asset financing, regulated market design, offsets, energy policy, fintech, insurance - you name it on financing and company-building for climate protection! And as @Jason knows, I’m always happy to compare notes offline during a walk in the Presidio.",
    "Category": [
      "Investor"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/7e6203857124ff3ce518309770389e1d/f64e7960/Certified_Climate_Neutral__About_Climate_Neutral"
  },
  {
    "Name": "Mike Olson",
    "Intro": "I'm co-founder of Cloudera, the big data company, where I served as CEO 2008-2013 and Chief Strategy Officer 2013-2019. Before that I was CEO at Sleepycat Software through its acquisition by Oracle in 2006. I worked mostly for database companies in the years prior, following my BA and MSc in CS from Berkeley, where I worked for Mike Stonebraker on Postgres. Nowadays I sit on several non-profit boards and read a bunch. I expect to lurk and learn for a bit here; curious about carbon capture, investment, organizational issues in the companies spinning up to do meaningful work on climate change.\n",
    "Category": [
      "Technologist",
      "Entrepreneur"
    ],
    "Location": "Bay Area",
    "ImageUrl": "https://dl.airtable.com/.attachments/76fc0c23f981e397b2521f41beef0b6f/acaea413/Mike_Olson_mikeolson__Twitter"
  },
  {
    "Name": "Ramanan Raghavendran",
    "Intro": "Hi folks, I run Amasia (www.amasia.vc), a thesis-driven global VC firm with offices in the Bay Area (where I supposedly live) and Singapore. Our thesis for our current fund (and I expect all future funds) is climate and sustainability — we are “all in”. I write on climate on my blog (https://www.ramanan.com/climate-society).\nOne of my goals for the next twelve months is to build out a climate-related non-profit footprint (with a focus on “data”). I’ve taken small steps in that direction with my alma mater (https://web.sas.upenn.edu/sociospatialclimate/).\nI am honored to be part of what @Jason has created here (and a big shoutout to @Baptiste Malaguti for telling me about it). I hope to learn from everyone, and in turn I hope I can bring a global perspective to this community given my work and personal lives (LinkedIn profile here: https://www.linkedin.com/in/ramananraghavendran/).",
    "Category": [
      "Investor"
    ],
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/2eeb6927b9c6d1ab07fe02143690b274/b82e4f74/Staley_Capital__Ramanan_Raghavendran"
  },
  {
    "Name": "Lily Bernicker",
    "Intro": "Thanks Jason for inviting me and all the work you've done to bring this community together! I'm an investor at Collaborative Fund (collaborativefund.com) -- a mission-driven VC that backs teams pre-seed to Series A. I have a background in consumer tech + food and ag systems, and have invested in plant-based and cell ag companies since joining Collaborative Fund. I'm always looking for more ways to deploy capital against high impact solutions and recruit/support more smart folks to join the fight against the climate crisis. I'm especially excited to learn about deep tech opportunities to reduce our emissions and be a sounding board for folks thinking about fundraising or launching consumer-facing businesses. I'm based in NYC, but out in our SF office every couple of months. Drop me a line if you find yourself in either and want to grab coffee/tea (lily@collaborativefund.com)!\n\n\n21 days agoView thread",
    "Category": [
      "Investor",
      "Food & Ag"
    ]
  },
  {
    "Name": "Tiana Veldwisch",
    "Intro": "I'm a newcomer to the climate space and have been enjoying MCJ as a way to get oriented to the industry and its opportunities. I especially appreciate when @Jason asks guests on the show how folks can get involved. It's clear to me that reducing my family's footprint isn't enough so I'm looking to point my career efforts in this direction too.\nI'm a Product Manager with ten years of experience in the health tech sector and am looking to pivot into the clean energy / sustainability / climate change mitigation space. I come to product management through engineering and an MBA from MIT. I'm eager to use my problem-solving, people-organizing, tech-to-business-translating, and solution-iterating skills in this new area. \nIf anyone has ideas and opportunities in the Boston area, or knows anyone looking for a product manager type, I'd be happy to talk! In the meantime I've got hours of MCJ to listen to and now lots of great content in here to read too! Looking forward to getting involved!",
    "Category": [
      "New Journey"
    ],
    "Location": "Boston",
    "ImageUrl": "https://dl.airtable.com/.attachments/1b841cbdc53336b4a139fdf2a9ca5233/429524d5/Tiana_Veldwisch_-_Sr._Director_of_Product_Management_..."
  },
  {
    "Name": "JT White",
    "Intro": "Hi everyone, I'm JT White, cofounder of Forerunner (withforerunner.com). Our software helps government agencies better understand, plan for, and communicate flood risk by extracting large amounts of data from permits. We are working on pilots with the city of New Orleans and Pinellas County, FL and have several other towns live in the NY/NJ area. Our team is based in NYC and looking for more software engineers if you know of anyone interested in climate resilience!",
    "Category": [
      "Flood Risk",
      "Entrepreneur",
      "Resilience"
    ],
    "Location": "NYC",
    "Link": "withforerunner.com"
  },
  {
    "Name": "Mike Kirby",
    "Intro": "Hi everyone.  My name is Mike and I'm from Baltimore, MD.  Excited to be here.  I've been in solar since 2009, working at a small company for 3 years and a national company for 6.  In April 2018, I started Lumina Solar (luminasolar.com) with a great team of people I'd been working with since 2012, focused on residential/commercial solar, storage, and energy services.  After a great start the last 18 months, we recently closed our Series A raise and acquired our installation partner to further scale operations and our commercial/energy services business.  I'm happy to provide any insight into the solar, storage, EV charger and energy services space.  Looking forward to learning from others in adjacent markets.",
    "Category": [
      "Energy Systems"
    ],
    "Link": "luminasolar.com"
  },
  {
    "Name": "MC O'Connor",
    "Intro": "hi all! I'm MC O'Connor and I work for Activate, the non-profit that runs the Cyclotron Road fellowship program with Lawrence Berkeley Nat'l Lab. I do communications for Cyclotron Road and Activate Boston, our new node (selecting fellows for both cohorts now). And we're all fans of MJC. Nice to be here!",
    "Category": [
      "Investor"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Karthik Rao",
    "Intro": "Hi all, very excited to join this great community! I've spent more than a decade in the cleantech space, mostly with EnerNOC as we pioneered technologies in demand response and energy intelligence software.  I'm currently with Enel X, leading a team that delivers renewable energy, EV charging, energy efficiency, and other sustainable solutions to the world's largest enterprise customers.  I've been doing some soul searching lately on which aspect of the climate challenge I want to focus on next, and am very curious to learn more about what folks are working on at early stage companies and where I can bring the most value.  I recently moved from Boston to Washington, DC and would love to meet up with anyone in the area.  Big thanks to @Jason for setting up the group! (edited)",
    "Category": [
      "Energy Systems",
      "Veteran"
    ],
    "Location": "DC"
  },
  {
    "Name": "Paul Straub",
    "Intro": "Hi all! Good to see many friends here and I look forward meeting more as part of the MCJ community. I've been investing in climate/cleantech/sustainability/energy tech/resource efficiency startups (what are we calling it this year?) for over a decade and launched Wireframe Ventures with Harsh Patel three years ago. We back founders solving challenges around climate, environmental sustainability and human health. We're based in SF, tech agnostic and love to be the first check in pre-seed or seed round. On the personal side, I'm a DC area native drawn to the Bay Area in '98 partly by the .com boom but mostly by the chance to cycle/ski/hike and play outdoors. It’s a big reason I’m still here, but now have a wife and daughter to try and keep up with on the trails! I began shifting to \"cleantech\" in '06 after years in datacenter sw, convinced that there was opportunity to align my personal convictions with building great startups solving environmental challenges. I’ve taken a few lumps and had some good wins. Our climb with climate seems steeper today, but I’m optimistic and thrilled by the increasing talent and creativity focused on the problem.",
    "Category": [
      "Investor"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/d8f477ba9572318cc3410e4e02324a6a/883f5cb0/Paul_Straub_-_EDGE"
  },
  {
    "Name": "Shawn Drost",
    "Intro": "Hi friends! I’m an entrepreneur based in Berkeley. I’m between companies right now... I sold my last company (Hack Reactor, the coding bootcamp) and am now shifting focus to sustainability. I’m dedicated full-time to study right now and I hope to join or start a company or nonprofit in the next six months or so. Also a dad to a six month old, co-creator of the New Orleans Writers Residency, and iffy guitarist. Looking forward to meeting you all!",
    "Category": [
      "Entrepreneur",
      "New Journey"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Alon Salant",
    "Intro": "I’m  founder and former CTO of Good Eggs, a grocery delivery company founded in the Bay Area with a mission to grow and sustain local food systems worldwide. We focused on scaling sustainable agriculture for the clear benefits to communities, local economies, and the planet.\nI’m now on my own climate journey as I look for ways to have maximum impact on our global crisis. I’m thrilled to join you all.",
    "Category": [
      "Entrepreneur",
      "Food & Ag"
    ],
    "Location": "Bay Area",
    "ImageUrl": "https://dl.airtable.com/.attachments/391f17f35fa80c9fba2cbecc4bc18ab9/aefd83f3/Alon_Salant_-_Good_Eggs_Product_Team"
  },
  {
    "Name": "David McColl",
    "Intro": "Hey all! This group is incredible and I’m so grateful to be joining. I’m working with Rho AI (https://rho.ai/), a data science company that partners with many energy startups, corporates, and investment firms to enable them to make better data-driven decisions. We are part of the team building CRANE (http://bit.ly/30S8IUL), a modeling system to assess the carbon impacts of early stage technologies. Additionally, I work with a VC fund called Moxley Holdings, serve as a technical advisor for Cleantech San Diego, and was previously on the innovation team at Enel. Looking forward to getting to know the people in this group better!\nrho.airho.ai\nRho AI\nRho AI partners with companies and organizations that have a desire to leverage their data to impact their bottom line.\nGlobeNewswire News RoomGlobeNewswire News Room\nCRANE Software Project Launches to Address Gap in Climate Impact Assessment Solutions for Early-Stage Investors\nNew public-private partnership to make assessing the climate impact of emerging technologies easier and more data-driven",
    "Category": [
      "AI",
      "Data (Science)",
      "Energy Systems",
      "Investor"
    ],
    "Link": "rho.ai"
  },
  {
    "Name": "Daniel Billingham",
    "Intro": "Hi all. I’m Daniel, based in Melbourne Australia. Currently Product Manager at Culture Amp, most of my career I have been a designer and startup founder. I’m super early on my climate journey and simply trying to learn much more in the next few months to find my place in the solution.\nThis has been in the back of my mind for a while now, but unfortunately it has taken the current bushfires in Aus to kick into gear greater urgency for me :(\nThanks @Jason for sharing your journey to connect such a great group to learn from each other!",
    "Category": [
      "Designer",
      "New Journey"
    ],
    "Location": "Australia"
  },
  {
    "Name": "Ryan Wise",
    "Intro": "Hello all. I'm a Boston-based product & ops lead (18 years at Athenahealth) who has decided to focus on climate. Awesome to find a group where that feels so normal! I’m looking for my next role, and bring a background in scaling a complex service business. I’d love to connect with folks in the Boston area, in particular.\nResearching climate change is often pretty depressing, so thank you @Jason for creating this oasis of optimism.  Favorite MCJ quotes: Alex Flint saying \"well, you have to realize that one hundred billion dollars isn't very much money\" (and then backing up his point in one sentence); and Jason asking Pat Brown “do you mean the cow?”",
    "Category": [
      "New Journey"
    ],
    "Location": "Boston"
  },
  {
    "Name": "Michael Bauer",
    "Intro": "I'm super excited about MCJ, I've heard great things about the community here from friend/mentor @Mike Miller. I spent the last several years building a computing infrastructure company (Sylabs.io), but most recently (December 2019) I left to join Facebook's AI Infrastructure team to help build and scale our next generation of AI capabilities. I joined the community so I can learn more about the problem space, identify things I can do to help out, and make connections with other like-minded people. If anybody is out here in the Bay Area and wants to grab a cup of coffee to chat, please ping me! I live in Mountain View! Really excited to get to know everybody",
    "Category": [
      "Engineer",
      "Data (Science)",
      "New Journey",
      "AI"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/809b2ee785e15c766e77028b8b6283e0/a0b73fc5/Singularity_The_Inner_Workings_of_Securely_Running_User_..."
  },
  {
    "Name": "Jace Kohlmeier",
    "Intro": "Hi :wave:! I'm Jace, and I\n• know a good amount of math and computer science\n• want to know way more about soberly assessing climate risks\n• once made a giant hedge fund a ton of money with algorithmic, statistical trading (groan)\n• then co-founded a proprietary firm to do similar (okay)\n• then made cooler things at Khan Academy and built their data science team (yay!)\n• still actively but quietly invest: venture, private, impact/charity, computerized\n• advise a couple venture firms (DCVC and NYCA) and a few companies\n• live in the bay area (los altos), have three daughters and a great partner\nI really hope to start meeting and learning from many great folks I see here. Don't hesitate to reach out for any reason.",
    "Category": [
      "Finance",
      "Education",
      "Computer Science"
    ]
  },
  {
    "Name": "Jon Goldberg",
    "Intro": "I've spent 15 years in commodity trading, the last few i've gravitated towards climate work including what we are doing @ columbia university's energy policy center where i help run our carbon management program. for the last few months i've been building a business around scaling supply and demand of negative emissions, which we need badly!",
    "Category": [
      "Decarbonization"
    ],
    "Location": "NYC"
  },
  {
    "Name": "Maddie Hall",
    "Intro": "Hey everyone, I'm Maddie and I am a co-founder of LivingCarbon. We're an ambitious plant biotech company developing supertrees that grow faster, uptake more CO2 and produce more durable wood. I used to work at OpenAI but realized that any +10 year project is going to be impacted by climate change and so I decided to leave and start a company in the space. I also worked on http://carbon.ycombinator.com/ I am looking forward to learning from others about carbon markets and other ideas in the solution space. I'd love to talk to anyone who has connections in timber! (edited)\ncarbon.ycombinator.com\nCarbon Removal Technologies | YC Request for Startups(124 kB)\nhttp://carbon.ycombinator.com/img/meta-image.jpg",
    "Category": [
      "Entrepreneur",
      "Biotech",
      "Carbon Removal"
    ]
  },
  {
    "Name": "Fareed Mosavat",
    "Intro": "Hello all!\nI’m Fareed Mosavat, and excited to learn from this community. I first met Jason when we worked together at Runkeeper, where I was VP Product. I’ve also run product teams at Pixar, Zynga, Instacart, and finally at Slack. Over the past year I’ve ramped up my advising and angel investing, and would love to work with more climate-focused companies.\nAs a first offer of help, if you have questions about how to organize this Slack community… hit me up. Every current and former Slack employee is eventually roped in to help administer and manage every Slack workspace they are a part of for the rest of eternity, so here I am.\nNice to meet everyone.. and reconnect w/ the few of you I already know or have worked with! (edited)",
    "Category": [
      "Operator"
    ]
  },
  {
    "Name": "Titiaan Palazzi",
    "Intro": "Jason's search reminds me of “Institutional Acupuncture”, Amory Lovins’ idea to focus on “the often delicate or obscure points whose precise stimulus can unblock congestion”. https://rmi.org/wp-content/uploads/2017/04/RMI_AnnualReport09-10.pdf\nAmory was my mentor at Rocky Mountain Institute, where I worked from 2014–2018. I left RMI two years ago to co-found Myst AI, a Google-backed startup focused on time series forecasting. We help leading global energy energy companies to increase profits and lower emissions, by providing forecasts for load, renewable production, market prices (with much more to come soon).\n",
    "Category": [
      "Data (Science)",
      "Entrepreneur",
      "Energy Systems"
    ],
    "Location": "Bay Area",
    "ImageUrl": "https://dl.airtable.com/.attachments/b8f8b302f51f6d49b96d92c551e76269/4fedf7fa/Titiaan_Palazzi_titiaan_palazzi__Twitter"
  },
  {
    "Name": "Stefano Bernardi",
    "Intro": "Hello everyone, Stefano here.\nCurrently in :flag-au:Australia, but otherwise live in the Dolomites in northern Italy.  :it::snow_capped_mountain:\nSince a year and a half, I’ve switched my angel investing to what I call Planet+ (which is a bit broader than climate and includes ecosystem restoration in general, plus waste, new materials, etc.).\nWrote a bit about the journey here: https://stefanobernardi.com/1-year-of-planet-angel-investing/\nMade a few more crazy investments after that post, and continue to see amazing dealflow.\nCurrently figuring out how to best structure my investing / building activity. Happy to chat with anyone who’s interested in the topics.\nVery happy to share deals with people, as there’s a lot of good stuff I can’t invest in that might fit in other people’s portfolios\nStefano BernardiStefano Bernardi\n1 year of Planet+ angel investing\nIn October 2018, I had the honor of joining the angel programme of the largest European venture fund. I was therefore tasked with figuring out how to think about allocating the $100,000 entrusted t…",
    "Category": [
      "Investor"
    ],
    "Location": "Australia"
  },
  {
    "Name": "Chris Powers",
    "Intro": "My name is Chris Powers and I am an entrepreneur currently residing in Michigan (metro Detroit). I have taken the last three months off to focus on health, friends, and family while traveling to places around the USA that have interesting climate / environmental projects happening. I had the opportunity to tour NREL, participate in NYC Climate Week, The Project Drawdown Research Conference at Penn State, and to meet with a group of founders in Chicago during that sojourn.\nFrom 2018-late 2019 I was the partner in an environmental consulting start-up and managed an online community of 20,000+ people who were interested in permaculture, local food, and environmental topics.\nBefore that I resided for 6 years in Chicago and was a Key Account Manager at Henkel. During my time in the corporate world, I also launched a virtual summit about Vertical Farming and Urban Agriculture, and volunteered for innovative nonprofits focused on food and waste reduction, including The Association for Vertical Farming, Thought for Food, and Plant Chicago.\nI’ve been obsessively studying and networking in the areas of sustainable food production, circular economies, AgTech, and Climate since about 2014 and have had the opportunity to meet a lot of cool people.\nIn 2020 I have two big picture goals:\nReduce my personal impact by setting up a permaculture landscape / garden, make my house in Michigan net zero, and to change my buying habits.\nTo earn a full-time living by helping to grow climate-effective companies / organizations.\nProfessional Skills: I have a chemical engineering degree with a research concentration in functional nanomaterials, My business experience is in optimizing manufacturing processes, high value & complex technical sales, running training seminars, writing compelling sales copy, launching online products, marketing / positioning, strategy, environmental consulting, and some experience hiring, training and building teams.\nDuring the first year of my career, I did a leadership rotation program, so I’ve worn many different hats, including lab ops, sales, marketing, manufacturing, engineering, product development, product management, and quality control.\nWhere I Hope to Add Value to This Group:\nTechnical expertise and engineering skills, particularly when it comes to evaluating manufacturing and energy systems.\nBrokering high value partnerships / sales transactions\nProviding connections to my network.\nOn a personal side, I enjoy reading, writing, martial arts, backpacking, traveling, learning new things, playing games and time w/ friends and family.\nIf you want to learn more about me, I have a personal site www.chrispowers.me (work in progress) & feel free to reply to this post or message me privately to discuss any of the above information further.",
    "Category": [
      "Community Organizing",
      "Entrepreneur",
      "Research",
      "Helper"
    ],
    "Location": "Detroit"
  },
  {
    "Name": "Max Tuttman",
    "Intro": "Hey everyone - I’m in DC at ARPA-e, the Department if Energy’s group that funds high-potential energy technologies generally too early for private-sector investment. I help our funded teams develop their commercialization strategies so that the technologies that they build can have real world impact. Part of my role is connecting them to the partners and investors, so I’m excited to get tied into this group.\nI’ve previously worked for startups in the biofuels and utility software space, as well as a brief stint consulting on corporate renewable energy procurement.\nLooking forward to the discussions!",
    "Category": [
      "Government",
      "Energy Systems"
    ]
  },
  {
    "Name": "Joe Strommen",
    "Intro": "hi everyone!  My name is Joe Strommen and I'm from Minneapolis.  I'm working on a startup in electrified building heat (residential, for now) called 2040 Energy.  I spent most of last year working on on the company, have gone back to software consulting for a bit, but am gearing up to re-launch this spring.\nI joined the channel to meet and collaborate with other people working on the same problems (building heat and climate tech in general).  I hope to have some interesting discussions!",
    "Category": [
      "Entrepreneur",
      "Buildings"
    ]
  },
  {
    "Name": "Bruce Daisley",
    "Intro": "I'm honoured to receive the invite. I'm Bruce Daisley, based in London. This week I quit my 8 years of being a EMEA VP at Twitter (hence why I know a couple of people here :wave:). Along the way I've become a workplace culture enthusiast and have written a book on it etc.\nI quit Twitter to spend my time working on climate change - either campaigning, working pro bono or working with start ups. If you ever want a perspective from London hit me up. I love laughing too, if that helps.",
    "Category": [
      "New Journey"
    ],
    "Location": "London"
  },
  {
    "Name": "Erin Delatte Lindgren",
    "Intro": "I come to the group with a bit of a different background. In a past life, I practiced law in New Orleans, focusing on director and officer liability / general commercial litigation and was then in-house counsel at a dining/entertainment start-up. \nAfter taking a few years off to have kids, I realized that (1) I did not want to practice law in a traditional sense (shocker!) and (2) I wanted my career to meaningfully contribute to the climate crises. Currently, I’m the Chicago Coordinator for Hazon, the largest faith-based environmental organization in the US, where I help local Jewish non-profits (synagogues, schools, JCCs, etc.) identify and implement sustainability solutions.\nWhile this role has been a great first step, over the next year-or-so I’d like to take the time to familiarize myself with the climate change landscape to determine where I can most effectively apply my skill set. I’m particularly interested in regenerative agriculture, and would love to contribute to that field - without having to run a farm or get a degree in soil biology ;) \nThe current exchange of ideas on here has already been incredibly informative and I very much look forward to learning from this group!",
    "Category": [
      "Food & Ag",
      "Law"
    ],
    "Location": "Chicago"
  },
  {
    "Name": "Valerie Gardner",
    "Intro": "Hey all! Valerie here. My history: I was WebTV's founding CFO. In the post-Internet bubble, I launched an investment management firm with a quant slant. My climate journey started circa 2005, following a National Academy of Science talk revealing how \"f**ked\" our climate was! My deep dive involved a long, entirely tortured learning curve (though I did \"crowd-source\" some of my climate education by developing community environmental programs), which is why I am particularly thrilled that @Jason's efforts will shorten that process for others. By 2010, I settled on trying to assess carbon pricing impacts on portfolios. We explored all low-carbon energy generation and we designed a strategy to reject fossil fuel's carbon exposure but actually replace that with proportional exposure to low-carbon generation—which was, and still is, nuclear power. These days, I am taking what I learned over the last decade to the next level and I am now working to launch Nucleation Capital, a pooled investment vehicle to invest in advanced energy systems, 4th gen nuclear, deep decarbonization, climate services and other requisite facets of the future carbon-priced economy.",
    "Category": [
      "Investor",
      "Decarbonization",
      "Nuclear"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/bff991157b0041cf179f4ca08587ce93/a8d77317/Team__Nucleation_Capital"
  },
  {
    "Name": "Sam Smith-Eppsteiner",
    "Intro": "Hey all! I'm Sam Smith-Eppsteiner, generally interested human and partner at early-stage VC firm Innovation Endeavors. We focus on emerging tech (AI, data, robotics) applied to large, real-world industries such as ag & food and all things industrial, so lots of climate implications there. I'm working on building a climate-oriented thesis for the firm but am still trying to sort through where emissions reduction is value additive vs. unintended (positive) externality.\nHoping to learn from folks much more knowledgeable than myself and find ways to work together!",
    "Category": [
      "Investor"
    ]
  },
  {
    "Name": "Abe Stanway",
    "Intro": "Hi! I'm the cofounder and CTO of Amperon (https://amperon.co). We’ve got offices in NYC and Houston. We work with energy retailers, grid operators, and utilities to provide real time electricity demand forecasts based on AMI data, helping our customers save $$$ on grid operations (while reducing emissions on a macro scale!). We've published at ICML; we've got a great team that includes energy traders, meteorologists, and ML researchers; we've got customers throughout America and Australia; we're backed by Notation, SV Angel, Powerhouse, and others. Also, we're hiring! https://angel.co/amperon/jobs (edited)",
    "Category": [
      "Energy Systems",
      "AI",
      "Entrepreneur",
      "Data (Science)"
    ],
    "Location": "NYC"
  },
  {
    "Name": "sam liebeskind",
    "Intro": "Hey everyone, I'm Sam - I live in NYC, work at a pre-launch group chat startup, and advise several other companies (mostly on brand/marketing) ranging from fashion to consumer electronics. I fully believe in the power of communities, and am super excited to be here to learn with/from everyone - both from a personal standpoint, and to figure out how I can steer the organizations I'm part of to be on the good side.",
    "Category": [
      "Branding",
      "Community Organizing"
    ],
    "Location": "NYC"
  },
  {
    "Name": "Gentry Underwood",
    "Intro": "Hi everybody -- I've been lurking here for a while now but never actually introduced myself, mostly because I've not known how to describe my relationship to the climate crisis.\nBy trade I'm an entrepreneur, having started a handful of companies, the better-known ones including Mailbox (the app) and Bring a Trailer (classic car marketplace), and mostly recently Navigator (teamwork assistance).\nLately though I've been all-consumed with better understanding humanity's (broken) relationship to the broader ecosystem, how we got here, and what we might do about it. Along the way my understanding of myself, our culture, and our species has been completely rewritten, and to be honest I'm still experiencing the reverberation of so significant a mindset reset. Lately I'm pretty good at listening and learning, but not particularly useful for much else.\nIn case it's helpful to anyone else, I've been collecting a set of links and learnings here: https://paper.dropbox.com/doc/Climate-Crisis-and-Community--AtaYCJqEU5RuKehIVHGeAZbPAQ-z8Pjjmuce66124z5BL7AU",
    "Category": [
      "Entrepreneur"
    ],
    "Location": "Bay Area",
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/1704ef1a7817ad9f6cf8184d1eff25c1/043670f2/Gentry_Underwood_-_co-founder__Bring_a_Trailer__Crunchbase"
  },
  {
    "Name": "Drew Volpe",
    "Intro": "I’ve been a long time lurker and realized I never introduced myself. I’m a partner at FirstStar.vc, a pre-seed fund based in Boston. We focus new kinds of computing (AI, data, decentralization, …). We look at applications all industries from warehouse robotics to pharma to security. We’ve been spending much more time in climate and have made two investments so far.\nBefore this, I was a programmer and founder working in database systems, machine learning, and analytics. Years ago, I cofounded a location analytics startup which is how I originally met @Jason who was building RunKeeper. I’ve really enjoyed following along as he understands this stuff and learning from the MCJ community!",
    "Category": [
      "Investor",
      "Entrepreneur",
      "Data (Science)"
    ],
    "Location": "Boston",
    "ImageUrl": "https://dl.airtable.com/.attachments/dcce1d91d7e22e2ee10781ab932a17fa/82146781/Drew_Volpe_drewvolpe__Twitter"
  },
  {
    "Name": "Adam Besvinick",
    "Intro": "Hey everyone - excited to join the group here. I’m an early stage investor currently raising a new seed fund called Looking Glass Capital. One of our three areas of focus will be on sustainability, the environment, and climate change. Look forward to learning from everyone here!\n",
    "Category": [
      "Investor"
    ]
  },
  {
    "Name": "Steven Jiang",
    "Intro": "Hi everyone! I'm a student at Harvard Law and worked before on humanitarian efforts [Syria, Zimbabwe, Puerto Rico offices] on crises resulting from climate change. I've been working with three labs on commercializing climate tech and am involved with Social Impact Capital [impact-oriented vc]. I've been talking with a friend about potential ideas on and off but think it'd be awesome to learn from the broader community of y'all. I don't think continuing as strictly a law student matches the urgency of the situation so I would love to talk any and all ideas. My other background is in math/AI [graduated from Stanford in math at 19], human rights in Haiti, Madagascar, Israel, etc., and helping other startups working on deeptech/improving equity here and there.",
    "Category": [
      "AI",
      "Humanitarian Aid",
      "Entrepreneur"
    ]
  },
  {
    "Name": "Eddie Obropta",
    "Intro": "Hello Everyone. Super pumped to be added to the group with so many awesome people! I’m one of the cofounders at Raptor Maps (https://raptormaps.com/). We make software to automate mandatory solar inspections. I spend most of my time in Boston and think a lot about the transition to renewable energy and how I can help with my engineering/entrepreneurial background. We're based in Greentown Labs. Certainly say hello if you're in the neighborhood. ",
    "Category": [
      "Entrepreneur"
    ],
    "Location": "Boston",
    "ImageUrl": "https://dl.airtable.com/.attachments/1ecca6ef43f7103024584a5e9926fb27/2d93dd1a/Eddie_Obropta_EddieObropta__Twitter"
  },
  {
    "Name": "Phil Connaughton",
    "Intro": "Hey everyone,\nMy name is Phil Connaughton. I currently head up the consumer engineering team at ASICS Digital. Leading the dev teams for mobile apps (like Runkeeper) and ASICS ecom. I got to know Jason 8 years ago when I started at Runkeeper. He'll tell you I wore a clip-on tie to my interview, but that's not true.\nOver the past few years I've been spending more and more time thinking about how I can take my skillsets and apply them to the fight against climate change. I'm excited to be part of the community and to learn from the group how software engineers can contribute.\nI love snowboarding, hiking in the mountains and just generally being outside. It's important to me to ensure these experiences exists for many generations to come.",
    "Category": [
      "New Journey"
    ]
  },
  {
    "Name": "Kevin Johnson",
    "Intro": "Hello MCJ community! Glad that this forum is in place. I currently work at PG&E, the last few years in various innovation and strategy roles. Between CA’s mitigation policy focus on energy and transport, on adaptation to changing climate, and PG&E’s related bankruptcy, climate feels front and center. I’m also personally increasingly fascinated by carbon removal and natural climate solutions. Excited to see where this conversation goes. (edited)",
    "Category": [
      "Energy Systems",
      "Decarbonization"
    ]
  },
  {
    "Name": "Clay Dumas",
    "Intro": "Hello! Long time listener, first time caller. I work at Lowercarbon Capital, an early stage venture fund investing in tech to reduce CO2 emissions and remove carbon that’s already up in the sky. We also support research to help us buy more time. Thanks to @Jason for giving some structure to this ragtag group of people.",
    "Category": [
      "Investor",
      "Decarbonization"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/e5b391ea4683e5bb891f52e48f674a3d/eb06540c/Clay_Dumas__whitehouse.gov"
  },
  {
    "Name": "Matthieu Soule",
    "Intro": "Hello everyone, my name is Matthieu Soulé and I am working at the deputy CEO of l'Atelier BNP Paribas Americas based in San Francisco. I am leading the innovation lab effort regarding new business models and startup business development with a great emphasis on Climate change topics and SDGs in general since 12 months",
    "Location": "Bay Area"
  },
  {
    "Name": "Mike Miller",
    "Intro": "I spent 10 years in experimental particle physics chasing the building blocks of nature, then co-founded Cloudant (YCS08, HQ'd in Boston) and after exiting that co-founded Liquid 2 ventures, probably the most active seed fund in the states.  But...\nI'm increasingly obsessed with climate research, impacts, the science of adaptation and the companies and framework for getting out of this pickle.\nMCJ, along with about a year's worth of reading and research on the technical front has taken me from despondent to cautiously optimistic.  I'd say Jim McDermott's interview was the most influential thing I've encountered in that entire year.  I'm considering becoming a pawn for a company or org. that is directly working on climate instead of being a leader on something that dosen't directly project on solving this problem. </intro>",
    "Category": [
      "Entrepreneur",
      "Investor"
    ]
  },
  {
    "Name": "Jigar Shah",
    "Intro": "Hi everyone!  Sorry for the delay!  This is a great group and @Jason is amazing for putting us all together.  I amy still knows as the person that started SunEdison where we popularized “no-money-down solar” which has now attracted over a $Trillion of capital for solar deployment.  After SunEdison, I joined Richard Branson as the founding CEO of the Carbon War Room to help entrepreneurs address climate change. I wrote a book in 2013 called Creating Climate Wealth: Unlocking the Impact Economy.  In 2014 I joined 2 partners (Scott Jacobs, Matan Friedman) to start a dedicated platform to replicate the lessons from SunEdison.  We are creating a bridge to bankability for fuel cells, anaerobic digesters, renewable natural gas, behind the meter battery storage, electric buses, etc.  I have an engineering degree but pivoted to financial engineering a long time ago",
    "Category": [
      "Investor",
      "Finance",
      "Energy Systems"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/c94dbfa13b98957640eaa632e7a655bf/d4bf683c/Jigar_Shah_of_Generate_Capital_to_keynote_at_2019_Forum_-_Getting_..."
  },
  {
    "Name": "Brendan Kayes",
    "Intro": "Hi all,\nMy name is Brendan Kayes. I worked 10 years at Alta Devices (https://www.altadevices.com/), 1 year at Avogy (https://nexgenpowersystems.com/avogy-inc-raises-40-million-series-b-round-led-by-intel-capitalleading-mover-in-power-supply-technology-will-use-funds-to-expand-platform-and-go-to-market-strategy/), and since November I've been at Antora Energy (https://www.cyclotronroad.org/antora), where I am the Senior Director of PV R&D.\nI wanted to join the MCJ slack group because (for better or worse!) I'm trying to make my way in a Bay Area-based, climate-tech-focused career, and I figure we all need all the help we can get. I emigrated to California from New Zealand to attend grad school at Caltech in Applied Physics (in the groups of Harry Atwater and Nate Lewis), after being inspired by attending a two week summit in Switzerland (https://www.myclimate.org/information/education/detail-education-projects/show/Project/yes-impact-labs/) during my final year of college in Auckland. The morning after I landed back in Auckland, 9/11 happened. Since then I've been trying to apply my skillset and interests to renewable energy and cleantech.\nAlso, recently a group of us have filed a class action lawsuit against Alta Devices (to recover unpaid wages) (https://dockets.justia.com/docket/california/candce/5:2020cv00296/353866), which we're trying bring some media attention to (see also: https://pv-magazine-usa.com/2019/12/31/shutdown-continues-at-hanergy-owned-alta-devices-high-efficiency-pv-pioneer/). Please let me know if any of you have connections in the news media for a story like this.\nThanks Jason, and thanks all!\nBrendan.",
    "Category": [
      "Engineer"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Chad Laurans",
    "Intro": "Hello all!  I'm Chad and I spent the last 10+ years founding and building SimpliSafe (consumer IoT startup, disrupting the traditional home security industry). Based in Boston.  I just transitioned from full-time CEO to part-time Chairman and am taking advantage of this moment to start my climate journey.  Jason's podcasts have been an amazing intro (thanks!).  I'm interested in figuring out if what I know already, or can learn now, will be useful in the climate fight.",
    "Category": [
      "Entrepreneur"
    ],
    "Location": "Boston"
  },
  {
    "Name": "Brenden Millstein",
    "Intro": "Hi everyone, Brenden Millstein here, co-founder of Carbon Lighthouse (https://www.carbonlighthouse.com). We make it profitable for commercial and industrial buildings to become carbon neutral, and to date have eliminated the emissions of 10 power plants. By the way we track power plants that leaves us ~49,990 left to stop climate change. We'll get there! I'm excited I already know some of you, and even more excited that I don't yet know the majority of the folk here! Plenty of climate change left to stop. Looking forward to stopping it with y'all.",
    "Category": [
      "Energy Systems",
      "Decarbonization",
      "Buildings"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/3b5475959984d5b61475e031bae7527e/21b71adc/Brenden_Millstein_-_CEO_-_Carbon_Lighthouse__LinkedIn"
  },
  {
    "Name": "Josh Moser",
    "Intro": "Hi all! My name is Josh Moser. I am technically in between opportunities but am imminently joining a very early-stage venture in the sustainable food space – I can’t say much at this point but it’s seaweed related. Most recently, I was working on strategy and finance for Phylagen (http://phylagen.com/), which is helping companies build ethical and sustainable supply chains by leveraging the environmental microbiome as a traceability tool. Prior to that, I’ve had various environment-related roles, including at Credit Suisse (investment banking work on solar transactions), the U.S. Green Building Council, and the Brattle Group. I’m eager to get more involved in the climate community in the Bay Area so if any of the above is of interest or if getting together for coffee is of interest, please reach out! Excited to be here.\nphylagen.comphylagen.com\nPhylagen: Digitizing the Global Microbiome\nTrust your products, let them tell you where they came from. Every object & every place has a naturally-occurring microbial fingerprint. We verify the origin of goods in global supply chains using the microbiome.",
    "Category": [
      "Food System"
    ]
  },
  {
    "Name": "Ryan Hagen",
    "Intro": "So happy to see all the passion around this topic and amazing work being done by everyone :) Thanks for making this happen Jason!\nI'm a huge sustainability nerd and the founder of Crowdsourcing Sustainability. Our mission is to unleash the collective power of people around the world to help reverse global warming.\nI write a weekly climate and sustainability newsletter (thousands of people getting it from 50+ countries now). I basically write the newsletter that I would want to get on this stuff. Useful info/insights/stories, more inspiration than doom and gloom, meaningful actions you can take. Would love to have the privilege of writing to you :)\nhttps://app.convertkit.com/landing_pages/443105/\nThe ultimate vision is to harness our collective wisdom and help companies, universities, governments, etc. to eliminate GHG emissions ASAP. Not quite there yet but making good progress.\nAnyway, I'm really looking forward to sharing this space with you all and figuring out how we can work together on this critical issue!",
    "Category": [
      "Community Organizing"
    ],
    "Link": "https://crowdsourcingsustainability.org/"
  },
  {
    "Name": "Jesse Hynes",
    "Intro": "Hi everyone!  My brother, @Evan Hynes, and I are building Climate.Careers. We've been live for about 7 months, but haven't yet formally \"launched\" – though we will soon!\nIt seems like I'm quite a bit younger than the average person in this group (the youngest?) – and I know I stand to learn a lot from folks in this community. I'm eager to connect with and get advice from seasoned entrepreneurs operators, investors, etc. If that sounds like you, and you're interested in the work Evan and I are doing at Climate.Careers, please let me know! My email is jesse@climate.careers",
    "Category": [
      "Entrepreneur",
      "Careers"
    ],
    "Link": "http://climate.careers"
  },
  {
    "Name": "Cody Simms",
    "Intro": "I’m based in Los Angeles and am an investment partner at Techstars.  Techstars is one of the most active early stage startup investors in the world via our vast network of accelerator programs. I oversee much of the follow-on investment activity we do across our portfolio as our accelerator graduates continue to grow and scale, and I’m working hard to get smarter in the climate and sustainability space.  I’m trying to do what I can to focus more of my investment time and energy in this direction.  I’m really looking forward to learning from you all! Thanks to @Jason for adding me and to @Zoe Schlag for suggesting that I request an invitation! ",
    "Category": [
      "Investor",
      "Accelerator / Incubator"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/8b7e506918c0318a68ed6ed0bd04b2bf/cd9530bb/Cody_Simms_-_Techstars_Mentor"
  },
  {
    "Name": "sanchali ",
    "Intro": "Hi everyone, I’m Sanchali, Co-founder & CEO of Joro, based in Oakland. I spoke with @Jason way back in episode 4. We’re mobilizing people to take collective climate action, starting with their own carbon footprints and sphere of influence.\nI’m always excited to talk about catalyzing collective action, developing carbon intuition, and improving access to quality carbon offsets.\nWould also love this community’s feedback on the app: http://bit.ly/joro-tech!",
    "Category": [
      "Community Organizing",
      "Decarbonization",
      "Entrepreneur"
    ],
    "Location": "Bay Area",
    "Link": "https://joro.tech/"
  },
  {
    "Name": "Chris Kohlhardt",
    "Intro": "Hi! My name is Chris Kohlhardt and I split my time between San Francisco and Truckee, California. I founded, built, ran, and sold a software company (http://www.gliffy.com) -- One big reason I sold the company was so I could put a greater focus on climate change work. That work now includes both philanthropy and for-profit work primarily using drawdown.org as a starting point. My areas of interest right now include 1) Identifying ways to deploy philanthropy dollars toward climate change work 2) Finding ways to improve the health of the Sierra forests and hopefully sequester more carbon at the same time 3) Making early stage investments in startup companies focused on climate change work 4) Identifying what makes up a zero emissions home 5) Figuring out how to build an investment portfolio with a climate first focus -- If you have interest or experience on any of these, let's talk! (edited)",
    "Category": [
      "Entrepreneur",
      "Decarbonization",
      "Investor"
    ],
    "Location": "Bay Area",
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/bb5b44f042e63e096fda10d9586ab40f/d5c2c9e5/Chris_Kohlhardt__Crunchbase"
  },
  {
    "Name": "Mo Niknafs",
    "Intro": "Hi all!\nWho/what am I?\nI’m the Founding Analyst for Negative Emissions Markets at Deep Science Ventures. I originally joined DSV to scope Negative Emissions Technologies, but it quickly became apparent that the primary bottlenecks to accelerated NET deployment are at the market end.\nMy remit is (a) to create ventures in the Negative Emissions Markets Space (hoping for 3 by the end of April) and (b) to beat @Dom at board games.\nHow did I get here?\nI studied Mechanical Engineering with an emphasis on polymer processing and human-centred design.\nUpon graduating, I joined LabGenius (a Synthetic Biology + AI startup) as part of the founding team. I stayed with LabGenius for four glorious years from 3 people to 30, but ultimately left to work more directly on climate-related problems. It was a progressively growing itch I couldn’t ignore anymore.\nIf anyone is interested in the Negative Emissions Space - I’d love to hear your thoughts! Also, if it looks like I could be helpful in any way, please get in touch :)",
    "Category": [
      "Investor",
      "Decarbonization",
      "Accelerator / Incubator",
      "Research"
    ],
    "Location": "London",
    "Link": "https://dsv.io",
    "ImageUrl": "https://dl.airtable.com/.attachments/8eab5e5dfe5fc9a238baf78281e4fe2c/3773d0be/Mo_Niknafs_-_Overview__Crunchbase"
  },
  {
    "Name": "Vincent Manier",
    "Intro": "Hello, my name is Vincent Manier, French. I work as CFO at ENGIE Impact (subsidiary of ENGIE Group, a global energy company focusing on 0-carbon transition, renewables, energy efficiency), based in NYC - https://www.engieimpact.com/leadership/vincent-manier - my main focus is to find ways to accelerate the transition to a low-carbon economy via innovative business models and financing solutions.\n\nMy main focus is on speed of transition - we have the solutions, business cases make sense for most corporates / cities, financing is widely available but complexity and lack of education are slowing down our progress. As CFO, I am looking for innovative solutions to mobilize capital faster and enable the implementation of these solutions. I am also committed to changing the mindset of corporate finance at ENGIE and beyond - as I believe everybody has a major role to play in the decarbonization of our economy. https://www.financedigest.com/sustainability-get-used-to-the-new-normal.html ",
    "Category": [
      "Energy Systems",
      "Finance",
      "Decarbonization"
    ],
    "Location": "NYC"
  },
  {
    "Name": "Matt Gordon",
    "Intro": "Hi folks.  I’m Matt Gordon (@DrMattyG on Twitter), I work at Kairos Aerospace (www.kairosaerospace.com) in Mt View, CA.  We have developed a sensor for aerial surveys of methane emissions, which we use to survey for natural gas leaks in gas infrastructure.  I gave a deep dive on our tech stack last year at PyCon:\nhttps://www.youtube.com/watch?v=WQkM3ppuhWo",
    "Category": [
      "Methane",
      "Remote Sensing"
    ],
    "Location": "Bay Area"
  },
  {
    "Name": "Oliver Bruce",
    "Intro": "Hey all, I’m Oliver Bruce - was a former climate activist and then was early at operations at Uber. I'm now an angel investor investing in climate mitigation/adaptation technologies based in New Zealand (portfolio includes terminatorbreaker.com, Carbonscape.com, mevo.co.nz and rideweel.com). I also do the Micromobility podcast with Horace Dediu with a focus on how the disruption of urban transport by lightweight electric vehicles is a part of the puzzle of how we break our car dependency/urban built form. I'm currently advising the NZ government on strategies to accelerate the adoption of these vehicles to reduce emissions in the transport sector.\n\n12:36\nTalk to me about 1) Micromobility, especially around transport emissions and 2) Edmund Hillary Fellowship (ehf.org.nz - I'm an Investor Fellow)\n12:36\nPodcast link: micromobility.io/podcast",
    "Category": [
      "Investor",
      "Policy"
    ],
    "Location": "NZ"
  },
  {
    "Name": "Nishant Mani",
    "Intro": "Hi all. Nishant Mani here - I'm excited to join the community (thanks @Jason for the podcast and for bringing us together!) I'm a consumer startup CMO (companies including Fabric/Winc/Dashlane) and have been an analytics/data science guy since the start of my career. I'm early in my climate journey, and am taking the coming months to learn as much as I can (from this fantastic group) before I pick a climate lane and do everything I am able to.\nI'm particularly interested in where my skill sets  of analytics/data science + consumer action/opinion/behavior change can have big impact. Outside of reading & listening, I've started doing some projects on the above, and am eager to hear suggestions that folks may have on how I can help. Look forward to engaging with folks.",
    "Category": [
      "Operator",
      "Marketing",
      "Analytics",
      "New Journey"
    ],
    "Location": "NYC",
    "ImageUrl": "https://dl.airtable.com/.attachments/6fb480a79bc8aefe496ffc862bbf293d/a6caa451/Nishant_Mani_-_CMO__Winc__Crunchbase"
  },
  {
    "Name": "Hilary Karls",
    "Intro": "I'm Hilary, a software engineering manager based in SF.  I've been working in startups / hyper growth for the past 12 years, and before that worked on WiserEarth and CleanTech Open. Over the past year I've started angel investing, and have invested in a startups in circular economy space. Excited to get back into Climate tech, and see where my skillset might be helpful!",
    "Category": [
      "Technologist"
    ]
  },
  {
    "Name": "Ian Chipman",
    "Intro": "Hi all! New to the MCJ slack, but have been enjoying the pods tremendously. My name is Ian Chipman, and I'm the Director of Content & Media at Elemental Excelerator, a climate-tech startup accelerator. I spent a chunk of my career bouncing around in various storytelling corners (digital publishing, longform journalism, libraries, early literacy, graphic novels). My personal \"climate journey\" kicked into higher gear when I started writing/reporting on climate-related startups, policy, and academic research coming out of Stanford a few years back. It was fascinating and inspiring to learn from so many passionate, driven people, and I decided I wanted to pursue climate work in its entirety (as much as a writer-type person can) so joined with Elemental to help shine a light on the incredible work being done by our stable of entrepreneurs. My absolute favorite part of my job is meeting and learning from folks who are passionate about climatefixing, so I'm thrilled to have been invited by @Jason to join this group and learn from the towering collective wisdom on display here!",
    "Category": [
      "Journalist",
      "Investor"
    ]
  },
  {
    "Name": "Christophe Jospe",
    "Intro": "Hi everyone, nice to be on here. I'm an entrepreneur obsessed with removing carbon dioxide from the atmosphere. I am currently building up a the supply of carbon removal from US croplands with with @Paul Gambill and @Ross Kenyon (Nori).\nSelf promo: here's a link to a new newsletter I'm starting.  https://medium.com/@cjospe/im-restarting-a-newsletter-for-me-for-you-and-for-the-climate-d73aedf5962e",
    "Category": [
      "Entrepreneur",
      "Decarbonization"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/08d5eb3546e80a0a48f88abf7c975c6b/baea105e/Introducing_Christophe_Jospe_-_Nori_-_Medium"
  },
  {
    "Name": "Nicole Kelner",
    "Intro": "Hi all! I’m Nicole Kelner, I previously co-founded The Coding Space, an after school program to help kids learn to code. It got acquired in April and I stayed on for 8 months after. I quit about a month ago and have decided to dedicate my time and energy towards working at the intersection of climate change and technology. I’ve been consulting for the Biomimicry Institue for a few months now and volunteering with Surfrider Foundation. I was living in LA for the past year, but just got an offer to move back to NY and be a part of a 3 month coliving/hacker house type program (it isn’t public yet so I can’t share too much information). I’m really excited for the chance to spend the next few months prototyping new ideas and would love to meet up with any other New Yorkers here!\nI’ve been on here for a few months but been too shy to introduce myself. I’m still in the absorbing as much information as possible phase in my journey but have decided I’m ready to start having conversations and sharing what I’m learning publicly! MCJ has been a huge help in getting up to speed and really grateful to be here!  (edited)",
    "Category": [
      "Education",
      "Community Organizing"
    ]
  },
  {
    "Name": "River Bennett",
    "Intro": "Howdy! I work as a Nuclear Policy Analyst at the Nuclear Innovation Alliance (https://www.nuclearinnovationalliance.org/). We're a think tank focused on accelerating development and commercialization of advanced nuclear reactors. Previous to entering nuclear/climate world I was focused on global water and sanitation access and worked with organizations including charity: water, Water for People, and Global Brigades. Stoked to learn from you all!\nIn terms of NIA's work, I think people here might find one of our recent reports interesting. The focus is on how the demonstration roadmap for advanced nuclear can be modeled on COTS (Commercial Orbital Transportation Services) - the federal program that launched :rocket: SpaceX.\nhttps://www.nuclearinnovationalliance.org/search-spacex-nuclear-energy\nnuclearinnovationalliance.orgnuclearinnovationalliance.org\nIn Search of a SpaceX For Nuclear Energy | NIA\nNASA's commercial development programs have helped nurture a U.S. commercial launch industry. This report evaluates the successes of NASA's COTS program to identify potential lessons for commercializing the advanced nuclear industry. It proposes that DOE establish a similar program to enable federal procurement to drive commercialization.",
    "Category": [
      "Policy",
      "Nuclear",
      "Water"
    ]
  },
  {
    "Name": "Maria Fujihara",
    "Intro": "I'm Maria Fujihara, founder and CEO of SINAI Technologies (www.sinaitechnologies.com). We help big corporations to build and implement a carbon strategy, by defining their most cost-beneficial internal carbon price (this includes building low carbon scenarios by a range of mitigation options, calculate carbon budgets, input emissions reductions targets and do external scenario analysis, such as Paris Pledges or prices for offsets).\nI'm a long time advocate for the sustainability cause (www.mariafujihara.com).\nTLDR: Worked +8 years for the Brazilian Green Building Council (lead the internationalization of the LEED certification tool in Brazil and 5 other countries in Latin America, developed the first women in green power breakfast in the region and lead the implementation of the first sustainability regulation for Sao Paulo municipality). I was also advisor to Project Drawdown (Paul Hawken is a dear long time friend), and graduated from Singularity University, in NASA Research Park in 2017, after winning a scholarship from google to start companies that would impact humanity positively.\n",
    "Category": [
      "Decarbonization",
      "Buildings",
      "Entrepreneur"
    ]
  },
  {
    "Name": "Erwin Kuhn",
    "Intro": "Hello everyone! Student in energy & environment from the Ecole Polytechnique in Paris here. I am also working with one of the largest cement companies in France on a complete quantitative roadmap towards 100% decarbonization of their worldwide activities.\nMy main background is in theoretical computer science and in past lives I've been a food photographer and digged deep into the fields surrounding cryptocurrencies and data markets. I pivoted into the climate fight last summer after deciding it was by far the most important thing I could be working on.\nUpcoming projects include a blog with the posts that I'd wanted to have when diving into subjects I've researched (DAC, critical metals, cement industry) and building a science-fiction collective to explore positive, definite views of surviving climate change from a diversity of perspectives.\nExcited to exchange with as many people as possible and let's see what serendipity brings! (edited)",
    "Category": [
      "Cement",
      "Research",
      "Data (Science)",
      "Computer Science"
    ]
  },
  {
    "Name": "Sunil Paul",
    "Intro": "https://linkedin.com/in/sunilpaul - currently angel investor. Notable investments: Solar Mosaic (largest solar lender in US) and two IPOs of cleantech companies (Solazyme and Oneroof). In non-climate: Linkedin, Support.com. As entrepreneur I started first ridesharing company, Sidecar, incubated Getaround, and started first anti-spam/email security company, Brightmail. Also in related non-profit work, did the Gigaton Throwdown study in 2008-09 and created political org, Clean Economy Network.\n\nMy current interests is creating a new company / companies to implement a new idea to accelerate adoption of EVs. Am looking for help with three things: 1) feedback on the concept and contest - see https://springfreeev.com - 2) help in promoting the contest 3) contestants ... will x-post to #general",
    "Category": [
      "Investor",
      "Entrepreneur"
    ]
  },
  {
    "Name": "Marshall Moutenot",
    "Intro": "Howdy folks. I run https://upstream.tech - we build decision-making tools for conservation and clean energy using :satellite: + ML. Most recently we launched hydroforecast.com and work with a bunch of hydropower utilities, conservation groups, and other water stakeholders to forecast water quantity and quality. About two years ago, we became part of Natel Energy (natelenergy.com), which builds a fish-safe, distributed hydro turbine. Super cool.\nAnd I had the pleasure of joining Jason on Episode 27! I see a lot of familiar names so I'm looking forward to seeing where this group goes. I'm based in Boston and always glad to grab a coffee and complain about cars! (edited)",
    "Category": [
      "Entrepreneur",
      "Remote Sensing",
      "Water"
    ],
    "Location": "Boston"
  },
  {
    "Name": "Laura Wittig",
    "Intro": ":wave: hey folks! I’m Laura, founder of Brightly (https://brightly.eco) – a new platform that scales conscious consumerism through content, community, and brand recommendations. We reach thousands of millennial + Gen Z women every day through our platform and new podcast, Good Together, which was picked up for a weeks-long feature by Apple over the holiday season :slightly_smiling_face: I’m based in the Bay Area, but will be relocating to LA for 3 months to participate in an accelerator run by one of the top social apps out there (can’t say which one until they do a press release!) here’s a link to our podcast: https://podcasts.apple.com/us/podcast/good-together-ethical-eco-friendly-sustainable-living/id1474709653\n:pray: ASK: Looking to connect with those who are interested in mitigating climate change through conscious consumerism, mobile storytelling, and community-driven initiatives. Also, podcast guests! We’ll also be fundraising coming out of the accelerator in the summer so we’re connecting with VCs/angels who are excited about climate x consumer.\n:left-facing_fist: OFFER: I’m a former product manager/designer and I’m obsessed with automation. Happy to share flows we’re using at Brightly to scale our business processes despite being a tiny (but growing) team!\nBrightlyBrightly\nBrightly | All Things Ethical + Sustainable\nActionable wellness advice from experts, vetted lifestyle recommendations + a curated shop of ethical fashion, clean beauty, and homegoods from Brightly.eco(1 MB)\nhttps://cdn.brightly.eco/wp-content/uploads/2019/11/25085708/Community-OG.png\nApple PodcastsApple Podcasts\n‎Good Together: Ethical, Eco-Friendly, Sustainable Living on Apple Podcasts\n‎Leisure · 2020(376 kB)\nhttps://is5-ssl.mzstatic.com/image/thumb/Podcasts113/v4/ad/6a/74/ad6a7484-6939-ddac-36f5-1bf4edc5c29c/mza_5137404320329920273.png/1200x630wp.png",
    "Category": [
      "Media",
      "Conscious Consumerism"
    ]
  },
  {
    "Name": "Ryan Allard",
    "Intro": "Hi everyone, thanks for being you! Looking forward to meeting you all and generating more excitement about the change we're all working towards. I am a Senior Fellow at Project Drawdown which researches and communicates the most substantive solutions to Climate Change. Jason interviewed our ED, Jon Foley on Ep68. I focus on transportation and building solutions, but I also have an interest in sustainable tourism more generally which has both climate and many non-climate benefits. I live in Trinidad and Tobago, but have lived/studied/worked in two continents and four islands, which is enlightening. Let me know how I can help you.",
    "Category": [
      "Decarbonization",
      "Tourism"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/15182728333eaab061883f25e74e4fd2/c8b7b53d/Episode_6_Transport_with_Ryan_Allard_-_The_Drawdown_Agenda"
  },
  {
    "Name": "Damien Tanner",
    "Intro": "Hey, I’m a founder of a handful of tech companies including Pusher.com and thoughtbot.com. I’m part of openclimatefix.org (you’re all invited to get involved!) and at my venture studio http://rebase.ventures we are building SaaS for climate, starting with a platform for better online conferences. (edited)",
    "Category": [
      "Entrepreneur"
    ],
    "Flag": true,
    "ImageUrl": "https://dl.airtable.com/.attachments/e0097f7d3e2cc52ccd0fc4d61c464cc6/769e7de6/Damien_Tanner_-_Quora"
  },
  {
    "Name": "Jade ",
    "Intro": "Hi everyone I'm Jade. My career has been in early-stage tech startups and VC in London and Berlin. My last job was helping grow Entrepreneur First (joined as employee #3) for 4 years - it's the world's leading talent investor and it has helped 1,000+ people in 6 countries create 200+ companies worth $1.5bn. I'm now looking at early-stage VC roles in Europe tackling the climate crisis.",
    "Category": [
      "Investor"
    ],
    "Location": "London"
  },
  {
    "Name": "Dan Chown",
    "Intro": "Hey all! Thrilled to be here in such exceptional company. My name is Dan Chown and I am currently a mechanical engineer at Achates Power where I lead several of our engine development projects (we are working on two-stroke engines which have promise of higher efficiency and lower emissions across applications from heavy duty trucking to pickup trucks). I’m here in a personal capacity and excited to further my climate journey – thank you @Jason for such a powerful forum! I aspire to lead engineering teams developing solutions for hardcore decarbonization – if you need someone to bring a concept to a design, rendering, or prototype, or model an energy system, send me a message! Currently, in addition to my \"day job\" I'm developing some low cost atmospheric sensor prototypes (Arduino based, more to come on that!) and I play drums and bass (at the same time!) in a music duo called TASMIC. I’m looking forward to joining the community!"
  },
  {
    "Name": "Matt Weiss",
    "Intro": "Hey everyone, great to be here… what a group! I’m Matt. I lead the CoLab over at IDEO in Cambridge, MA, and I’m on my own climate journey of sorts (incredibly thankful Jason’s making his so accessible). Simplest way to describe the CoLab is as a collaborative R&D lab. We’re a group of designers—of all types—who love working on tricky, system-level design challenges that require collaboration across industries and organizations. Increasingly, climate topics are surfacing to the forefront of our work. Happy to be here and looking forward to diving in, meeting folks, and hopefully helping to bring design and activation energy to this network as we can. In case they haven’t intro’d themselves, there are a few others the team here as well, cc @Parker @Shuya Gong @Christina Johangten. Thx Jason for having us, and for doing what you’re doing!",
    "Category": [
      "Designer",
      "Systems"
    ],
    "Location": "Boston"
  },
  {
    "Name": "Baptiste ",
    "Intro": "Hey everyone :wave:\nI’ve only joined MCJ Slack yesterday and I’m already learning a lot. Friends and family are completely clueless/not interested in this topic (I’m the family weirdo that stopped eating meat), so it’s a great place to read/learn from like-minded people.\nI’m originally from France, but I’ve started a US company earlier this year called Know Eat All :nerd_face:\nhttps://knoweatall.co/\nWe’re building the first sustainable cooking app, to help individuals understand and reduce their dietary carbon footprint + figure out what to eat on a warming planet. We’re in open beta so you can already use the app on iOS: https://testflight.apple.com/join/2WNNrQ8j\nFeedback is more than welcome. We make all recipes, photography and code in-house.\nWe calculate the carbon footprint of each recipe (for each month of the year as it varies drastically with seasonality), in your region (currently covering US and France), and suggest the ones that have the smallest footprint. One meal may seem like a drop in the ocean, but it quickly adds up, agriculture and what we eat making up to 27% of GHG emissions (source: https://www.mckinsey.com/industries/agriculture/our-insights/agriculture-plays-a-critical-role-in-limiting-the-impact-of-climate-change).\n“Fun” fact: an out-of-season ingredient has a carbon footprint that’s 5 times bigger on average than a seasonal one. I’m never buying eggplant in December anymore :man-shrugging: .\n",
    "Category": [
      "Entrepreneur",
      "Food & Ag"
    ]
  },
  {
    "Name": "Andrew Parker",
    "Intro": "Hi all, I'm Andrew Parker. I was previously a GP at Spark Capital. I'm currently exploring what's next.\nBefore Spark I was working at Union Square Venture. Mostly a career VC at this point, but spent a short time in product design after undergrad.\nI'm excited to join this Slack group to learn from so many smart folks. I've been trying to absorb information about climate solutions through media, and this feels like a great next resource to explore. I'm grateful for the invite Jason, thanks!",
    "Category": [
      "Investor"
    ]
  },
  {
    "Name": "Alex Taussig",
    "Intro": "Hi everyone! My name is Alex Taussig. I’m a partner at Lightspeed in Silicon Valley. We’re a global venture capital firm ($9B AUM) with offices in the US, India, China, Singapore, and UK. I write a newsletter each week called Drinking from the Firehose and penned a piece on climate change a few weeks ago that folks may find interesting: https://firehose.substack.com/p/firehose-155-a-climate-for-change",
    "Category": [
      "Investor"
    ],
    "ImageUrl": "https://dl.airtable.com/.attachments/8823dd6957ae3106815d71e17d816a68/b47fe0d2/Alex_Taussig__Medium"
  },
  {
    "Name": "Bryan Guido",
    "Intro": "Bryan Guido Hassin - @guido23 on twitter. Career tech startup entrepreneur - one big win, a few smaller wins, a few learning experiences. During the first part of my career my ventures mostly helped energy companies rape and pillage more profitably. I had an epiphany and underwent my own climate journey about 10 years ago and have been focused on startups that create positive climate value since.\nDisappointingly, I haven't yet had the same scale of success with my climate-focused ventures that I had with my earlier ventures. My IOT smart energy startup, http://SmartOES.com, was just acquired but it was much more of a single than a home run. This podcast came along at a very convenient time for me, as I'm trying to expand my mind about what else is possible and significant in climate venture; I really enjoyed @Sarah Kearney's episode about new ways to move capital to early stage climate startups. It isn't clear what I will dive into next but I've joined the board of one decarbonization startup and am advising a few others for the moment.\nI'm based in Chapel Hill, NC (where we may be launching a decarbonization accelerator soon!) but spend a lot of time in Houston, TX and Lausanne, Switzerland, where I had previous ventures. I used to be a runner like @Jason but recently discovered and fell in love with masters track & field so now I'm a sprinter! :smile:\nIf anyone is working on energy efficiency, demand response, grid optimization, or C&I buildings, I have a lot of recent experience and contacts in those areas that I'm happy to share.\n\n\n2 months agoView thread",
    "Category": [
      "Entrepreneur",
      "Energy Systems"
    ]
  }
]
